[
  {
    "slug": "cyber-attack-causes-delays-at-heathrow-and-other-european-airports",
    "title": "Cyber-attack causes delays at Heathrow and other European airports",
    "category": "News",
    "subcategory": "News3",
    "category_slug": "news/news3",
    "date": "2025-09-20",
    "excerpt": "Heathrow is among several European airports hit by a cyber-attack affecting an electronic check-in and baggage system.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/5d50/live/51b0d0e0-9614-11f0-90f2-5f87cb020b24.jpg",
    "source": "https://www.bbc.com/news/articles/c3drpgv33pxo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<p>Heathrow is among several European airports hit by a cyber-attack affecting an electronic check-in and baggage system.</p>\n<p>The airport warned of possible delays due to a \"technical issue\" affecting software provided by Collins Aerospace to several airlines.</p>\n<p>Brussels Airport said a cyber-attack on Friday night meant passengers were being checked in and boarded manually, while Berlin's Brandenburg Airport also reported longer waiting times due to the problem.</p>\n<p>RTX, which owns Collins Aerospace, said it was \"aware of a cyber-related disruption\" to its system in \"select airports\" and that it was working to resolve the issue as quickly as possible.</p>\n<p>The company added: \"The impact is limited to electronic customer check-in and baggage drop and can be mitigated with manual check-in operations.\"</p>\n<p>It said the attack hit its Muse software - which allows different airlines to use the same check-in desks and boarding gates at an airport, rather than requiring their own.</p>\n<p>The BBC understands that British Airways is operating as normal using a back-up system, but that most other airlines operating from Heathrow have been affected.</p>\n<p>Hundreds of flights have been delayed at the airports throughout Saturday, according to flight tracker FlightAware.</p>\n<p>Lucy Spencer said she had been queuing to check in for a Malaysia Airlines flight for more than two hours, and that staff were manually tagging luggage and checking passengers in over the phone.</p>\n<p>\"They told us to use the boarding passes on our phone, but when we got to the gates they weren't working - they've now sent us back to the check-in gate,\" she told the BBC from Heathrow's Terminal 4, adding that she could see hundreds of people queuing up.</p>\n<p>Another passenger, Monazza Aslam, said she had been sat on the tarmac for over an hour \"with no idea when we will fly\", and had already missed her onward connection at Doha.</p>\n<p>\"I've been at Heathrow with my elderly parents since 05:00,\" she said, adding: \"We are hungry and tired.\"</p>\n<p>However, Luke Agger-Joynes said that while queues in Terminal 3 were \"much larger than normal\", the airline for his US flight and the airport \"seem to be prepared and the queues are moving much faster than I feared\".</p>\n<p>He added: \"They are also calling out specific flights and picking people out of the queue to ensure they don't miss their flights.\"</p>\n<p>Heathrow said additional staff were at hand in check-in areas to help minimise disruption.</p>\n<p>\"We advise passengers to check their flight status with their airline before travelling to the airport and arrive no earlier than three hours before a long haul flight or two hours for a domestic flight.\"</p>\n<p>Transport Secretary Heidi Alexander said she was aware of the incident and was \"getting regular updates and monitoring the situation\".</p>\n<p>EasyJet and Ryanair, which do not operate out of Heathrow but are among Europe's biggest airlines, said they were operating as normal.</p>\n<p>Brussels Airport said there would be a \"large impact on the flight schedule\", including cancellations and delays. Long queues and large crowds could be seen at the airport on Saturday morning.</p>\n<p>Europe's combined aviation safety organisation, Eurocontrol, said airline operators had been asked to cancel half their flight schedules to and from the airport between 04:00 GMT on Saturday and 02:00 on Monday due to the disruption.</p>\n<p>It said \"similar issues\" were affecting Dublin Airport,<strong> </strong>which has yet to comment publicly.</p>\n<p>Separately, Dublin Airport said its Terminal 2 had been evacuated as a safety precaution and that \"flight operations may be temporarily impacted\". The reason for the evacuation has not been disclosed.</p>\n<p>Travel journalist Simon Calder said that \"any disruption is potentially serious\" at Heathrow, given it is Europe's busiest airport, and that \"departure control is a really complex business\".</p>\n<p>He told the BBC: \"These things are all interconnected, so a little bit of a problem in Brussels, in Berlin... people start missing connections, planes and passengers and pilots are not where they are meant to be, and things can get quite a lot worse before they get better.\"</p>\n<p>It was only last September that a global IT crash due to a faulty software update from cybersecurity firm Crowdstrike <a href=\"https://www.bbc.co.uk/news/articles/cpd9jzrygnno\">caused disruption to aviation</a>, grounding flights across the US.</p>\n<p>Analysts said at the time that the incident highlighted how the industry could be vulnerable to issues with digital systems.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c3drpgv33pxo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "son-of-british-couple-held-by-taliban-ecstatic-as-they-return-to-uk",
    "title": "Son of British couple held by Taliban 'ecstatic' as they return to UK",
    "category": "News",
    "subcategory": "News3",
    "category_slug": "news/news3",
    "date": "2025-09-20",
    "excerpt": "The son of an British couple detained by the Taliban in Afghanistan for nearly eight months has said he is \"overwhelmed\" by their release.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/8658/live/2f0ef280-95ea-11f0-90f2-5f87cb020b24.jpg",
    "source": "https://www.bbc.com/news/articles/cly6ve2dg66o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Son of British couple held by Taliban 'ecstatic' as they return to UK</h1>\n    <p>The son of an British couple detained by the Taliban in Afghanistan for nearly eight months has said he is \"overwhelmed\" by their release.</p>\n    <p>Peter Reynolds, 80, and his wife Barbie, 76, who lived in Afghanistan for nearly two decades, are due to fly to the UK on Saturday after being reunited with their daughter in Qatar.</p>\n    <p>Jonathan Reynolds told BBC Radio 4's Today programme that he was \"ecstatic and massively grateful\" to those who were involved in securing their release.</p>\n    <p>The Taliban, who detained the couple on their way home on 1 February, said the pair had broken Afghan laws and were released after judicial proceedings - but the Islamist group has never disclosed a reason for their detention.</p>\n    <p>There <a href=\"https://www.bbc.com/news/articles/c0q7l8ewj0wo\">were emotional scenes on Friday</a> as the couple's daughter, Sarah Entwistle, met her parents as they stepped off the plane in Doha.</p>\n    <p>\"We are looking forward to returning to Afghanistan if we can. We are Afghan citizens,\" Barbie told Agence France-Presse at Kabul airport after Qatar-brokered negotiations for their release.</p>\n    <p>Their son Jonathan echoed those hopes, saying \"their desire would be to carry on living there and to do the work they were doing\".</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1b86/live/87974e00-95d8-11f0-90f2-5f87cb020b24.jpg.webp\" alt=\"Reuters Barbie Reynolds, who was released from Taliban detention in Afghanistan, is greeted by her daughter Sarah Entwistle \"/>\n    <p>UK Prime Minister Sir Keir Starmer praised the \"vital role\" played by Qatar in securing their release.</p>\n    <p>Peter and Barbie Reynolds married in Kabul in 1970 and spent the past 18 years running a charitable training programme that had been approved by local Taliban officials when the armed group reclaimed power in 2021.</p>\n    <p>\"They have not just a heart for the people of Afghanistan, but they have strategy as well, and the work they've been doing has been very fruitful and has a massively positive impact,\" Jonathan told the BBC.</p>\n    <p>He said a few weeks ago he had managed to share the results of \"really encouraging\" reports about their programmes with his parents over the phone.</p>\n    <p>He said Barbie's initial reaction had been that they had \"more work to do\".</p>\n    <p>\"But how do you do that in a country where you're not welcome,\" Jonathan added.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c222/live/f13ff320-95d8-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"Reuters Peter Reynolds, who was released from Taliban detention in Afghanistan, walks with his daughter Sarah Entwistle \"/>\n    <p>Their affection for Afghanistan was demonstrated by their decision to remain in Bamiyan province after the authoritarian regime seized control in August 2021, while many other Westerners left.</p>\n    <p>The couple's release follows months of public lobbying by their family, who have described the harrowing conditions of their detention.</p>\n    <p>Jonathan said in July that his father had been suffering serious convulsions and his mother was \"numb\" from anaemia and malnutrition.</p>\n    <p>A Qatari official told the BBC the couple were moved from Kabul's central prison to a larger facility with better conditions during the final stage of negotiations over their release.</p>\n    <p>Taliban officials maintained they received adequate medical care during their detention and that their human rights were respected.</p>\n    <p>The couple were receiving medical checks in the Qatari capital, Doha, before leaving for London. They will arrive on a commercial flight on Saturday morning, AFP reports.</p>\n    <p>The UK does not recognise the Taliban government and closed its embassy in Kabul when the group returned to power.</p>\n    <p>The Foreign Office says support for British nationals in Afghanistan is therefore \"severely limited\" and advises against all travel to the country.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cly6ve2dg66o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "ed-davey-loves-clowning-around-but-is-it-time-the-lib-dems-got-serious",
    "title": "Ed Davey loves clowning around, but is it time the Lib Dems got serious?",
    "category": "News",
    "subcategory": "News3",
    "category_slug": "news/news3",
    "date": "2025-09-20",
    "excerpt": "Being ignored is a nightmare for any politician.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/8259/live/a7babcc0-952f-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/c3e7ny8n44jo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<p>Being ignored is a nightmare for any politician.</p>\n<p>You don't win votes if no-one knows who you are. You don't get a tick in the box if the name on the ballot paper means nothing to the voter clutching their stubby pencil in the voting booth.</p>\n<p>In the last couple of years the Liberal Democrat leader, Sir Ed Davey, has <a href=\"https://www.bbc.co.uk/news/videos/c4ngpj07rpjo\">bungee-jumped</a>, <a href=\"https://www.bbc.co.uk/news/videos/czrmg1vr3pno\">jet-skied</a>, and even ridden a hobby horse into the public's imagination in a way that helped his party to success in the general election, surpassing their own hopes.</p>\n<p>He proved there is wisdom in playing the clown in politics - if it gets you attention. But too much clowning around might not look so smart.</p>\n<p>And while the government is unpopular, and the Conservatives seem miles from any kind of recovery, the Lib Dems have not been the main beneficiaries from their mutual misery.</p>\n<p>As the Lib Dems gather in Bournemouth this weekend for their annual get together, there will be a certain amount of understandable jollity.</p>\n<p>That's not just because of the Lib Dems' traditional glee club, or the fact that political activists enjoy their conferences the way that many of us might enjoy a minibreak with mates. It's a different kind, with warm, not cold, wine, and earnest discussions in stifling rooms, rather than a walk on the beach or a lie-in, although the budget hotels and deep fear of rail replacement services to get there are the same.</p>\n<p>But the Lib Dems are broadly in a good place after the general election, and they had more <a href=\"https://www.bbc.co.uk/news/articles/creqr4x18leo\">gains in council elections in May</a>. They have dozens of new MPs, and a rebooted team on their front bench.</p>\n<p>The question hanging over their conference in Bournemouth this weekend is expressed by one of their MPs: \"Where do we go now, to make sure it's not a false start?\"</p>\n<p>In other words – what next, where, and how? No doubt, there is opportunity for the Lib Dems.</p>\n<p>In the words of one party insider: \"What are a lot of Labour people talking about? Plotting against the leader. What are a lot of Tory people talking about? Plotting against the leader.\"</p>\n<p>The two big parties are both partly distracted by their own woes, which could provide the Lib Dems plenty of political space.</p>\n<p>Look at the numbers and the map. In the general election the Lib Dems swept up 60 seats from the Conservatives – nearly all in the South.</p>\n<p>The party relentlessly focused on places where they had a decent shot at winning, rather than run vigorous campaigns in every corner of the country. They were, as a result, only in second place in 27 seats.</p>\n<p>They were also predominantly in the south of England, and 20 were won by the Conservatives.</p>\n<p>So if you follow the logic, the obvious next tranche of seats and voters for the Lib Dems to target are Tory-held parts of the country, and Tory-leaning voters.</p>\n<p>\"Look at what's happening on the right, there's a ferocious split, and the Tories are crumbling,\" says one party figure excitedly.</p>\n<p>Another says: \"There is a continuing opportunity to drive down those centrist remainer Conservatives who are still left in that camp – where we were in second place, that is a serious opportunity.\"</p>\n<p>But the party is already looking at other seats where they were in third place last time round.</p>\n<p>One MP tells me: ''The conventional wisdom would be where we were second to the Tories, the natural ambition would be to take on all of those seats.</p>\n<p>\"But the interesting things come about in other parts of the country, we might be in third or fourth place but an insurgent Reform UK could completely change the race – the numbers and where we might have ambition might be very different.\"</p>\n<p>But how do you make the most of that chance?</p>\n<p>Polling by research group More in Common suggests the party should perhaps lay off the stunts.</p>\n<p>Data shared with me suggests most voters, even those who back the party, have had enough of <a href=\"https://www.bbc.co.uk/news/articles/cdjeepdl4l1o\">the water slides and wet suits</a>.</p>\n<p>Fresh polling, being published this weekend suggests three in five Britons (61%), think Sir Ed's campaign antics make the party look less serious, compared to 21% who believe they are a good way to grab attention.</p>\n<p>Even nearly half of Lib Dem backers, 47%, reckon the stunts aren't appropriate and make the party look less serious.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c3e7ny8n44jo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "more-than-1-000-people-cross-english-channel-in-one-day",
    "title": "More than 1,000 people cross English Channel in one day",
    "category": "News",
    "subcategory": "News3",
    "category_slug": "news/news3",
    "date": "2025-09-20",
    "excerpt": "More than 1,000 people crossed the English Channel in small boats on Friday, as the government confirmed two more migrants had been returned to France.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/ca81/live/9c928810-960f-11f0-9cf6-cbf3e73ce2b9.png",
    "source": "https://www.bbc.com/news/articles/cdx20xenzgqo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>More than 1,000 people cross Channel in one day</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ca81/live/9c928810-960f-11f0-9cf6-cbf3e73ce2b9.png.webp\" alt=\"Getty A group of migrants pictured in a dinghy crossing the English channel. A few individuals are stood up in the water.\"/>\n    <p>More than 1,000 people crossed the English Channel in small boats on Friday, as the government confirmed two more migrants had been returned to France.</p>\n    <p>According to the Home Office 1,072 people in 13 boats made the journey to Dover.</p>\n    <p>It takes the number of people who have made the crossing so far in 2025 to 32,103, a record for this point in a year.</p>\n    <p>A total of three men have now been sent back to France under a pilot \"one in, one out\" deal with the UK, intended to deter small boat crossings.</p>\n    <p>An Eritrean man and an Iranian man were deported on Friday after the first migrant, an Indian man, was removed from the UK on Thursday.</p>\n    <p>The government won a <a href=\"https://www.bbc.co.uk/news/articles/cx273vnkjpmo\">legal challenge</a> to sanction the return of the Eritrean national.</p>\n    <p>Next week, the first asylum seekers are expected to arrive in the UK from France under the reciprocal aspect of the deal.</p>\n    <p>Ministers have praised the returns, with deputy prime minister David Lammy saying they provided an \"immediate deterrent\" to people seeking to cross the Channel.</p>\n    <p>Shadow home secretary Chris Philp disputed this, claiming the deal offered \"no deterrent effect whatsoever\".</p>\n    <p>The numbers returned were \"pathetic\", he added.</p>\n    <p>The government said it intends to increase the number of people being sent back under the pilot deal over the coming months.</p>\n    <p>\n      <i>Follow BBC Kent on </i>\n      <i>Facebook</i>\n      <i>, on </i>\n      <i>X</i>\n      <i>, and on </i>\n      <i>Instagram</i>\n      <i>. Send your story ideas to </i>\n      <i>southeasttoday@bbc.co.uk</i>\n      <i> or WhatsApp us on 08081 002250.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cdx20xenzgqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "estonia-seeks-nato-consultation-after-russian-jets-violate-airspace",
    "title": "Estonia seeks Nato consultation after Russian jets violate airspace",
    "category": "News",
    "subcategory": "News3",
    "category_slug": "news/news3",
    "date": "2025-09-20",
    "excerpt": "Estonia has requested a consultation with other Nato members after Russian warplanes violated its airspace on Friday morning.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/c13f/live/c28ed850-95c6-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/czrp6p5mj3zo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<p>Estonia has requested a consultation with other Nato members after Russian warplanes violated its airspace on Friday morning.</p>\n<p>Three Russian MiG-31 fighter jets entered the Estonian skies \"without permission and remained there for a total of 12 minutes\" over the Gulf of Finland, the government said.</p>\n<p>Italy, Finland and Sweden scrambled jets under Nato's mission to bolster its eastern flank. A Nato spokesperson said it was \"yet another example of reckless Russian behaviour and Nato's ability to respond\".</p>\n<p>Russia denied violating Estonian airspace. But tensions have been escalating recently, after Poland and Romania - both Nato members - said Russian drones breached their airspace.</p>\n<p>Article 4 of the Nato treaty formally starts urgent consultations within the 32-member alliance, which ties the US and many European nations together on collective defence.</p>\n<p>It is the second time this month that a Nato member has requested Article 4 consultations. Poland did so on 10 September after Russian drones entered its airspace.</p>\n<p>Estonian Prime Minister Kristen Michal said \"Nato's response to any provocation must be united and strong\".</p>\n<p>\"We consider it essential to consult with our allies to ensure shared situational awareness and to agree on our next joint steps,\" Michal said.</p>\n<p>US President Donald Trump said on Friday: \"I don't love it. I don't like when that happens. Could be big trouble.\"</p>\n<p>Estonia, which shares a border with Russia to the east, says this was the fifth Russian violation of its airspace this year.</p>\n<p>Officials said the Russian aircraft entered its airspace from the north-east and were intercepted by Finnish jets over the Gulf of Finland. Once inside Estonian airspace, Italian F-35 jets, based in Estonia, were deployed under Nato's Baltic Air Policing mission to escort the aircraft out.</p>\n<p>The government said the Russian jets had no flight plans, had their transponders turned off and also did not have two-way radio communication with Estonian air traffic control.</p>\n<p>Russia's defence ministry said the jets were on a \"scheduled flight... in strict compliance with international airspace regulations and did not violate the borders of other states, as confirmed by objective monitoring\".</p>\n<p>It said they flew over neutral Baltic waters, more than 3km (two miles) from Vaindloo Island, which belongs to Estonia.</p>\n<p>Russia launched a full-scale invasion of Ukraine in February 2022.</p>\n<p>President Trump has been leading efforts to end the conflict - most recently by inviting his Russian counterpart Vladimir Putin to Alaska for a summit.</p>\n<p>But Putin's forces have repeatedly rejected calls for a ceasefire. They have intensified air attacks, and have been making slow progress on the ground - despite very high combat casualties reported.</p>\n<p>Michal said the Russian incursion showed its war of aggression in Ukraine was not proceeding as the Kremlin had planned.</p>\n<p>\"The aim is to draw attention and assistance away from Ukraine by forcing Nato countries to focus more on the defence of their own territories,\" he added.</p>\n<p>Friday's incursion was not an isolated incident, even if it was considered the most serious violation of Estonian airspace so far.</p>\n<p>Speaking to the BBC on Saturday morning, Estonian Foreign Minister Margus Tsahkna said it was part of a pattern of Russian behaviour.</p>\n<p>He used the analogy of the boiling frog to explain Russia's strategy. The suggestion is that by very gradually ramping up provocations, none of which on their own would necessitate a military response, Russia is able to test and ultimately undermine Nato's defences.</p>\n<p>That is why there are calls, including from former UK Defence Secretary Sir Ben Wallace, for the alliance to take a much tougher line with the Kremlin.</p>\n<p>He argued Russia needed to be presented with a \"strategic dilemma\" - a response that would demonstrate its provocations came with a cost.</p>\n<p>The question is, what would that be? In 2015, a much briefer violation of airspace over Turkey - another Nato member - ended with the shooting down of a Russian jet and the eventual death of the pilot.</p>\n<p>That resulted in diplomatic and economic consequences, but not all-out war. And no similar incursion has been reported since.</p>\n<p>Would the same be true if the MiGs had been shot down this time? It's impossible to say with any certainty.</p>\n<p>One vital added complication would be the response of Donald Trump.</p>\n<p>As ever with this president, it is a fool's game to make firm predictions - but it is very possible he would view the shooting down of Russian planes, even in Nato airspace, as a significant and unnecessary escalation - and one he would oppose.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/czrp6p5mj3zo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "hamas-posts-farewell-picture-of-48-captives-as-israel-destroys-gaza-ci",
    "title": "Hamas posts ‘farewell picture’ of 48 captives as Israel destroys Gaza City",
    "category": "News",
    "subcategory": "News5",
    "category_slug": "news/news5",
    "date": "2025-09-20",
    "excerpt": "The Palestinian group says an expanded Israeli ground invasion and air raids threaten the safety of the captives held in Gaza.",
    "cover": "https://www.aljazeera.com/wp-content/uploads/2025/1600/photo_2025-09-20_10-50-02-1758371856.jpg?resize=1200%2C630",
    "source": "https://www.aljazeera.com/news/2025/9/20/hamas-posts-farewell-picture-of-48-captives-as-israel-destroys-gaza-city?traffic_source=rss",
    "source_domain": "aljazeera.com",
    "source_name": "Aljazeera",
    "author": "Aljazeera",
    "rights": "Unknown",
    "body": "<html>\n  <body><h1>Hamas posts ‘farewell picture’ of 48 captives as Israel destroys Gaza City</h1><p><i>The Palestinian group says an expanded Israeli ground invasion and air raids threaten the safety of the captives held in Gaza.</i></p><graphic src=\"https://www.aljazeera.com/wp-content/uploads/2025/09/photo_2025-09-20_10-50-02-1758371856.jpg?resize=770%2C513&amp;quality=80\" alt=\"Hamas captives Gaza\"/><p>The armed wing of Hamas has released what it calls a “farewell picture” of 48 Israeli captives held in Gaza as the Israeli army continues to <a href=\"https://www.aljazeera.com/news/2025/9/19/palestinians-flee-as-israel-strikes-with-unprecedented-force-in-gaza-city\">destroy and seize</a> the besieged enclave’s largest urban centre.</p><p>Qassam Brigades posted a compilation photo online on Saturday, showing the faces of all living and deceased captives, with each of them captioned “Ron Arad” in reference to the Israeli air force captain who went missing in Lebanon in 1986.</p><h2>Recommended Stories</h2>list of 4 items<ul><li>list 1 of 4<a href=\"https://www.aljazeera.com/features/2025/9/20/mother-waits-for-her-sons-body-taken-by-israe-so-she-can-bury-him\">Israel shot her son and took his body. She can’t bury him or mourn</a></li><li>list 2 of 4<a href=\"https://www.aljazeera.com/news/2025/9/20/portugal-to-recognise-a-palestinian-state\">Portugal to recognise a Palestinian state</a></li><li>list 3 of 4<a href=\"https://www.aljazeera.com/news/2025/9/18/who-warns-hospitals-on-the-brink-as-israel-pushes-gaza-city-assault\">WHO warns hospitals ‘on the brink’ as Israel pushes Gaza City assault</a></li><li>list 4 of 4<a href=\"https://www.aljazeera.com/opinions/2025/9/18/western-bids-to-recognise-a-palestinian-state-put-israel-first\">Western bids to recognise a Palestinian state put Israel first</a></li></ul><p>Arad’s F-4 Phantom suffered a premature bomb detonation during an attack on southern Lebanon. He was captured by the Amal Movement and later handed over to Hezbollah. Arad is believed to have died, but conclusive proof is not available about his fate.</p><p>The image released by Hamas was accompanied by a text, stating: “Because of Netanyahu’s refusal, and Zamir’s capitulation, a farewell picture as the military operation in Gaza City begins.”</p><p>That was a reference to Israeli Prime Minister Benjamin Netanyahu’s repeated rejection of any agreement with Hamas to put an end to the genocidal war in Gaza, and the expanding ground and air attacks led by Israeli army chief Eyal Zamir, despite <a href=\"https://www.aljazeera.com/news/2025/8/25/israel-army-chief-says-captive-deal-on-table-israel-must-take-it-report\">his public objections</a> to the government’s “conquest” plans for Gaza City.</p><graphic src=\"https://www.aljazeera.com/wp-content/uploads/2025/08/1404-05-10-20.52.23-1754068956.jpg?w=770&amp;resize=770%2C512&amp;quality=80\" alt=\"Gaza\"/><p>Israeli authorities have said they believe about 20 captives are still being held alive in Gaza, whereas United States President Donald Trump has suggested fewer than 20 could be alive. Trump and Netanyahu have repeatedly said they will bring back all living and dead captives and “destroy” Hamas.</p><p>Hamas has persistently warned that intensifying Israeli attacks and a ground invasion would endanger the lives of the captives, with some already <a href=\"https://www.aljazeera.com/news/2024/9/15/israeli-army-says-high-probability-its-strike-killed-three-gaza-captives\">being killed by Israeli bombs</a>. The armed Palestinian group also claims that captives are “scattered throughout the neighbourhoods” of Gaza City.</p><p>The threat by Hamas on Saturday came hours before hundreds of thousands of Israelis were once again expected to pour into the streets of Tel Aviv and other cities to denounce the government and demand an immediate and comprehensive deal to end the war and bring back all captives.</p><p>Earlier this month, Hamas released a video of two Israeli captives, a move that came roughly a month after it <a href=\"https://www.aljazeera.com/video/newsfeed/2025/8/3/hamas-video-of-emaciated-captive-sparks-outrage-amid-witkoffs-israel-visit?utm_source=chatgpt.com\">broadcast footage</a> of two more emaciated Israeli captives, one of whom it said was seen digging his own grave.</p><p>The images prompted outrage among the families of the captives, as well as Israeli government officials and authorities in the US and other Israeli allies.</p><p/><p/><p>According to the Palestinian Health Ministry in Gaza, at least 65,208 Palestinians have been killed and 166,271 wounded by Israel since the start of the war in October 2023. Since March 18, when Israel broke a ceasefire with Hamas, 12,653 people have been killed and 54,230 wounded.</p><p>As Israel continues to starve the enclave, at least four aid seekers have been killed and 18 wounded over the past day, bringing the total number of Palestinian aid seekers killed to 2,518 people.</p><p>Dozens more people have been killed in Gaza City over the past day, with homes attacked and destroyed and thousands forced to flee as the entire area is designated a combat zone by Israel.</p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.aljazeera.com/news/2025/9/20/hamas-posts-farewell-picture-of-48-captives-as-israel-destroys-gaza-city?traffic_source=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "around-the-world-in-a-free-palestine-hoodie",
    "title": "Around the world in a Free Palestine hoodie",
    "category": "News",
    "subcategory": "News5",
    "category_slug": "news/news5",
    "date": "2025-09-20",
    "excerpt": "From Uzbekistan’s steppe to the jungle of Colombia, my sweatshirt has evoked Palestinian solidarity all over.",
    "cover": "https://www.aljazeera.com/wp-content/uploads/2025/1600/7a26a40f-0eb2-41b6-8df8-8b78bcefba36-1758370394.jpg?resize=1920%2C1440",
    "source": "https://www.aljazeera.com/opinions/2025/9/20/around-the-world-in-a-free-palestine-hoodie?traffic_source=rss",
    "source_domain": "aljazeera.com",
    "source_name": "Aljazeera",
    "author": "Aljazeera",
    "rights": "Unknown",
    "body": "<p>\n      <i>From Uzbekistan’s steppe to the jungle of Colombia, my sweatshirt has evoked Palestinian solidarity all over.</i>\n    </p>\n<p>Earlier this month, my mother and I took the train from Samarkand, Uzbekistan, to the city of Bukhara, two and a half hours away. While I was waiting in line for the toilet, an Uzbek train attendant approached to express his delight at the hoodie I was wearing, which is black with a Palestinian flag and the words “Free Palestine” in both English and Arabic.</p>\n<p>During our ensuing conversation in modified English, the young man advised me to steer clear of Wagon Seven of the train, as it was full of Israeli tourists. He himself had requested to be reassigned from said wagon, he told me, so as to avoid having to deal with them. He proceeded to wonder how people could live with themselves while their government was slaughtering children en masse.</p>\n<p>Indeed, of the more than 65,000 Palestinians Israel has officially killed in less than two years in the Gaza Strip – likely a <a href=\"https://www.aljazeera.com/news/2024/7/8/gaza-toll-could-exceed-186000-lancet-study-says\">severe underestimate</a> – nearly 20,000 have been children. This is to say nothing of the countless kids who have been permanently <a href=\"https://www.aljazeera.com/opinions/2025/7/21/in-gaza-death-seems-easier-than-amputation\">maimed</a>, mutilated and <a href=\"https://www.aljazeera.com/video/quotable/2025/4/15/psychological-trauma-to-haunt-palestinians-for-life\">traumatised</a>.</p>\n<p>Before arriving in Bukhara, the train attendant suggested we document our sweatshirt-based encounter with a selfie. In the photo, he gave the thumbs up for Palestine, and then my mother and I were on our way.</p>\n<p>This was not the first time that this particular hoodie had attracted attention. The previous week in the security line at the airport in Istanbul, an Arab woman travelling with her family asked to photograph the shirt. Then the female security guard who patted me down informed me, in Turkish, that I was a “good person”.</p>\n<p>Generally having a rather different opinion of myself, I inquired as to how she had possibly come to this conclusion, and was told that any American citizen who supported Palestine was automatically a good person.</p>\n<p>To be sure, the United States has not done much for its international reputation by <a href=\"https://www.aljazeera.com/opinions/2024/5/9/give-or-take-a-few-bombs-us-complicity-in-genocide-remains-ironclad\">avidly backing</a> Israel’s genocide from the get-go, first under former President Joe Biden and now under Donald Trump. In addition to providing billions upon billions of dollars to the Israeli killing machine, the US has also provided it with far-reaching diplomatic cover, including by <a href=\"https://www.aljazeera.com/news/2025/9/18/us-vetoes-un-security-council-demand-for-gaza-ceasefire-for-sixth-time\">vetoing</a> six United Nations Security Council resolutions demanding a ceasefire in Gaza.</p>\n<p>Hands down, the most unexpected compliment I have thus far received on the Free Palestine hoodie came from an agent with the US Transportation Security Administration (TSA) – which doesn’t exactly have the greatest reputation either – at none other than Dulles International Airport outside the nation’s capital of Washington, DC.</p>\n<p>It was last October, one year into the genocidal spectacle, and I was flying to Mexico City. While scanning my passport, the agent, an older white man, said he liked my shirt and lamented the ongoing horror in Gaza. He went on to ask if I had read any books by Israeli anti-Zionist historian <a href=\"https://www.aljazeera.com/author/ilan_pappe_151019144945133\">Ilan Pappe</a>, author of The Ethnic Cleansing of Palestine and other titles, as I stared at him in shock.</p>\n<p>Granted, this was several months before Trump reassumed the presidency and went about effectively criminalising opposition to genocide by <a href=\"https://www.aljazeera.com/opinions/2025/4/9/the-us-is-in-all-out-kidnapping-mode-and-no-one-is-safe\">abducting and disappearing</a> students and scholars who had expressed support for Gaza.</p>\n<p>Free Palestine apparel has earned me plenty of other friends, too. There was the Sudanese human rights lawyer-turned-ride-share driver in Washington who <a href=\"https://www.aljazeera.com/opinions/2024/12/25/christmas-for-pessimists\">gave me a hug</a>, the woman in the Athens airport who commented “Long live Palestine”, and the United Airlines flight attendant who whispered to me almost conspiratorially that he approved of my outfit.</p>\n<p>It may appear that the garment’s popularity is restricted to the context of travel by plane, train, and so forth – an impression that has to do with various factors. The first is that I travel a lot, having suffered for most of my life from a <a href=\"https://www.aljazeera.com/opinions/2021/3/10/pandemic-reflections-on-a-year-of-being-still\">pathological inability to sit still</a>. The second is that I am always freezing in airports, which got me to thinking that if I must wear a sweater, it might as well be a Free Palestine one.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.aljazeera.com/opinions/2025/9/20/around-the-world-in-a-free-palestine-hoodie?traffic_source=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-complex-stories-after-charlie-kirk-s-killing",
    "title": "The complex stories after Charlie Kirk’s killing",
    "category": "News",
    "subcategory": "News5",
    "category_slug": "news/news5",
    "date": "2025-09-20",
    "excerpt": "The Listening Post",
    "cover": "https://www.aljazeera.com/wp-content/uploads/2025/1600/WEB-LPKG-THUMB-1758371642.jpg?resize=1920%2C1080&amp;quality=80",
    "source": "https://www.aljazeera.com/video/the-listening-post/2025/9/20/the-complex-stories-after-charlie-kirks-killing?traffic_source=rss",
    "source_domain": "aljazeera.com",
    "source_name": "Aljazeera",
    "author": "Aljazeera",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <graphic src=\"https://www.aljazeera.com/wp-content/uploads/2025/09/WEB-LPKG-THUMB-1758371642.jpg?resize=730%2C410&amp;quality=80\"/>\n    <p>\n      <a href=\"https://www.aljazeera.com/video/the-listening-post/\">The Listening Post</a>\n    </p>\n    <h1>The complex stories after Charlie Kirk’s killing</h1>\n    <p>It’s been just more than a week since the assassination of Charlie Kirk, and in death, as in life, the far-right podcaster is proving divisive. While his supporters mourn, many critics have seized the moment to call out his polarising legacy – a legacy now being weaponised by far-right leaders from DC to Tel Aviv.</p>\n    <p><strong>Contributors:\n</strong>Jeffrey Sharlet – Professor, Dartmouth College</p>\n    <p>Jude Russo – Managing editor, The American Conservative</p>\n    <p>Kyle Spencer – CEO, The Pro-Democracy Information Lab</p>\n    <p>Meredith Clark – UNC Hussman School of Journalism &amp; Media</p>\n    <h2>On our radar:</h2>\n    <p>This week, the UN formally declared what Palestinians have long been saying: That Israel is committing a genocide in Gaza. In English, Israeli officials are indignant at the charge. But in Hebrew, they continue to provide more evidence of their genocidal intent. Ryan Kohls reports.</p>\n    <h2>Russia, Ukraine and The Trump Effect</h2>\n    <p>Donald Trump’s second term has injected unpredictability into the Russia-Ukraine war: Unsettling Kyiv, emboldening Moscow and forcing media on both sides to recalibrate. <i>The Listening Post</i> hears from an exiled Russian journalist and a Ukrainian media scholar on how the conflict is being framed – and what both sides fear will come next.</p>\n    <p><strong>Featuring:\n</strong>Dariya Orlova – Associate professor, Mohyla School of Journalism</p>\n    <p>Mikhail Fishman – Journalist, TV Rain</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.aljazeera.com/video/the-listening-post/2025/9/20/the-complex-stories-after-charlie-kirks-killing?traffic_source=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "india-vs-pakistan-asia-cup-super-fours-match-time-tickets-teams",
    "title": "India vs Pakistan – Asia Cup Super Fours: Match time, tickets, teams",
    "category": "News",
    "subcategory": "News5",
    "category_slug": "news/news5",
    "date": "2025-09-20",
    "excerpt": "Will the teams make any changes? Who’s the favourite to win? Which players can make an impact? Al Jazeera explains.",
    "cover": "https://www.aljazeera.com/wp-content/uploads/2025/1600/AFP__20250914__74FP26W__v1__HighRes__CricketAsia2025T20IndPak-1757856820.jpg?resize=1920%2C1440",
    "source": "https://www.aljazeera.com/sports/2025/9/20/india-vs-pakistan-asia-cup-super-fours-match-time-tickets-teams?traffic_source=rss",
    "source_domain": "aljazeera.com",
    "source_name": "Aljazeera",
    "author": "Aljazeera",
    "rights": "Unknown",
    "body": "<p><i>Will the teams make any changes? Who’s the favourite to win? Which players can make an impact? Al Jazeera explains.</i></p>\n<p><strong>Who:</strong> India vs Pakistan<br/>\n<strong>What:</strong> T20 Asia Cup Super Fours<br/>\n<strong>When:</strong> Sunday, September 21 at 14:30 GMT<br/>\n<strong>Where:</strong> Dubai International Cricket Stadium, Dubai, UAE<br/>\n<strong>How to follow:</strong> We’ll have all the build-up on <a href=\"https://www.aljazeera.com/sports/\">Al Jazeera Sport</a> from 09:30 GMT in advance of our live text commentary stream.</p>\n<p>It will be a case of “here we go again” as bitter rivals India and Pakistan meet on the cricket field for the second time in eight days at the T20 Asia Cup 2025 in Dubai.</p>\n<h2>Recommended Stories</h2>\n<ul><li>list 1 of 4<a href=\"https://www.aljazeera.com/opinions/2025/9/15/indian-crickets-pakistan-problem-can-you-monetise-patriotism\">Indian cricket’s Pakistan problem: Can you monetise patriotism?</a></li><li>list 2 of 4<a href=\"https://www.aljazeera.com/sports/2025/9/11/best-india-vs-pakistan-matches-at-the-asia-cup-afridi-kohli-classics\">India vs Pakistan at Asia Cup: Three classics to relive before September 14</a></li><li>list 3 of 4<a href=\"https://www.aljazeera.com/sports/2025/9/12/asia-cup-post-conflict-india-vs-pakistan-cricket-match-divides-opinion\">Cricket after conflict: ‘Worst time for an India-Pakistan match’</a></li><li>list 4 of 4<a href=\"https://www.aljazeera.com/sports/2025/9/14/india-vs-pakistan-asia-cup-match-hit-by-no-handshake-controversy\">India, Pakistan embroiled in ‘no handshake’ drama after Asia Cup match</a></li></ul>\n<p>The stakes will be higher this time as their clash on Sunday takes place in the Super Fours stage, and the winning side will take one step closer to the final, while the losers will move further away from the tournament decider.</p>\n<p>India will start as favourites for multiple reasons, not least their <a href=\"https://www.aljazeera.com/sports/2025/9/14/india-beat-pakistan-by-seven-wickets-in-asia-cup-2025\">seven-wicket thrashing</a> of Pakistan in their Group A match on September 14.</p>\n<p>In addition to their status as the ICC’s top-ranked men’s T20 team, Suryakumar Yadav’s side are the tournament’s defending champions and the reigning T20 champions.</p>\n<p>For Pakistan, a lot more than two points will be on the line as they will look to put aside not only the embarrassing defeat but also events that transpired following their thumping loss, as India’s players walked off the field without partaking in the customary post-match <a href=\"https://www.aljazeera.com/sports/2025/9/14/india-vs-pakistan-asia-cup-match-hit-by-no-handshake-controversy\">handshake</a>.</p>\n<p>Here’s what you need to know about the match:</p>\n<h2>What happened in the last India vs Pakistan match?</h2>\n<p>India stamped their authority on the match with the first ball, as Pakistan’s opener Saim Ayub Ayub was caught out at point off Hardik Pandya’s bowling and wicketkeeper Mohammad Haris followed suit in the next over as India’s star bowler Jasprit Bumrah struck.</p>\n<p>It wasn’t until Shaheen Shah Afridi and leg-spin bowler Sufiyan Muqeem hit four fours and two sixes that Pakistan crossed the 100-run mark in their 19th over and finished at 128.</p>\n<p>The target was never going to be enough for a power-packed Indian batting lineup, and opener Abhishek Sharma took the match away from Pakistan with his belligerent innings of 31 runs off 13 balls.</p>\n<p>Yadav followed suit with 47 runs off 37 balls as India won their second match of the tournament.</p>\n<p>India walked away with two points and walked off without shaking hands with the Pakistan team, as is the norm after every cricket match.</p>\n<h2>What happened after the match?</h2>\n<p>Yadav walked off the field alongside his batting partner, Shivam Dube, without approaching the Pakistani captain and team for the traditional post-match handshakes.</p>\n<p>Pakistan’s players trudged off in a group and waited for the Indian squad and support staff to come out and shake hands, as is the norm at the end of cricket matches.</p>\n<p>However, the Indian contingent only shook hands with each other before walking into their dressing room and shutting the door as the waiting Pakistan players looked on.</p>\n<h2>Why did India’s players not shake hands with the Pakistani team?</h2>\n<p>“A few things in life are above sportsman’s spirit,” India’s captain Yadav said when asked to clarify his team’s actions.</p>\n<p>“We stand with all the victims of the Pahalgam terror attack and with their families, and dedicate this win to our brave armed forces who took part in Operation Sindoor.”</p>\n<p>Yadav was referring to the Indian armed forces’ multiple missile attacks on six locations inside Pakistan.</p>\n<h2>How did Pakistan respond?</h2>\n<p>Pakistan’s manager Naveed Akram Cheema lodged a protest against the Indian cricket team’s actions with Pycroft, who is an ICC accredited match referee.</p>\n<p>Additionally, Pakistan captain Agha did not speak at the post-match captain’s chat with the host broadcaster, in a mark of protest.</p>\n<p>Three days later, Pakistani officials deliberated pulling out of the tournament as a mark of protest, causing a <a href=\"https://www.aljazeera.com/sports/2025/9/17/pakistan-vs-uae-delayed-over-match-referees-role-in-india-handshake-row\">delayed</a> start to their match against the UAE.</p>\n<h2>Why is India ‘hosting’ the Asia Cup in the UAE?</h2>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.aljazeera.com/sports/2025/9/20/india-vs-pakistan-asia-cup-super-fours-match-time-tickets-teams?traffic_source=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "israel-shot-her-son-and-took-his-body-she-can-t-bury-him-or-mourn",
    "title": "Israel shot her son and took his body. She can’t bury him or mourn",
    "category": "News",
    "subcategory": "News5",
    "category_slug": "news/news5",
    "date": "2025-09-20",
    "excerpt": "Israeli soldiers took Mahmoud Sanaqra after they shot him in February. His mother is still waiting to get him back.",
    "cover": "https://www.aljazeera.com/wp-content/uploads/2025/1600/Jameela-with-the-empty-plot-waiting-for-Mahmoud-landscape-1758233376-e1758365737927.jpeg?resize=1200%2C675",
    "source": "https://www.aljazeera.com/features/2025/9/20/mother-waits-for-her-sons-body-taken-by-israe-so-she-can-bury-him?traffic_source=rss",
    "source_domain": "aljazeera.com",
    "source_name": "Aljazeera",
    "author": "Aljazeera",
    "rights": "Unknown",
    "body": "<p><i>Israeli soldiers took Mahmoud Sanaqra after they shot him in February. His mother is still waiting to get him back.</i></p>\n<p><strong>Balata refugee camp, occupied West Bank –</strong> Jameela Sanaqra’s three sons are gone. She knows for certain that Israel killed two of them.</p>\n<p>Her third son, her youngest, Mahmoud, was shot in his bedroom by Israeli commandos on February 27, a week before his 26th birthday.</p>\n<h2>Recommended Stories</h2>\n<ul><li>list 1 of 3<a href=\"https://www.aljazeera.com/video/inside-story/2025/9/18/can-eu-sanctions-force-israel-to-stop-its-genocide-in-gaza\">Can EU sanctions force Israel to stop its genocide in Gaza?</a></li><li>list 2 of 3<a href=\"https://www.aljazeera.com/news/2025/9/18/attack-at-jordan-west-bank-crossing-kills-two\">Attack at Jordan-West Bank crossing kills two Israeli soldiers</a></li><li>list 3 of 3<a href=\"https://www.aljazeera.com/opinions/2025/9/18/western-bids-to-recognise-a-palestinian-state-put-israel-first\">Western bids to recognise a Palestinian state put Israel first</a></li></ul>\n<p>He was taken by the soldiers and has not been returned to his family.</p>\n<p>She does not know if he is dead or alive, adding to her grief and mental torment.</p>\n<p>“Palestinian mothers carry their sons twice; once in the womb, and then on the day of their burial procession,” 67-year-old Jameela told Al Jazeera in her home in the <a href=\"https://www.aljazeera.com/features/2014/1/22/balata-a-camp-of-transitory-permanance\">Balata refugee camp</a>.</p>\n<p>Mahmoud is likely one of the more than 2,220 Palestinians killed in the occupied West Bank and Gaza whose <a href=\"https://www.aljazeera.com/news/2024/8/5/israel-returns-decomposed-bodies-of-89-palestinians-to-gaza\">bodies are held by Israel</a>, often in refrigerators or buried in numbered cemeteries, according to the Palestinian National Campaign for the Recovery of Martyrs’ Bodies.</p>\n<p>The Jerusalem Legal Aid and Human Rights Center (JLAC) says Israel uses the practice as a weapon of war and as a means to deny Palestinians the chance to mourn lost loved ones.</p>\n<p>Like so many other Palestinian mothers, Jameela has been deprived of the opportunity to carry the last of her sons to his final resting place.</p>\n<p/><p/><h2>Refugee camp under attack</h2><p>Balata, east of <a href=\"https://www.aljazeera.com/news/2025/8/27/child-arrested-at-least-80-injured-during-israeli-raid-on-nablus\">Nablus</a>, is the most populated refugee camp in the occupied West Bank, established in 1950.</p>\n<p>It is less than a quarter of a square kilometre, about the size of 35 football fields, with at least 33,000 people crammed into its narrow streets.</p>\n<p>Walls and windows are emblazoned, like shrines, with the faces of more than 45 Palestinians locals say Israel has killed since October 7.</p>\n<p>Palestinian resistance groups operating under the cover of the camp’s labyrinthine network of alleyways and favela-like dwellings have long been a thorn in the side of the Israeli military.</p>\n<p>Towering over the camp is a Byzantine-era Greek Orthodox Church known as Jacob’s Well. Further up the road is a funerary monument known as Joseph’s Tomb in Judaism, believed to be the resting place of the biblical patriarch.</p>\n<p>The site is significant to Palestinians because it is believed to be the resting place of Sheikh Yousef Dweikat, a renowned religious scholar, who was buried in the 18th century.</p>\n<p>Joseph Tomb’s significance to Judaism and relevance to the Zionist tradition have made it a target for the ultranationalist elements of Netanyahu’s coalition, who want it under Israeli control.</p>\n<p>Busloads of armed settlers – escorted by soldiers – storm the site to intimidate, chant and perform religious rituals on the doorsteps of its Palestinian neighbours, inciting violence and clashes.</p>\n<p>Balata has been under siege since Israel stepped up its onslaught on the West Bank following Hamas’s October 7, 2023, attacks.</p>\n<p>When it raids the camp, the Israeli army destroys the roads and dozens of buildings at a time.</p>\n<p>The United Nations Relief and Works Agency (UNRWA) says the camp, akin to a ghetto, has one of the highest rates of unemployment, poverty and food insecurity anywhere in the West Bank. More than 60 per cent of the camp’s population is under the age of 18.</p>\n<h2>Kidnapping dead bodies</h2>\n<p>The Sanaqra family has prepared an empty plot in Balata’s cemetery for Mahmoud, next to the bodies of his older brothers, Ahmad and Ibrahim.</p>\n<p>The family is waiting for Mahmoud’s body or confirmation of his death. But they know they are unlikely to get either.</p>\n<p/><p/><p>The JLAC says Israel still holds bodies from as far back as the 1967 War.</p>\n<p>“The occupation authorities impose their control over the deepest feelings of loss, often forcing families to wait endlessly to retrieve the bodies of their children,” a report for the JLAC’s National Campaign to Retrieve War Victims states.</p>\n<p>Jameela sat in her living room with two of her four daughters, Bara’a and Amira, and two of her seven grandchildren, Amira’s daughters. Her husband, mournful and solemn, sat quietly by the door.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.aljazeera.com/features/2025/9/20/mother-waits-for-her-sons-body-taken-by-israe-so-she-can-bury-him?traffic_source=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]