[
  {
    "slug": "what-it-s-like-to-get-really-really-high",
    "title": "What It’s Like to Get Really, Really High",
    "category": "Culture & Arts",
    "subcategory": "3General",
    "category_slug": "culture-arts/3general",
    "date": "2025-09-20",
    "excerpt": "Ojos del Salado rises more than twenty-two thousand feet above sea level, on Chile’s northeastern border. It is the world’s tallest volcano, towering over the world’s highest desert: an ash-and-scree-covered behemoth that exceeds Elbrus, Kilimanjaro, and Denali in size, if not…",
    "cover": "https://media.newyorker.com/photos/68b9a701b6cbfb7427f911f9/master/pass/Bethea_Weekend_Essay_Climbing.gif",
    "source": "https://www.newyorker.com/culture/the-weekend-essay/what-its-like-to-get-really-really-high",
    "source_domain": "newyorker.com",
    "source_name": "Newyorker",
    "author": "Charles Bethea",
    "rights": "Unknown",
    "body": "<p>Ojos del Salado rises more than twenty-two thousand feet above sea level, on Chile’s northeastern border. It is the world’s tallest volcano, towering over the world’s highest desert: an ash-and-scree-covered behemoth that exceeds Elbrus, Kilimanjaro, and Denali in size, if not renown. Its name means “sources of the salty river,” or, possibly, “eyes of salt,” which is what the brackish lagoons on its lower reaches resemble when your brain is starved of oxygen. The wind and cold are trouble, too. Hypothermia and high-altitude pulmonary edema invisibly patrol the peak, which a pair of Poles were the first to reach, in 1937. Nonetheless, Ojos is what mountaineers call a “walk-up.” There are no crevasses or technical features on its standard route, just a relatively simple rock scramble beneath the summit block.</p>\n<p>I gathered this much from reading trip reports, back in 2016, while planning an Ojos expedition of my own. One particularly memorable <a href=\"https://publications.americanalpineclub.org/articles/12195707400/Ojos-del-Salado\"> account</a> of failure there described temperatures of twenty degrees below zero and winds that drove “head-high icy particles which cut our faces like sandpaper.” At the time I encountered that chilling sentence, I was a thirty-five-year-old freelance writer living in Atlanta. When asked why I wanted to climb this volcano—rather than a slighter one, or maybe a ski hill—I sometimes lazily cited George Mallory. “Because it’s there,” the English mountaineering legend said, before one of his pioneering attempts at Mt. Everest, where he would die in 1924.</p>\n<p>I did not want to die. I just wanted to kick my tires a bit, to let nature throttle me again. When I was twenty-one and meandering through college, I completed a two-thousand-mile hike of the Appalachian Trail from Georgia to Maine. After four and a half months, I emerged emaciated, emboldened, and in need of a root canal from my daily Snickers dipped in Nutella. A few years later, I traced a two-hundred-mile loop through the mountains encircling <a href=\"https://www.backpacker.com/stories/tahoe-rim-trail-above-it-all/\"> Lake Tahoe</a>, wearing a silver Speedo urged upon me by my younger brother, Rob, who donned a floral number. I bagged a bunch of fourteen-thousand-foot peaks out West, while working for </p>\n<p><i>Outside</i>magazine, and I even topped an eighteener, the Pico de Orizaba volcano, in Mexico, on a newspaper</p>\n<p>\n      <a href=\"https://www.wsj.com/articles/SB10001424127887324503204578318550468753438\">. Climbing that one with Rob had entailed just a few days of discomfort, though. A properly acclimatized expedition up Ojos would require living above fourteen thousand feet for a week, including at least one night past nineteen thousand—two-thirds the cruising altitude of a commercial airplane—where there is approximately half as much oxygen as you enjoy at sea level.</a>\n    </p>\n<p>Three friends and my brother agreed that Ojos offered a “Type 2 Adventure.” That is, a perversely painful undertaking that we would fondly remember forever. Hundreds of planning e-mails followed. It wasn’t enough to merely climb the volcano: we had decided to bring along mountain bikes. Only <i>a few</i><a href=\"https://vimeo.com/115747377\"> other</a> humans had apparently done so. Why not “catch a small plane into the mountain region, unload our equipment, ride into the mountain, summit that beast, ride down and out. . . . Would be so sick!” Chris, a lawyer at the time, who became our fantasist-in-chief, wrote. Justin, a commercial photographer, had never been much higher than fourteen thousand feet, but he was a strong and dependable cyclist. Doug, a fastidious videographer, who planned to bring along his drone, was also inexperienced at elevation; to train for the trip, he slept, often joined by his wife, inside an altitude-simulation tent for two weeks. “She’s cranky this morning and not happy after our first full night at 10,000,” he told us at one point.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.newyorker.com/culture/the-weekend-essay/what-its-like-to-get-really-really-high\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-strange-cinematic-life-of-charlie-sheen",
    "title": "The Strange, Cinematic Life of Charlie Sheen",
    "category": "Culture & Arts",
    "subcategory": "3General",
    "category_slug": "culture-arts/3general",
    "date": "2025-09-20",
    "excerpt": "“I think there’s so many stories and images ingrained in people’s minds about the concept of me,” the actor Charlie Sheen tells the camera in the new two-part Netflix documentary about his life, “aka Charlie Sheen.” “It’s not even like they think of me as a person. They think …",
    "cover": "https://media.newyorker.com/photos/68cc71baad104aae827e2d2f/master/pass/Fry-Charlie-Sheen-GettyImages-2189403361.jpg",
    "source": "https://www.newyorker.com/culture/critics-notebook/the-strange-cinematic-life-of-charlie-sheen",
    "source_domain": "newyorker.com",
    "source_name": "Newyorker",
    "author": "Naomi Fry",
    "rights": "Unknown",
    "body": "<p>“I think there’s so many stories and images ingrained in people’s minds about the concept of me,” the actor Charlie Sheen tells the camera in the new two-part Netflix documentary about his life, “aka Charlie Sheen.” “It’s not even like they think of me as a person. They think of me as a concept, or a specific moment in time.” This assessment, though probably true of celebrity figures in general, strikes me as especially apt in Sheen’s case, if only thanks to his constancy in our media landscape over the past four decades. Especially to a viewer in her late forties, such as myself, it seems that Sheen has always been around: a show-business soldier never far from the reach of a camera, ready to embody a mood or an era.</p>\n<p>In the nineteen-eighties, when Sheen was in his early twenties, he followed his father, Martin Sheen, and his older brother Emilio Estevez into the family business, as the leading man in Oliver Stone’s “Platoon” and “Wall Street,” each role some version of a young, go-getting buck. In the aughts, he became Hollywood’s highest-paid male TV actor when he starred on the blockbuster sitcom “Two and a Half Men”—playing a bacchanalian bachelor suddenly saddled with fraternal and avuncular responsibilities—a cheering if somewhat bland mainstay of the George W. Bush years. And, in between these high-profile gigs, there always appeared to be some diverting, though often middling, Sheen fare to amuse audiences. (His IMDb page lists a staggering eighty-six acting credits, among them offerings like “Scary Movie 3” and “Major League II.”)</p>\n<p>Mostly, however, what grabbed the public’s attention over the decades were the scandals Sheen was involved in: the arrests for drugs and for assault; the rehab stays; the liaisons with porn stars and prostitutes; the quick marriages and the even quicker divorces; and, of course, in the early twenty-tens, the frenzied period in which, after being fired from “Two and a Half Men,” Sheen overtly embraced his role as a proudly drugs-and-sex-obsessed rebel with “tiger blood” pulsing through his veins, touring the country with a retinue of adult actresses to proclaim his rejection of polite society’s pieties, and braying the catchphrase “Winning!” at seemingly anyone and everyone he came across.</p>\n<p>The professed aim of “aka Charlie Sheen,” directed by Andrew Renzi, is to give viewers a peek at the person behind the persona. This coördinated push arrives accompanied by a memoir, “<a href=\"https://www.amazon.com/Book-Sheen-Memoir-Charlie/dp/1668075288\">The Book of Sheen</a>,” published a day before the documentary dropped. “The stuff that I plan on sharing, I made a sacred vow years ago to only reveal to a therapist,” the actor tells the camera. In other words, it’s revelation and introspection time for Sheen, who, at sixty, has now been sober for eight years. But, as I watched, I felt that though the series certainly delivered on its promise of revelation, there wasn’t nearly as much introspection, leaving the viewer with a sense not of a deeper understanding and connection but of glimpsing, from a distance, at a life made almost entirely of the “stories and images” that Sheen claims to want to get past.</p>\n<p>In a way, though, this is perfectly fitting. It shouldn’t be surprising that Sheen himself sees his life as a mediated one, considering the environment he grew up in. When he was eleven, he joined his father in the Philippines on the set of Francis Ford Coppola’s Vietnam War masterwork, “Apocalypse Now” (in which Martin Sheen played the beleaguered Captain Willard), and, influenced by the sights and sounds he experienced, became increasingly interested in making dramatic and violent Super 8 movies at his family’s Malibu home along with his siblings, as well as their friends from the neighborhood, like future actors Chris and Sean Penn. “We kind of grew accustomed to watching our father die on film,” he says. “We recognized early on that those kind of plotlines are compelling.” Another compelling plotline emerged for Sheen in the early eighties, when Estevez rose to fame as a member of the so-called Brat Pack. Dazzled by his older brother’s newfound status as a media sensation, Sheen decided to try acting, too, and was immediately enchanted by the cinematic qualities of being a celebrity. (In his memoir, he remembers going to see a packed screening of “Platoon” with a <i>Penthouse</i> Pet named Lisa: “Walking with her on my arm past the fired-up catcalling line that circled the block was like being in a movie on the way to the movie.”)</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.newyorker.com/culture/critics-notebook/the-strange-cinematic-life-of-charlie-sheen\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "charlie-kirk-and-tyler-robinson-came-from-the-same-warped-online-world",
    "title": "Charlie Kirk and Tyler Robinson Came from the Same Warped Online Worlds",
    "category": "Culture & Arts",
    "subcategory": "3General",
    "category_slug": "culture-arts/3general",
    "date": "2025-09-17",
    "excerpt": "Assassins and would-be assassins have become a sickeningly common feature of our polarized political landscape, and so have our rituals in the aftermath of the assailants’ heinous acts. First come the shock and the bipartisan expressions of regret. Then, almost as instantly, c…",
    "cover": "https://media.newyorker.com/photos/68c9bf302aff39c0e1750797/master/pass/Chayka_KirkShooter_AP25255239394653.jpg",
    "source": "https://www.newyorker.com/culture/infinite-scroll/charlie-kirk-and-tyler-robinson-came-from-the-same-warped-online-worlds",
    "source_domain": "newyorker.com",
    "source_name": "Newyorker",
    "author": "Kyle Chayka",
    "rights": "Unknown",
    "body": "<p>Assassins and would-be assassins have become a sickeningly common feature of our polarized political landscape, and so have our rituals in the aftermath of the assailants’ heinous acts. First come the shock and the bipartisan expressions of regret. Then, almost as instantly, come the debates: Whose side was he on? Just as often as not, the clues come from fragments of the shooter’s life on the internet. Deciphering social-media messages, private chat-room records, and Google-search histories, we hunt for ideological bread crumbs.</p>\n<p>Tyler Robinson, the alleged assassin of the right-wing activist and <i>MAGA</i> ally <a href=\"https://www.newyorker.com/magazine/2025/09/22/charlie-kirk-murder-and-the-crisis-of-political-violence\">Charlie Kirk</a>, used bullets that he had engraved with phrases that revealed less about his political affiliations than his fluency in deep internet culture. One bullet said “Hey fascist! Catch!,” then included a code for dropping a bomb in the video game Helldivers 2. Another said “If you Read / This, You Are / GAY / lmao,” and a third contained an emoticon-laced message drawn from furry subculture. (The symbol is not perverse because of its origins; it’s perverse because of how gleefully and literally it was weaponized, not unlike when Nikki Haley wrote “Finish them” on Israeli artillery destined for Gaza.) Spencer Cox, the Republican Governor of Utah, has said that Robinson subscribed to a “Leftist ideology.” According to court documents released on Tuesday, Robinson’s mother told investigators that he had moved to the left politically in the past year, becoming more “pro-gay and trans-rights oriented.” He had also begun to date his roommate, who, in his mother’s description, was male at birth and was transitioning. Text-message exchanges quoted in the documents show Robinson telling his roommate that he had killed Kirk because he’d “had enough of his hatred.” Still, it is unclear how Robinson made the leap from disliking Kirk’s views to deciding to murder him—he wrote, chillingly, that he’d been planning the shooting for only “a bit over a week”—and the messages that Robinson left behind remain a muddle. The phrase “Bella Ciao,” engraved on one bullet, is both the title of a famous antifascist anthem and a phrase that crops up in video games. Some have pointed out that the song also appeared on a Spotify playlist associated with Groypers, a group of far-right, white-nationalist, meme-steeped internet denizens led by <a href=\"https://www.newyorker.com/culture/cultural-comment/the-young-political-spaces-of-the-internet\">Nick Fuentes</a>, who frequently attacked Kirk for not being extreme enough. In isolation, the references are vague enough to be interpreted every which way.</p>\n<p>According to an interview that Robinson’s grandmother gave to the <i>Daily Mail</i>, he grew up in a conservative family that staunchly supported Trump. He attended just one semester of college before dropping out. He was registered to vote in Utah but was unaffiliated with a party and did not vote in the 2024 Presidential election. Instead, he seems to have spent time in the corners of the internet where young men can become radicalized toward violence. Like <a href=\"https://www.newyorker.com/culture/infinite-scroll/the-online-spaces-that-enable-mass-shooters\">Payton Gendron</a>, who committed a mass shooting at a Tops grocery store in Buffalo, New York, in 2022, Robinson left a trail of self-implicating messages on the chat-room app Discord. In one chat, he reportedly played dumb about Kirk’s murder, joking about how the suspect was his “doppelganger.” In another chat, though, he confessed to shooting Kirk, saying, “It was me,” just before going with his family to turn himself in to the police.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.newyorker.com/culture/infinite-scroll/charlie-kirk-and-tyler-robinson-came-from-the-same-warped-online-worlds\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "how-samin-nosrat-learned-to-love-the-recipe",
    "title": "How Samin Nosrat Learned to Love the Recipe",
    "category": "Culture & Arts",
    "subcategory": "3General",
    "category_slug": "culture-arts/3general",
    "date": "2025-09-17",
    "excerpt": "“I was losing my mind,” the chef and writer Samin Nosrat said. We were sitting in the living room of her small house in Oakland, and she was describing a period in her life, just after the arrival of COVID vaccines, when she was sunk in a depression and floundering in her atte…",
    "cover": "https://media.newyorker.com/photos/68c372d8c5f762f3456d1f89/master/pass/Kois_Nosrat_DSCF4238.jpg",
    "source": "https://www.newyorker.com/culture/persons-of-interest/how-samin-nosrat-learned-to-love-the-recipe",
    "source_domain": "newyorker.com",
    "source_name": "Newyorker",
    "author": "Dan Kois",
    "rights": "Unknown",
    "body": "<p>“I was losing my mind,” the chef and writer Samin Nosrat said. We were sitting in the living room of her small house in Oakland, and she was describing a period in her life, just after the arrival of <i>COVID</i> vaccines, when she was sunk in a depression and floundering in her attempts to write the follow-up to her 2017 cooking guide, “<a href=\"https://www.amazon.com/Salt-Fat-Acid-Heat-Mastering/dp/1476753830/\">Salt, Fat, Acid, Heat</a>.” That book was a phenomenon whose promise to teach readers the four “elements of good cooking”—thus liberating them from the tyranny of recipes—proved irresistible. It earned Nosrat a James Beard Award, spawned a <a href=\"https://www.newyorker.com/culture/recommends/watch/samin-nosrats-sensual-compassionate-food-travels-in-salt-fat-acid-heat\">Netflix series</a>, and sold 1.4 million copies. In 2019, Nosrat sold a proposal for an ambitious sequel called “What to Cook,” which would help readers decide on a dish based on four constraints: time, resources, preferences, and ingredients. But the concept refused to cohere. After two years, she said, “I was, like, ‘Take the money back.’ ”</p>\n<p>One of her agents suggested that she just write, you know, a cookbook, with recipes. At first, Nosrat resisted. Though “Salt, Fat, Acid, Heat” includes recipes, it also sniffs at them. For beginning cooks, Nosrat writes, “recipes can be necessary and comforting, like training wheels.” She stresses that their ultimate goal should be to remove those training wheels: to “improvise, and judge what good food looks like on your own terms.”</p>\n<p>Nosrat distrusts recipes, but she’s very good at devising them. She might be responsible for more canonical dishes than any other writer in the past decade. The list of her hits reads like the <i>Billboard</i> Top Ten: her buttermilk roast chicken, her garlicky green beans, her <i>tahdig</i>, her focaccia. Just the other day, a friend was trying to figure out how to cook some chicken thighs, and I advised her to try Nosrat’s conveyor-belt chicken. As has been the case every one of the dozens of times I’ve cooked it, it worked perfectly.</p>\n<p>Nosrat tried to follow her agent’s advice, but she felt like a fraud. “There was nothing that made me excited to cook,” she recalled. “I was just trying to figure out, like, <i>What is the point? Who cares</i>?”</p>\n<p>One morning, Nosrat was in the middle of a misbegotten experiment—attempting to prepare meat al pastor in her kitchen, inspired by a documentary about tacos—when a friend texted and asked if she and her kids could stop over. “Sure,” Nosrat told her. “I’m just over here ruining some pork.”</p>\n<p>At this time, Nosrat said, she was searching for a way to handle the fame that “Salt, Fat, Acid, Heat” had brought, and the concomitant feelings of guilt and self-doubt. Perhaps more important, she had tapered off the antidepressants she’d taken for years, in order to try psychedelic therapy—which didn’t work. The six pounds of pork she had ruined seemed like a synecdoche for her whole life, which, apparently, she had also ruined. When her friend arrived and saw her predicament, she suggested that Nosrat bring the pork to <i>her</i> house a few nights later; they’d figure out what to do with it together. Nosrat grasped at the invitation like a lifeline. That get-together evolved, over time, into Monday dinner, a now weekly ritual with a group of ten or so that, Nosrat told me, has become “the heart of everything for me.”</p>\n<p>It’s also at the heart of the book Nosrat has finally produced: “<a href=\"https://www.amazon.com/Good-Things-Recipes-Rituals-Cookbook/dp/1984857789/\">Good Things</a>,” part cookbook, part self-portrait, which does indeed contain recipes, along with advice, confessions, and stories about her dog. It begins with an acknowledgment that Nosrat worries she’s betrayed her readers and herself by assembling “a book of recipes after writing ‘Salt, Fat, Acid, Heat,’ which is a veritable manifesto designed to free cooks from relying on them.” But, as the introduction suggests, “Good Things” represents a dramatic rethinking of what Nosrat wants out of life in general. She’s still not quite sure where that leads. It might take her away from food entirely.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.newyorker.com/culture/persons-of-interest/how-samin-nosrat-learned-to-love-the-recipe\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "can-you-really-live-one-day-at-a-time",
    "title": "Can You Really Live One Day at a Time?",
    "category": "Culture & Arts",
    "subcategory": "3General",
    "category_slug": "culture-arts/3general",
    "date": "2025-09-16",
    "excerpt": "This summer, I reread the novel “ Aurora ,” by Kim Stanley Robinson, a science-fiction writer whom I profiled a few years ago. Robinson has an ecological orientation, and “Aurora” is basically a book about how we fit into nature. It ends on a beach, with an extended descriptio…",
    "cover": "https://media.newyorker.com/photos/68c877e9b3fdd0d2ef2f6085/master/pass/OpenQuestions_TimeManagement_final-1.gif",
    "source": "https://www.newyorker.com/culture/open-questions/can-you-really-live-one-day-at-a-time",
    "source_domain": "newyorker.com",
    "source_name": "Newyorker",
    "author": "Joshua Rothman",
    "rights": "Unknown",
    "body": "<p>This summer, I reread the novel “<a href=\"https://www.amazon.com/Aurora-Kim-Stanley-Robinson/dp/0316098094\">Aurora</a>,” by Kim Stanley Robinson, a science-fiction writer whom I <a href=\"https://www.newyorker.com/magazine/2022/01/31/can-science-fiction-wake-us-up-to-our-climate-reality-kim-stanley-robinson\">profiled</a> a few years ago. Robinson has an ecological orientation, and “Aurora” is basically a book about how we fit into nature. It ends on a beach, with an extended description of swimming in big waves. It’s early morning, and the waves, as they rise, “turn a deep translucent green.” Freya, the novel’s protagonist, has never swum in the ocean, and over the course of the morning she learns how. She discovers that she can dive under a swell, “feel the tug of the wave’s underturn,” and shoot up when it has passed; that she can swim fast up waves that are about to break, then “crash through their crests and fall down their backsides”; and that she can surf, “sliding sideways ahead of the break and across the surface of the wave, which keeps rising up before her, steepening at just the right speed to keep her falling down across it.” This is amazing, like flying, but it can also go wrong: when waves crash down on her before she’s ready, she gets tumbled along the bottom, hitting the sand. Once, she almost drowns.</p>\n<p>Freya swims under, over, and along the waves, one after another. Each wave is its own event, difficult or ideal, but collectively they chain together in a soothing rhythm. Sometimes she has to rush to handle a fast set of waves, but such moments are rare; most of the time, she can navigate the wave in front of her, and then turn to the next. This rhythm is part of what makes the beach a special place. It’s a little miraculous that something as powerful as the sea can be, in some sense, predictable.</p>\n<p>In ordinary life, by contrast, the flow of time often feels irregular. At painful moments, time can drag with excruciating slowness; when the pressure rises, it accelerates. I find that the end of summer is a period in which time seems to go faster. Days get shorter, the holidays loom, and the months begin to blur. Recently, I sat down with the school calendar to plan meetings for my son’s Lego robotics team, which I’m helping to coach. Almost every week contains some special day—a science fair, a Thanksgiving celebration—that must be prepared for in advance. In her book “<a href=\"https://www.amazon.com/Pilgrim-Tinker-Creek-Annie-Dillard/dp/0060953020\">Pilgrim at Tinker Creek</a>,” Annie Dillard describes the speed with which the sun can seem to rise and set: it’s as though the world is run by a magician, who says, “Presto chango!” Time trips over itself. In place of steady waves, there’s just a churning sea.</p>\n<p>There are strategies for regularizing time, all of which are familiar. One possibility is to subdue it through planning, using calendars, lists, and the like, which encourage us to see the march of time objectively. Another is to try “living in the moment”—a way of giving every unit of time its due. I like my calendars, but they’ve never quite created in me a sense of what David Allen, the <a href=\"https://www.newyorker.com/tech/annals-of-technology/the-rise-and-fall-of-getting-things-done\">productivity guru</a>, called “mind like water”; it’s more like my calendar app is a ticking time bomb, with a countdown I’m hesitant to check. Meanwhile, my attempts to live in the moment, even those abetted by meditation, have felt squishy, uncertain, and evasive. I find that I enjoy life most when it unfolds through regular, manageable units of time that are imposed from without.</p>\n<p>Over the past few years, I’ve discovered that my preferred solution is to live one day at a time. In some recovery programs, “one day at a time” is a mantra, expressing the idea that a daunting lifelong commitment to sobriety is best approached in daily steps. This is a little like what E. L. Doctorow <a href=\"https://www.theparisreview.org/interviews/2718/the-art-of-fiction-no-94-e-l-doctorow\">said</a> about being a novelist: Writing a novel “is like driving a car at night. You can see only as far as your headlights, but you can make the whole trip that way.” But I mean something different—that a day is wavelike. Each one comes forward with its own particular character. You can dive beneath it, or struggle up its face, or try to surf it, or get pummelled by it, but then another day comes, and another. We can usefully organize our experience by approaching it in terms of days. That’s obvious, isn’t it? But it isn’t always easy to do.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.newyorker.com/culture/open-questions/can-you-really-live-one-day-at-a-time\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-colorful-scandalous-true-history-of-the-machine-that-created-ameri",
    "title": "The Colorful, Scandalous, True History of the Machine That Created American Pop",
    "category": "Culture & Arts",
    "subcategory": "6General",
    "category_slug": "culture-arts/6general",
    "date": "2025-09-04",
    "excerpt": "Lisa Guerriero",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/c-d3mKGZY0QbvB8dr3zQN48uy-g=/420x240/filters:focal(600x400:601x401)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/f7/f8/f7f8dd61-f1c4-4e5a-83df-faad4de12fcf/wurlitzer_guerriero-3.jpg",
    "source": "https://www.smithsonianmag.com/arts-culture/colorful-scandalous-true-history-machine-created-american-pop-180987173/",
    "source_domain": "smithsonianmag.com",
    "source_name": "Smithsonianmag",
    "author": "Smithsonianmag",
    "rights": "Unknown",
    "body": "<h2>The jukebox got its start earlier than you might think, but it truly became iconic when rock ‘n’ roll took over in the 1950s</h2>\n<p>Lisa Guerriero</p>\n<p>In 1889, a San Francisco tavern called the Palais Royale debuted a hot new attraction: a modified Edison phonograph that, when a customer inserted a nickel, played music from a single wax cylinder. Electrical sound amplification was still years away, so customers had to insert stethoscope-like tubes into their ears to hear anything, ideally toweling down the tubes afterward to remove earwax ahead of the next listener.</p>\n<p>Despite this unwieldy setup, the machine reportedly brought in more than $1,000 (some $34,000 today) in less than six months, and coin-operated music machines soon proliferated in bars, at drugstores and even in new listening parlors across the country. Alas, poor sound quality meant selections couldn’t be soft or subtle, so popular offerings included such earsplitting numbers as John Philip Sousa marches and the novelty whistler John Yorke AtLee performing popular ditties of the day. By the early 1900s, the machines struggled to compete against player pianos and other automated instruments that could entertain whole venues with higher-quality audio—and without requiring patrons to stick foreign objects into their delicate ear canals.</p>\n<p>But record players continued to improve in quality and volume, and pay-to-play phonographs made a huge comeback in the 1920s, paving the way for the jukebox era. In 1927, the Automatic<br/>\nMusical Instrument Company unveiled the first amplified, multi-record coin phonograph. Jukeboxes—they took on this nickname in the 1930s in reference to African American “juke joints” of the South—introduced the world to music on demand, for far less than buying a record (and on better equipment than people had at home). The boxes also reshaped the recording industry, as labels began releasing music specifically designed for post-Prohibition barrooms and cafés. Danceable big-band numbers and tunes like the “Beer Barrel Polka” were early hits, and the irrepressible popularity of jukeboxes soon rocketed artists like swing impresario Glenn Miller to national fame, creating an audience for loud, catchy, rollicking tunes, often played on newly electrified instruments, shaping what would become country, R &amp; B and rock ’n’ roll. </p>\n<p>Jukebox operators came to account for a majority of record sales, as they frequently changed out selections to keep customers dropping nickels. Using meters within the machines, operators could track which tunes were most popular at which locations, and they programmed boxes accordingly, offering a mix of national hits and more regionally specific selections. The latter included many tunes by Black and working-class musicians, in folk genres such as country and blues that tended to get scant airplay on the radio of the day but soon found appreciative listeners on jukeboxes.</p>\n<p>By the early 1940s, about 500,000 jukeboxes dotted the country, sometimes inspiring <i>too</i> much of a ruckus: Newspapers frequently reported on bar fights over music selections and complaints about noise. Snootier critics, meanwhile, voiced more petulant grievances: “The contrivance is everywhere and is always booming its inanities,” one <i>Los Angeles Times</i> writer lamented in 1941.</p>\n<p>But jukeboxes had a chance to prove their patriotic bona fides during World War II, when they provided vital entertainment on military bases and at troops’ canteens, sometimes on machines donated by public-spirited American operators—not a single nickel required. “Not even the cacophony of war can dull the magic power of Wurlitzer Automatic Phonograph music,” boasted a 1944 ad. At the same time, a number of jukebox manufacturers, including Wurlitzer, retooled factories for weapons production.</p>\n<p>After the war, stylish and streamlined jukebox cabinets in diners let teenagers listen to rock ’n’ roll at volumes generally impossible (or at least inadvisable) to achieve at home. Jukeboxes became indelibly associated with 1950s youth culture, the songs selected as easily as ordering a diner burger or milkshake. Jukebox operators now furnished teenage canteens, modeled after the military rest spots where the boxes had helped entertain the youth of the previous decade. The format of hit-after-hit music queues also helped inspire teen-friendly Top 40 radio, replacing older formats that defaulted to playing several songs in a row by a single artist.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.smithsonianmag.com/arts-culture/colorful-scandalous-true-history-machine-created-american-pop-180987173/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "a-new-exhibit-in-toronto-reexamines-the-works-of-the-baroque-masters",
    "title": "A New Exhibit in Toronto Reexamines the Works of the Baroque Masters",
    "category": "Culture & Arts",
    "subcategory": "6General",
    "category_slug": "culture-arts/6general",
    "date": "2025-09-03",
    "excerpt": "The Descent, oil on linen, 7.5 by 25.8 feet, 2024. Jesse Mockrin.",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/bDi2XpXuxR4gOas2Fj78HjPZuHY=/420x240/filters:focal(1500x1000:1501x1001)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/54/d1/54d1b3a6-d108-4688-98af-2c543696f035/exh173832-standard_print_copy.jpg",
    "source": "https://www.smithsonianmag.com/arts-culture/new-exhibit-toronto-reexamines-works-baroque-masters-180987147/",
    "source_domain": "smithsonianmag.com",
    "source_name": "Smithsonianmag",
    "author": "Smithsonianmag",
    "rights": "Unknown",
    "body": "<html>\n  <body><h1>A New Exhibit in Toronto Reexamines the Works of the Baroque Masters</h1><h2>In her monumental work inspired by the Rape of the Sabine Women, an artist reimagines a much-depicted story from antiquity</h2><graphic src=\"https://th-thumbnailer.cdn-si-edu.com/RzgO2cjeo2sKTWcFfZJaykcq-zY=/1026x684/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/54/d1/54d1b3a6-d108-4688-98af-2c543696f035/exh173832-standard_print_copy.jpg\" alt=\"Jesse Mockrin, The Descent\"/><p><i>The Descent,</i>oil on linen, 7.5 by 25.8 feet, 2024. Jesse Mockrin.</p><p><i>The Descent</i>, 2024. Oil on linen, 7.5 by 25.8 feet. © Jesse Mockrin 2025. Image courtesy of the artist, James Cohan, New York, and Night Gallery, Los Angeles. Photo: Phoebe d'Heurle</p><p>The Rape of the Sabine Women, an episode in which Rome’s legendary founders forcibly abducted brides from a nearby community, has been a popular subject in painting and sculpture since the Renaissance—so popular, in fact, that we may miss the brutality of the original myth. “There’s almost this sense of familiarity-blindness to these stories,” says American artist Jesse Mockrin, who depicts the Sabine drama from the perspective of the women themselves in her large-scale 2024 painting <i>The Descent</i>, one of more than 12 new works on view in a solo exhibition opening at Toronto’s Art Gallery of Ontario in September.</p><p>Riffing off 16th- and 17th-century Baroque artists like Caravaggio and Peter Paul Rubens, who brought new levels of technical virtuosity and theatrical flair to scenes from the Bible and mythology, Mockrin asks viewers to reconsider themes of sex, gender and violence that run through the Western canon. At the same time, she resists the contemporary cultural impulse to tear down statues and reject our past for its flaws. “I think the old masters were masters. … I feel like a fan to some extent,” she confesses. “I also feel like I can be critical of the messages inherent in those works, and conscious of trying to update them to a female perspective, in this moment.”</p><h4>Did You Know? How to see the exhibit</h4>The exhibition<p><a href=\"https://ago.ca/exhibitions/jesse-mockrin-echo\">opens to the public on September 11 in Toronto.</a></p><i>Jesse Mockrin: Echo</i><graphic src=\"https://th-thumbnailer.cdn-si-edu.com/g3lEazq-uZJBAY9i9p_0kH8xPxk=/fit-in/1072x0/filters:focal(436x601:437x602)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/24/f2/24f2cf65-a558-4864-bdf2-a2ae4c1c415b/jesse_mockrin_exhibition_2023.jpg\" alt=\"Jesse Mockrin, Exhibition\"/><p><i>Exhibition,</i>oil on cotton/linen, 73.7 x 50.8 centimeters, 2023. Jesse Mockrin.</p><p><i>Exhibition</i>, 2023. Oil on cotton/linen, 73.7 x 50.8 cm. Private Collection, Courtesy Kristy Bryce Art Advisory. © Jesse Mockrin 2025. Image courtesy of the artist. Night Gallery, Los Angeles, and James Cohan, New York.</p><graphic src=\"https://th-thumbnailer.cdn-si-edu.com/5a8dWVmVS4NgoUT-bIXfW2TUHhQ=/fit-in/1072x0/filters:focal(600x411:601x412)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/ff/10/ff106bd2-38da-4edc-806c-aebcd2823baf/jesse_mockrin_fracture_2024.jpg\" alt=\"Jesse Mockrin, Fracture\"/><p><i>Fracture,</i>oil on cotton, 91.4 x 142.2 centimeters, 2024.</p><p>Jesse Mockrin.</p><p><i>Fracture</i>, 2024. Oil on cotton, 91.4 x 142.2 cm. Art Gallery of Ontario. Purchase, with funds from the F.P. Wood Fund, 2025. © Jesse Mockrin 2025. Image courtesy of the artist, Night Gallery, Los Angeles, and James Cohan, New York.</p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.smithsonianmag.com/arts-culture/new-exhibit-toronto-reexamines-works-baroque-masters-180987147/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "these-photos-of-harvesting-cranberries-transform-the-annual-ritual-int",
    "title": "These Photos of Harvesting Cranberries Transform the Annual Ritual Into a Shimmering Spectacle",
    "category": "Culture & Arts",
    "subcategory": "6General",
    "category_slug": "culture-arts/6general",
    "date": "2025-09-03",
    "excerpt": "Each fall in eastern Massachusetts, people gather to watch the cranberry harvest. The berries grow in a dry bog over the course of 16 months, and in October or November, farmers flood the area with water. A machine known colloquially as an eggbeater knocks the tiny red orbs of…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/VNJT0gAREqt1PiWBVsIZMJcHbEc=/420x240/filters:focal(1879x1065:1880x1066)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/3c/d5/3cd54d13-ff92-4883-8fa0-9e3e920ac633/sepoct2025_g11_cranberries.jpg",
    "source": "https://www.smithsonianmag.com/arts-culture/photos-harvesting-cranberries-transform-annual-ritual-shimmering-spectacle-180987170/",
    "source_domain": "smithsonianmag.com",
    "source_name": "Smithsonianmag",
    "author": "Smithsonianmag",
    "rights": "Unknown",
    "body": "<h2>In eastern Massachusetts, flooded wetlands cover the landscape as farmers collect the crop that features on Thanksgiving tables nationwide</h2>\n<p>Each fall in eastern Massachusetts, people gather to watch the cranberry harvest. The berries grow in a dry bog over the course of 16 months, and in October or November, farmers flood the area with water. A machine known colloquially as an eggbeater knocks the tiny red orbs off of their vines and they float to the surface, making it easy for workers to corral them and pump them into a nearby truck. It’s a visually mesmerizing process, and photographer Joanna L. Steidle knew she wanted to capture it from above with a drone. “Carver, Massachusetts, is home to the Ocean Spray cooperative, and it’s enormous,” Steidle said, referring to the company that sells the leading brand of cranberry juice. “The farms were up and down the whole road. As we were flying the drone, we could see massive, empty trucks coming into the bogs and full trucks leaving.”</p>\n<p>Long before the descendants of European colonists began growing cranberries on such a grand scale, the native Wampanoag people used to pick the wild varieties called <i>sasumuneash</i>, adding them to squash, puddings, breads and meat. They also used the berries medicinally, to reduce fevers and swelling. </p>\n<p>Cranberries may well have been on the table at the first Thanksgiving dinner in 1621, when newly arrived English families sat down with their Wampanoag neighbors to celebrate the harvest. The berries became a staple of the autumn holiday, mainly because they ripened at the right time of year. The 1796 edition of <i>American Cookery</i>, the first cookbook published in the United States, included a recipe for a cranberry dessert, as well as recipes for turkey, potatoes and apple pie. (The author, Amelia Simmons—who described herself as “an American orphan”—also gave detailed instructions on how to cook and dress a turtle, but that dish never made it to the traditional Thanksgiving table.)</p>\n<p>Photographer Joanna Steidle has advice for other drone photographers who want to find the best shots in new areas.</p>\n<ul>\n      <li>&#13;\n\t<p>Be aware of privacy issues, especially if you’re shooting a scene you can’t easily see from the road.</p></li>\n      <li>&#13;\n\t<p>Before you start shooting pictures, take the drone up and film a 360-degree video of the scenery. Then analyze the footage to find hidden gems in the landscape.</p></li>\n    </ul>\n<p>Nobody actively cultivated and marketed cranberries until 1816, when Henry Hall, a Massachusetts farmer and Revolutionary War veteran, noticed that the wild cranberries on his property thrived when sand blew over them. The sand helped push the roots of the vines more deeply into the earth, which made them more productive. It also proved to be a natural form of pest control and suppressed weeds and fungi. Hall started intentionally growing the berries this way, and others copied his methods.</p>\n<p>Massachusetts soon became known for its enormous cranberry industry. In the early days, harvesting the berries was extremely labor-intensive. Farmers and their families had to pick each individual berry by hand. In the 1880s, people began making use of a newly invented cranberry scoop. The top of the tool was designed to rake through the vines, loosening the berries, which would then fall into a receptacle. During cranberry-picking season, local schools excused children so they could help their families scoop up all the berries.</p>\n<p>In 1912, Marcus L. Urann, the head of the United Cape Cod Cranberry Company, began canning cranberry sauce for year-round use. He also innovated the cranberry syrup that became a staple for mixed drinks. Over time, Urann joined forces with other cranberry companies and the enterprise evolved into Ocean Spray, which began producing its now-familiar jellied cranberry “log” in 1941. Ocean Spray is still a cooperative of around 700 separate cranberry growers.</p>\n<p>Starting in the 1960s, farmers began flooding their bogs, which cut down dramatically on labor. Most types of berries can’t be harvested in this way—they would sink to the bottom. But each cranberry has four air pockets inside, an evolutionary feature that makes it easier for the berries to float downstream and spread their seeds to new areas. Farmers in previous eras had figured out that they could separate ripe cranberries from overripe and underripe ones by testing how well they bounced. That same buoyancy allowed ripe berries to float to the surface of a flooded bog, making it much easier for harvesters to scoop them up and transport them to the processing plant.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.smithsonianmag.com/arts-culture/photos-harvesting-cranberries-transform-annual-ritual-shimmering-spectacle-180987170/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-first-magazines-written-for-career-women-reveal-a-portrait-of-imme",
    "title": "The First Magazines Written for Career Women Reveal a Portrait of Immense Creativity and Hope",
    "category": "Culture & Arts",
    "subcategory": "6General",
    "category_slug": "culture-arts/6general",
    "date": "2025-09-02",
    "excerpt": "Charm amid traffic on Park Avenue. William Helburn / Getty Images",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/2nsM2gTu6GJXc4VyDJUmC29pThg=/420x240/filters:focal(712x573:713x574)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/db/b1/dbb18e81-3519-4098-842c-ed6aad3cf251/sepoct2025_j15_prologue.jpg",
    "source": "https://www.smithsonianmag.com/arts-culture/first-magazines-written-for-career-women-reveal-portrait-immense-creativity-hope-180987174/",
    "source_domain": "smithsonianmag.com",
    "source_name": "Smithsonianmag",
    "author": "Smithsonianmag",
    "rights": "Unknown",
    "body": "<h2>Publications including “Mademoiselle,” “Glamour” and the long-forgortten “Charm” first emerged in the 1930s to satisfy an emergent force in the workplace</h2>\n<p><i>Charm</i>amid traffic on Park Avenue. William Helburn / Getty Images</p>\n<p>Sometime during the Great Depression, a high school student named Helen Ralston complained to her father that she and her friends were fed up with <i>Vogue </i>and <i>Harper’s Bazaar</i>. The French couture and luxurious lifestyles promoted in their pages were unattainable, she said, while the articles did not speak to the interests of young women or girls her age. There were another 40-odd women’s magazines on the market, but all were aimed at housewives. </p>\n<p>Luckily for Helen, her father, Henry W. Ralston, a vice president of the New York publishing company Street &amp; Smith, was in a position to address her concerns. Since the 19th century, his firm had been turning out men’s and boys’ fiction by authors like Horatio Alger and Bret Harte, plus pulps and comic books like <i>Detective Story</i> and <i>Buffalo Bill</i>. Fired by this bracing wisdom from his daughter, in February 1935, Henry and his colleagues introduced <i>Mademoiselle</i>, the country’s first magazine for young women, which also became the first “career-girl” magazine in the United States. </p>\n<p>The extraordinary early history of <i>Mademoiselle</i>, and of the similar publications it inspired, is little known. A close study of their archives reveals an era of remarkable advancements for American women—poignant, as it proved so fragile. Nonetheless, these women writers and editors helped write an early and important draft of 20th-century American feminism. And they did it in style. </p>\n<p><i>Mademoiselle</i>’s first issue, conceived by a primarily male editorial team, got off to an inauspicious start. Later a newsagent told the editors that its few buyers were mostly men who, drawn by the saucy French name—and perhaps also by the cover photo, of a woman in a backless evening gown—mistakenly assumed it was a “girlie book.” Instead, the issue contained a grab bag of material concocted for a youthful female reader, including fashion sketches, girls’ adventure stories and overwrought tales of romance, one concerning a Southern gent who shocks himself by falling for a Yankee at a ball. Humiliated by low sales, the editors swiftly withdrew the sorry experiment from newsstands and halted publication for a month to regroup. </p>\n<p>Thankfully, by then they had hired Betsy Talbot Blackwell, a 29-year-old journalist with more than a decade’s experience in fashion reporting and marketing. Blackwell also had an adolescent stepdaughter, an impressive bullpen of writer friends on whom she could call and above all a keen sense of what young women wanted: something totally unlike their mothers’ magazines.</p>\n<p><i>Mademoiselle</i> originally targeted women between the ages of 18 and 30, all of whom had come of age knowing they could vote. “What nobody seemed to have noticed was that women had changed,” Blackwell later reflected. “Younger women were in revolt. Their ideas were different from their mothers’....They were not interested solely in recipes or babies. They were going to college. They were getting jobs.” </p>\n<p>She went after college women, publishing first-rate writing by authors like the wildly popular French writer of the day known as Colette, and pulling together an advisory “College Board” of students, who sent in tips about fashions and social trends. The magazine drew more eyeballs with an annual August “Guest Editors” issue, also assembled by students. This gambit, for which <i>Mademoiselle</i> is best remembered today, later helped launch literary stars like Sylvia Plath and Joan Didion. </p>\n<p>Other attention-getting ploys included a series in which a Hollywood makeup artist revealed beauty tricks used by actresses, adapted for home use. When a self-described “homely” nurse wrote in, begging <i>Mademoiselle</i> to transform her “from ugly duckling even into a pale pink swan,” the editors created the first makeover. Nurse Barbara’s metamorphosis made national news, winning a page of admiring coverage in <i>Time</i> magazine. </p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.smithsonianmag.com/arts-culture/first-magazines-written-for-career-women-reveal-portrait-immense-creativity-hope-180987174/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]