[
  {
    "slug": "a-veteran-pixar-animator-s-newest-book-is-an-epic-undertaking-that-beg",
    "title": "A Veteran Pixar Animator’s Newest Book Is an Epic Undertaking That Began 5,000 Years Ago",
    "category": "Culture & Arts",
    "subcategory": "6General",
    "category_slug": "culture-arts/6general",
    "date": "2025-08-29",
    "excerpt": "The Mahabharata is the longest epic in recorded history, seven times the length of Homer’s Iliad and Odyssey put together. The Sanskrit verses, attributed to the ancient sage Vyasa (who is also a character in the tale), describe the events leading up to a massive war. The stor…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/1Mj6jP3SAe8R2IY-GpRPw5qjjAQ=/420x240/filters:focal(750x500:751x501)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/63/1600/63902d06-3424-4971-a220-0b16044dae9a/m1.jpg",
    "source": "https://www.smithsonianmag.com/arts-culture/veteran-pixar-animator-newest-book-epic-undertaking-began-5000-years-ago-180987179/",
    "source_domain": "smithsonianmag.com",
    "source_name": "Smithsonianmag",
    "author": "Smithsonianmag",
    "rights": "Unknown",
    "body": "<h2>Sanjay Patel enjoyed success on YouTube with his colorful shorts and is about to release a richly illustrated book that tells the story of the longest poem in the world</h2>\n<p>The<i> Mahabharata</i> is the longest epic in recorded history, seven times the length of Homer’s <i>Iliad</i> and <i>Odyssey</i> put together. The Sanskrit verses, attributed to the ancient sage Vyasa (who is also a character in the tale), describe the events leading up to a massive war. The story, set some 5,000 years ago, is loaded with so many divinities, characters and subplots that one European scholar, writing in 1922, <a href=\"https://babel.hathitrust.org/cgi/pt?id=mdp.39015074796577&amp;page=root&amp;view=1up&amp;size=100&amp;seq=8\">characterized</a> the <i>Mahabharata</i> as “the most monstrous chaos: Alongside the main narrative, there were veritable jungles of smaller narratives, as well as countless and endless teachings.”</p>\n<p>Sanjay Patel, an artist and former Pixar animator, cuts through these verbal jungles with clear, powerful images. His <a href=\"https://amzn.to/476vmyb\">2010 version of the  Ramayana</a>—another (shorter) Hindu epic—has already been </p>\n<p><a href=\"https://www.instagram.com/p/DBJY6n-tQR8/\">added</a>to grade school classrooms across the United States. His animated 2023 YouTube series, “</p>\n<p><i>,” introduced Hindu stories to preschoolers, depicting the gods as adorable children. In his richly illustrated 400-page</i></p>\n<p><i>, Patel’s imagery takes on a more somber tone, with sharper angles and darker hues.</i></p>\n<p>It’s a serious story, but Patel hopes his retelling will capture the imaginations of middle schoolers like his oldest son, Arjun (who shares the name of the <i>Mahabharata</i>’s hero). “You have to remix these ideas,” he says, “if you want them to survive.”</p>\n<ul><li>The <i>Mahabharata</i>focuses on the Hindu concept of<i>dharma</i>—living in accord with one’s specific purpose on earth.</li></ul>\n<p>Patel spoke with <i>Smithsonian</i> magazine in advance of the book’s release this October.</p>\n<p><strong>You grew up in San Bernadino, California, with Indian immigrant parents. Did they read these epics to you when you were a kid?</strong></p>\n<p>Nothing was ever formally taught, but my parents had rituals. Every day, I’d have to participate in a meditation or puja practice. But I didn’t understand or appreciate what was behind these symbols and rites and rituals.</p>\n<p><strong>I remember that from “ Sanjay’s Super Team,” your Pixar animated short nominated for an Academy Award in 2016. You showed yourself as a little kid, imagining that the gods your father was worshiping were like the superheroes you liked to watch on TV. </strong></p>\n<p>Part of that story was poetic license. I absolutely was required to participate in these rituals. But my epiphany really came later on when I picked up a book of Hindu miniature paintings. Art was the medium that finally unlocked all these stories and philosophies. That was the context where it finally made sense to me. I started to see these gods as characters, and I sort of got underneath the philosophy that way.</p>\n<h3>\n        <a href=\"https://www.amazon.com/dp/B0DZ13P5X2?tag=smithsonianco-20&amp;linkCode=ogi&amp;th=1&amp;psc=1\">\n          Mahabharata: Designs of Dharma\n        </a>\n      </h3>\n<p>Adapted and illustrated with both humor and heart for a contemporary audience, this stunning visual retelling of the Indian epic the Mahabharata features more than 400 pages of illustrated text in Academy Award-nominated animator Sanjay Patel’s iconic style.</p>\n<p><a href=\"https://www.amazon.com/dp/B0DZ13P5X2?tag=smithsonianco-20&amp;linkCode=ogi&amp;th=1&amp;psc=1\"/></p>\n<p><strong>The Hindu gods are obviously very visual. They have multiple faces, or multiple arms holding weapons or books or musical instruments. That visual element seems to be built into the religion, as a way to understand what the gods represent. </strong></p>\n<p>I honestly think one of the strengths of Hinduism is that there’s no one dogma. There are a lot of symbols and rituals, but in many ways, it’s like a buffet of diverse options. There’s room for people to bring what they want to these symbols and images. If you want more, obviously there are thousands of years of writings about what these symbols and images mean. If you don’t want more, that’s fine too. You can just hang out with a cool image of elephant-headed <a href=\"https://amzn.to/47EvpBv\">Ganesha</a>.</p>\n<p><strong>Tell me about the illustration from your  Mahabharata book where Krishna becomes enormous. </strong></p>\n<p>That’s the theophany [a deity manifesting himself in front of human beings]. I love that moment. I had the great fortune of getting a lot of guidance from <a href=\"https://www.religion.utoronto.ca/people/directories/all-faculty/arti-dhand\">Arti Dhand</a>, a professor at the University of Toronto. She’s a <i>Mahabharata</i> scholar, and she has an amazing <a href=\"https://www.themahabharatapodcast.com/\">podcast</a>. Anybody who knows the text would know about one scene where Krishna reveals his cosmic form to the hero, Arjuna. But not as many people know about this other moment, a second theophany, where he reveals himself to the antagonist, Duryodhana. He’s trying to get Duryodhana to change his ways, to not start a war. Sadly, he doesn’t succeed.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.smithsonianmag.com/arts-culture/veteran-pixar-animator-newest-book-epic-undertaking-began-5000-years-ago-180987179/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]