[
  {
    "slug": "this-secret-fall-starbucks-drink-is-stealing-psl-s-thunder-here-s-how-",
    "title": "This Secret Fall Starbucks Drink Is Stealing PSL’s Thunder—Here's How To Order It",
    "category": "Food & Drink",
    "subcategory": "General",
    "category_slug": "food-drink/general",
    "date": "2025-09-20",
    "excerpt": "Pumpkin season usually belongs to coffee—I've already chugged down my fair share of PSLs and it's only mid-September—but this year’s star is wearing green. Enter the Pumpkin Spice Matcha, a fan-built combo that’s suddenly everywhere on your feed as well as the Starbucks app’s …",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/grande-starbucks-to-go-cup-on-table-royalty-free-image-1758321671.pjpeg",
    "source": "https://www.delish.com/food/a67971863/starbucks-pumpkin-matcha-latte-how-to-order/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "\n  \n    <ul>\n      <li>Starbucks fans are raving about a “secret” Pumpkin Spice Matcha available via app customizations.</li>\n      <li>It blends matcha with brown sugar, a hit of pumpkin, and pumpkin cream cold foam.</li>\n      <li>You can order it when featured or ask for the custom add-ons in person.</li>\n    </ul>\n    <p>Pumpkin season usually belongs to coffee—I've already chugged down my fair share of PSLs and it's <i>only</i> mid-September—but this year’s star is wearing green. Enter the Pumpkin Spice Matcha, a fan-built combo that’s suddenly everywhere on your feed as well as the <a href=\"https://www.delish.com/starbucks/\">Starbucks</a> app’s rotating custom-offers carousel. </p>\n    <p>Think fall flavor you know, paired with a greener base that drinks lighter than a traditional latte (that also kind of looks like Halloween candy in a cup—jury's out if that's good or bad).</p>\n    <p>Ordering on the app is the easy mode whenever Starbucks surfaces it under Offers. Want to ask at the counter? Give your barista this quick script for the cold version:</p>\n    <ul>\n      <li>Iced matcha latte</li>\n      <li>Oat milk instead of 2% (or any milk you like)</li>\n      <li>No classic sweetener</li>\n      <li>Two pumps brown sugar syrup</li>\n      <li>One pump pumpkin sauce</li>\n      <li>Pumpkin cream cold foam on top</li>\n      <li>Pumpkin spice topping</li>\n    </ul>\n    <p>Fans are already very vocal about the seasonal bevvy on social media: “I love the girlies that get straight to posting the order,” one person joked, while another confessed, “Now I wanna leave work to go order 😂😂.” The chorus <a href=\"https://www.tiktok.com/@motivated_vee/video/7550093256244120846?q=starbucks%20pumpkin%20spice%20matcha&amp;t=1758320475612\">kept going</a>: “Omgggg yayyy!!! It’s sooo good! ❤️”—and even the skeptics chimed in <a href=\"https://www.tiktok.com/@baked_bybrit/video/7278505701826252075?q=starbucks%20pumpkin%20spice%20matcha&amp;t=1758320475612\">with affection</a>: “Matcha tastes like grass but f***ing delicious!!!!” </p>\n    <p>If <a href=\"https://www.delish.com/kitchen-tools/a65902466/starbucks-psl-real-pumpkin-ingredients/\">PSL</a> is your fall ritual but espresso isn’t your thing, this is the crossover episode you’ve been waiting for. Everyone who likes their autumn drinks with a side of TikTok-worthy color palette, your new order has entered the chat.</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/food/a67971863/starbucks-pumpkin-matcha-latte-how-to-order/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "best-greek-salad",
    "title": "Best Greek Salad",
    "category": "Food & Drink",
    "subcategory": "General",
    "category_slug": "food-drink/general",
    "date": "2025-09-19",
    "excerpt": "Let us know how it went in the comments below!",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/greek-salad-index-642f292397bbf.jpg",
    "source": "https://www.delish.com/cooking/recipe-ideas/a54226/best-greek-salad-recipe/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "\n  \n    <h2>Made This?</h2>\n    <p>Let us know how it went in the comments below! </p>\n    <p>When you’re looking for simple, refreshing, <i>and </i>reliable, you’d be hard-pressed to find a better dish than Greek salad. Also known as <i>horiatiki</i> (Greek for “peasant salad” or “village salad”), this rustic dish is a chunky assemblage of tomatoes, cucumbers, black olives, red onion, and a <i>substantial</i> amount of feta—many traditional recipes are crowned with thick slabs of it. Anointed with a bright, herby dressing of lemon juice, red wine vinegar (sometimes), dried oregano, and extra-virgin olive oil, it’s a marvelous, Mediterranean way to celebrate <a href=\"https://www.delish.com/cooking/recipe-ideas/g65104794/summer-produce-recipes/\">summer produce</a>. The best part? This easy recipe only takes 15 minutes to prepare, making it a perfect last-minute addition to any meal. Ready to make it your own? Keep reading on for all of my top tips: </p>\n    <p><strong>What People Are Saying:</strong><br/>\"Love it. We are a Greek family and it's a favorite every time. Even Mum is impressed.\" -<i>GoldDucky</i> </p>\n    <p>\"Made it &amp; my family loves it! I’m making it for a picnic this weekend as well. Thanks for sharing the recipe!\" <i>-GreenMustache</i> </p>\n    <p>Sharpen your chef’s knife and prep those ingredients! If you’re going to soak the red onion (to reduce its pungency), now’s the time to do it. Be sure to cut the feta into large cubes so it doesn’t wind up as crumbles. The tomatoes and olives should stay chunky—just halve them and move on. Now combine everything in a large bowl and admire all those colors.</p>\n    <p>On to the dressing: To get a good emulsion, you want to combine the water-based ingredients (the lemon juice and vinegar) first and then gradually whisk in the oil until the dressing is slightly thickened and completely homogeneous. A well-emulsified dressing won’t separate and will wrap the salad ingredients in a loving embrace rather than run right off them. When seasoning the dressing, bear in mind that the feta is quite salty. </p>\n    <p>Pour the dressing over the salad and toss gently, trying not to break up the feta. Now dig in. I told you this was simple!</p>\n    <p>\n      <i>The full list of ingredients and directions can be found in the recipe below.</i>\n    </p>\n    <p>This salad is best eaten fresh, but if you have any leftovers, store them in the fridge for up to 3 days.</p>\n    <p>cucumber, halved lengthwise, thinly sliced into half-moons</p>\n    <p>red onion, thinly sliced</p>\n    <p>grape or cherry tomatoes, halved</p>\n    <p>halved pitted Kalamata olives</p>\n    <p>feta, cut into 1/2\" cubes</p>\n    <p>red wine vinegar</p>\n    <p>Juice of 1/2 lemon</p>\n    <p>dried oregano</p>\n    <p>Kosher salt</p>\n    <p>Freshly ground black pepper</p>\n    <p>extra-virgin olive oil</p>\n    <p>Let us know how it went in the comments below! </p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/cooking/recipe-ideas/a54226/best-greek-salad-recipe/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "learn-how-to-peel-potatoes-get-dinner-done-fast",
    "title": "Learn How To Peel Potatoes & Get Dinner Done FAST",
    "category": "Food & Drink",
    "subcategory": "General",
    "category_slug": "food-drink/general",
    "date": "2025-09-19",
    "excerpt": "There are certain kitchen tasks that can easily go from therapeutic to reasons to seek therapy, and learning how to peel potatoes is one of the most classic examples. While stripping away the skins to reveal the clean potato underneath can be a genuinely enjoyable task—at leas…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/raw-potatoes-royalty-free-image-1758315169.pjpeg",
    "source": "https://www.delish.com/kitchen-tools/kitchen-secrets/a67961345/how-to-peel-potatoes/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "\n  \n    <ul>\n      <li>Potato peels are often removed because their fibrous texture changes the consistency of potato dishes.</li>\n      <li>Potato peelers are a great tool that can be used to easily remove potato skins without damaging the potato underneath.</li>\n      <li>When working with big batches of potatoes, peeling with a peeler can be a tedious task, and in that case, we have another solution.</li>\n    </ul>\n    <p>There are certain kitchen tasks that can easily go from therapeutic to reasons to seek therapy, and learning how to peel potatoes is one of the most classic examples. While stripping away the <a href=\"https://www.delish.com/cooking/recipe-ideas/a51229/loaded-potato-skins-recipe/\">skins</a> to reveal the clean <a href=\"https://www.delish.com/cooking/recipe-ideas/g3030/potato-recipes/\">potato</a> underneath can be a genuinely enjoyable task—at least for those of us who get a kick out of cleaning—around the <a href=\"https://www.delish.com/holiday-recipes/\">holidays</a>, or any other event that calls for peeling mountains of potatoes, it’s important to figure out the quickest and most effective ways to get the job done.</p>\n    <h2>Why Should You Peel Potatoes?</h2>\n    <p>Potato peels are completely edible and actually contain a good amount of fiber, vitamins, and other nutrients that are beneficial to our health; however, they do change the texture of potato recipes. Some people prefer skins in their mashed potatoes, but if you want a smoother <a href=\"https://www.delish.com/cooking/recipe-ideas/a51451/easy-chicken-parmesan-recipe/\"> mashed potato</a>, or especially with a pommes purée, you’re going to want to remove those fibrous skins. Though, honestly, often the decision of whether or not to peel potatoes breaks down to a matter of taste.</p>\n    <p>Now I know I’m talking all about the best ways to get skin off of potatoes, but it’s a shame to waste them! Turn those strips into our <a href=\"https://www.delish.com/cooking/a46487812/veggie-peel-chips-recipe/\"> veggie peel chips</a>.</p>\n    <h2>How To Peel Potatoes</h2>\n    <p>The simplest method for peeling potatoes is also the most straightforward. Simply grab your potato peeler in your non-dominant hand and work your way down the potato, peeling the skin in vertical strokes, and turning the potato as you go so that once you make a full 360° rotation, all the skin that is left is at the very top and bottom of the potato. At this point, go ahead and use the peeler to clean both ends of the potato until all the skin is removed. Repeat these steps with each potato that you’re using, and be careful not to accidentally catch your skin with the peeler.</p>\n    <p>Different potatoes have skins with varying thicknesses, but each can be peeled easily and quickly using a potato or vegetable peeler. This method is certainly the quickest and simplest way to peel a small number of potatoes, but if you need to work through an especially large batch, you may want to check out the next method.</p>\n    <h2>Other Methods Worth Trying</h2>\n    <p>Another potato peeling technique that you may consider trying doesn’t actually involve a potato peeler at all. This method calls for scoring each potato all the way around the middle and then placing them in a pot to boil. Once the potatoes have cooked long enough to be fork-tender, remove them from the pot and either set them on a cutting board to cool or dunk them into an ice bath to cool more quickly. Then, once they are cool enough to handle comfortably, pull the skin in either direction away from the center, and it should slide right off.</p>\n    <p>This method works great if you are using a lot of potatoes at once, but it does have a few limitations. For one, this method obviously isn’t great for any recipes where you don’t want to use boiled potatoes, so it limits the recipes where this would be helpful. Another drawback is that this method only really works for potatoes with thicker skins, like russets or sweet potatoes. With thinner-skinned varieties like Yukon gold or Idaho yellow potatoes, the skin isn’t going to peel away easily, and you’ll be left with chunks of potato sticking to the torn potato peels.</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/kitchen-tools/kitchen-secrets/a67961345/how-to-peel-potatoes/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "best-ever-farro-salad",
    "title": "Best-Ever Farro Salad",
    "category": "Food & Drink",
    "subcategory": "General",
    "category_slug": "food-drink/general",
    "date": "2025-09-19",
    "excerpt": "Let us know how it went in the comments below!",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/190307-farro-salad-288-1553552692.jpg",
    "source": "https://www.delish.com/cooking/recipe-ideas/a43059/best-farro-salad-recipe/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "\n  \n    <h2>Made This?</h2>\n    <p>Let us know how it went in the comments below!</p>\n    <p>In the <a href=\"https://www.delish.com/fall-recipes/\">fall</a> and winter, I find myself making farro salads again and <i>again</i>. While there are plenty of delicious ways to make them, this recipe is my all-time favorite. The homemade fried shallots contribute crunch and texture, while the homemade shallot oil gives the <a href=\"https://www.delish.com/cooking/g40189579/salad-dressing-recipes/\">dressing</a> an irresistibly rich and aromatic twist. Boiling the farro in veggie broth, rather than water, infuses this already flavorful <a href=\"https://www.delish.com/cooking/g42229861/grain-bowl-recipes/\">grain</a> with even more flavor. And then there are all the mix-ins—nuts, cheese, fruit, greens—which lend the <a href=\"https://www.delish.com/cooking/recipe-ideas/g30717155/spring-salads/\">salad</a> substance and make every bite an adventure. I love this salad as is, but if you want to make it your own, keep reading on for all of my top tips: </p>\n    <p><strong>What People Are Saying:</strong><br/>\"This has to be my favorite recipe. I made it for a potluck and my friend's food snob husband asked for the recipe. now in their regular potluck/party rotation, too.\" - <i>GoldBattery</i></p>\n    <p>\"This is THE BEST farro recipe ever. And I say that as someone who has been making farro recipes for years. Perfection. I’ve made it twice in the span of a week. Thank you.\" - <i>ElizabethL</i></p>\n    <p>Alright, let's get going on the farro! Grab a medium saucepan and add the farro, vegetable broth, bay leaf, and 1/2 tsp. salt. Bring it to a boil, then reduce to a simmer and cover with a lid. Let it cook away until the farro has absorbed all the liquid. We're aiming for tender but still with a bit of chew; no one wants mushy farro! By the end of cooking the farro should be plump and slightly split, which is just perfect. This will take about 30 minutes. Once it's done, transfer the farro to a large bowl and let it cool.</p>\n    <p>Now let's make the crispy shallots! Grab a small saucepan and add the olive oil and shallots. Heat over medium until the shallots start bubbling. Cook, stirring occasionally and adjusting the heat as needed to keep them gently bubbling away, until the shallots are golden brown and crisp. This usually takes 15 to 20 minutes, but keep a close eye on the shallots once they begin to brown because things can move quickly from there. To test for crispiness, remove one with a slotted spoon—if it slumps, it’s not done yet! When the shallots are ready, remove the pan from the heat and use a slotted spoon to transfer them to a paper towel-lined plate and immediately season with a pinch of salt. Let the oil cool—you’ll need it for the dressing in just a bit.</p>\n    <p>When the shallot oil has cooled completely, it’s time to make the dressing. Transfer the shallot oil to a medium bowl, then add the vinegar, mustard, and honey. Grab a whisk and prepare yourself for a little culinary calisthenics. Vigorously whisk the dressing until it thickens and emulsifies, and the honey is fully dissolved. Season to taste with salt and pepper.</p>\n    <p>Okay, some assembly required! Add the shallots, arugula, apple, Parmesan, basil, parsley, and pecans to the farro. Drizzle the dressing over and toss gently to bring it all together. Now that’s what I call the best farro salad <i>ever</i>!</p>\n    <p><i>The full list of ingredients and directions can be found in the recipe below. </i> </p>\n    <p>I highly recommend treating this salad as a template for a great grain salad. So long as you’ve got all the requisite elements—sweet, salty, soft, crunchy, fatty, and fresh—you’re golden. Not a fan of pecans? Use walnuts instead! Got some extra pears on hand? Ditch the apples and use them! Be bold and make this salad your own!</p>\n    <p>The farro can be boiled 4 days ahead; let cool, then refrigerate in an airtight container. The shallots can be fried 3 days ahead; let cool completely, then store in a paper towel-lined airtight container at room temperature. The shallot oil can be stored in an airtight container in the refrigerator for up to 1 week; strain the cooled oil into a jar, then seal and refrigerate.</p>\n    <p>whole-grain farro</p>\n    <p>low-sodium vegetable broth</p>\n    <p>bay leaf</p>\n    <p>Kosher salt</p>\n    <p>large shallot, very thinly sliced</p>\n    <p>extra-virgin olive oil</p>\n    <p>apple cider vinegar</p>\n    <p>Dijon mustard</p>\n    <p>honey</p>\n    <p>Freshly ground black pepper</p>\n    <p>green apple, chopped</p>\n    <p>lightly packed arugula</p>\n    <p>shaved Parmesan</p>\n    <p>coarsely chopped toasted pecans</p>\n    <p>finely chopped fresh basil</p>\n    <p>finely chopped fresh parsley</p>\n    <p>Let us know how it went in the comments below!</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/cooking/recipe-ideas/a43059/best-farro-salad-recipe/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "nearly-22-000-units-of-aldi-appliance-recalled-for-fire-hazard-issues",
    "title": "Nearly 22,000 Units Of Aldi Appliance Recalled For Fire Hazard Issues",
    "category": "Food & Drink",
    "subcategory": "General",
    "category_slug": "food-drink/general",
    "date": "2025-09-19",
    "excerpt": "Stop prepping for that upcoming birthday party—a usually fun countertop appliance sold at Aldi has been recalled over fire hazard concerns. The Ambiano Cotton Candy Maker, the hit of any good party , has a faulty heating element that can cause sugar to ignite when the included…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/the-aldi-logo-is-seen-on-the-outside-of-one-of-its-grocery-news-photo-1758307530.pjpeg",
    "source": "https://www.delish.com/food-news/a67965755/aldi-ambiano-cotton-candy-maker-recall-fire-hazard/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "\n  \n    <ul>\n      <li>Aldi's Ambiano Cotton Candy Maker has been recalled for a potential fire hazard.</li>\n      <li>The appliance was sold in red and teal between August and September 2024.</li>\n      <li>Nearly 22,000 units were sold, and so far, 12 incidents of sparking or fire have been reported.</li>\n    </ul>\n    <p>Stop prepping for that upcoming birthday party—a usually fun countertop appliance sold at <a href=\"https://www.delish.com/food-news/g62719630/aldi-shopping-tips-tricks/\">Aldi</a> has been <a href=\"https://www.cpsc.gov/Recalls/2025/Wuensche-USA-Recalls-Ambiano-Cotton-Candy-Makers-Due-to-Fire-Hazard-Sold-at-ALDI\">recalled</a> over fire hazard concerns. The Ambiano Cotton Candy Maker, the hit of any <a href=\"https://www.delish.com/entertaining/\">good party</a>, has a faulty heating element that can cause sugar to ignite when the included sugar receptacle is not used, creating a serious fire hazard.  </p>\n    <p>Although no injuries have been reported, there have been 12 reports of sparking or fire to date. The <a href=\"https://www.delish.com/kitchen-tools/cookware-reviews/g2500/kitchen-tools-gadgets/\">appliance</a> was sold in red and teal with a clear plastic cover. Nearly 22,000 units were sold at Aldi stores nationwide between August 2024 and September 2024. The affected products are marked with model number 836098 and date code 08/2024.  </p>\n    <p>The recall instructs consumers to stop using the <a href=\"https://www.delish.com/food-news/a64665215/mcdonalds-cotton-candy-sprite-hack/\">cotton candy</a> makers immediately. Customers with the affected product can return it to any Aldi store for a full refund or contact the manufacturer, Wuensche USA, via email at service@801service.net, providing a photo of the unplugged appliance along with its model number and date code visible. </p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/food-news/a67965755/aldi-ambiano-cotton-candy-maker-recall-fire-hazard/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]