[
  {
    "slug": "5-war-movies-that-paved-the-way-for-civil-war",
    "title": "5 War Movies That Paved the Way for ‘Civil War’",
    "category": "Entertainment",
    "subcategory": "General",
    "category_slug": "entertainment/general",
    "date": "2024-04-16",
    "excerpt": "The combat sequences in “Paths of Glory” are nowhere close to the point of Stanley Kubrick’s blistering condemnation of the men who send other men to war. But the rest of the film wouldn’t work without the doomed assault that Kirk Douglas’ battalion makes on a very well fortif…",
    "cover": "https://www.indiewire.com/wp-content/uploads/2024/1600/MCDCIWA_EC019.jpg?w=1600",
    "source": "https://www.indiewire.com/gallery/civil-war-action-sequences-war-movies/",
    "source_domain": "indiewire.com",
    "source_name": "Indiewire",
    "author": "Sarah Shachat",
    "rights": "Unknown",
    "body": "\n  \n    <h2>‘Paths of Glory’ (1957)</h2>\n    <graphic src=\"https://www.indiewire.com/wp-content/uploads/2024/04/MBDPAOF_EC029.jpg?w=300\" alt=\"PATHS OF GLORY, Kirk Douglas, 1957\"/>\n    <p>The combat sequences in “Paths of Glory” are nowhere close to the point of Stanley Kubrick’s blistering condemnation of the men who send other men to war. But the rest of the film wouldn’t work without the doomed assault that Kirk Douglas’ battalion makes on a very well fortified German position, less for the advancement of the French trench line and more for the advancement of their commanding general. Kubrick’s clinical eye doesn’t need to show the extent of the battlefield or give us a bird’s eye view of the destruction. Long tracking shots make the simple sets feel endless, and his artful use of shadows does the same amount of work, creating a sense of fear as adroitly as the expression on the actors’ faces. Equally powerful are the dark lulls in the trenches, where shafts of light promise the soldiers that they aren’t safe from violence, just standing on the edge of it. It’s a feeling the photographers in “Civil War” come to know well. Every anti-war film aspires to be as simple, and as brutal, as “Paths of Glory.”</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.indiewire.com/gallery/civil-war-action-sequences-war-movies/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]