[
  {
    "slug": "where-to-watch-the-team-behind-challengers-next",
    "title": "Where to Watch the Team Behind ‘Challengers’ Next",
    "category": "Entertainment",
    "subcategory": "General",
    "category_slug": "entertainment/general",
    "date": "2024-05-14",
    "excerpt": "Josh O’Connor is already continuing his “Challengers” collaboration with director Luca Guadagnino. The actor is confirmed to star in Guadagnino’s upcoming adaptation of novel “Separate Rooms.” O’Connor will play Leo, an Italian writer who is mourning the death of his musician …",
    "cover": "https://www.indiewire.com/wp-content/uploads/2024/1600/MCDCHAL_MG011_368d8e.jpg?w=1600",
    "source": "https://www.indiewire.com/gallery/challengers-cast-upcoming-roles/",
    "source_domain": "indiewire.com",
    "source_name": "Indiewire",
    "author": "Samantha Bergeson",
    "rights": "Unknown",
    "body": "\n  \n    <h2>Josh O’Connor</h2>\n    <graphic src=\"https://www.indiewire.com/wp-content/uploads/2024/05/Josh-OConnor-getty-H-2023.webp?w=300\"/>\n    <p>Josh O’Connor is already continuing his “Challengers” collaboration with director Luca Guadagnino. The actor is <a href=\"https://www.indiewire.com/news/breaking-news/luca-guadagnino-reunite-josh-oconnor-separate-rooms-1234967881/\">confirmed</a> to star in Guadagnino’s upcoming adaptation of novel “Separate Rooms.” O’Connor will play Leo, an Italian writer who is mourning the death of his musician boyfriend Thomas after a three year affair. The film includes another male-male-female love triangle, with Léa Seydoux co-starring. “Separate Rooms” is being written by Guadangino’s “We Are Who We Are” collaborator Francesca Manieri.</p>\n    <p>O’Connor recently starred in fellow Italy-set feature “La Chimera” which was released earlier in 2024. O’Connor further has a <a href=\"https://www.indiewire.com/news/trailers/lee-teaser-kate-winslet-wwii-photographer-lee-miller-1234997842/\">supporting role alongside Kate Winslet in biopic “Lee”</a> set during WWII. </p>\n    <p>He is currently in production on yet another queer drama period piece adaptation, “History of Sound,” alongside Paul Mescal. The film, helmed by Oliver Hermanus, is based on the short story of the same name and centers on two men who fall in love while traveling to record the sounds of WWI soldiers.</p>\n    <p>O’Connor will additionally lead Cannes award-winning filmmaker Karim Aïnouz’s second English-language feature “Rosebushpruning,” with Kristen Stewart and Elle Fanning.</p>\n    <p>Oh, also O’Connor is open to those “Ratatouille” memes and called playing a <a href=\"https://www.indiewire.com/news/general-news/josh-oconnor-wants-to-play-darker-version-willy-wonka-1234978784/\">“darker version” of Willy Wonka his “dream role.”</a></p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.indiewire.com/gallery/challengers-cast-upcoming-roles/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]