[
  {
    "slug": "bbc-news-app",
    "title": "BBC News app",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The BBC News app is available for Android and iOS devices",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2cf6/live/d1e71250-9509-11ee-8df3-1d2983d8814f.png",
    "source": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>The BBC News app keeps you informed with live and breaking news you can trust</h1>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg\" alt=\"BBC News app\"/>\n    <p>The BBC News app is available for Android and iOS devices</p>\n    <p>\n      <strong>With the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.</strong>\n    </p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" alt=\"presentational grey line\"/>\n    <p><a href=\"https://bbcnews.onelink.me/eB56/6mc9icpm\">Click here, external</a> to download the BBC News app from the App Store for iPhone, iPad and iPod Touch.</p>\n    <p><a href=\"https://bbcnews.onelink.me/eB56/ser4scwo\">Click here, external</a> to download the BBC News app from Google Play for Android devices.</p>\n    <p>If you're outside the UK, you can download the BBC app <a href=\"https://bbc-global.onelink.me/Ezi6/2weoqgsp\">here, external</a>.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" alt=\"presentational grey line\"/>\n    <p>Features include:</p>\n    <ul>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">News, features and analysis</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Read top stories and breaking news</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Watch live and developing news coverage</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Get news and weather local to you</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Follow news that's important to you</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Get alerts for top stories</p>\n      </li>\n    </ul>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" alt=\"Presentational white space\"/>\n    <p>We would like to know what you think of the new app - <a href=\"https://www.bbc.co.uk/send/u88080479\">click here</a> to give us your feedback.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" alt=\"Presentational white space\"/>\n    <p>\n      <i>Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.</i>\n    </p>\n    <p>\n      <i>If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.</i>\n    </p>\n    <p>\n      <i>The BBC does not charge you to access mobile content.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-aristocrat-the-convict-and-the-missing-baby",
    "title": "The Aristocrat, the Convict and the Missing Baby",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Next",
    "cover": "https://ichef.bbci.co.uk/images/ic/240x135/p0lk7kzh.jpg",
    "source": "https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body><h1>The Big Cases - The Aristocrat, the Convict and the Missing Baby</h1><ul><li>Episodes</li></ul><h2>Episodes Episodes</h2><ul><li>The Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 mins</li><li>This episodeThe Aristocrat, the Convict and the Missing Baby</li><li>The Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 mins</li><li>The Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 mins</li><li>Neighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 mins</li><li>The Mistaken Identity MurdersThe shocking story of two innocent teenagers murdered in a case of mistaken identity.30 mins</li><li>Killed By Kids: The Machete MurderWhen kids kill. The shocking story of two 12 year olds, a machete and a brutal murder.26 mins</li><li>My Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 mins</li><li>Tortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 mins</li><li>Stabbed After SchoolThe shocking story of how a teenage relationship ended in murder.28 mins</li><li>Crushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 mins</li><li>The House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 mins</li><li>Killer In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 mins</li><li>The Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 mins</li><li>The Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.25 mins</li><li>The Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 mins</li><li>Held Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 mins</li><li>Killed In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 mins</li><li>The Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 mins</li><li>The Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 mins</li><li>Killed By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 mins</li><li>The Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 mins</li><li>The Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 mins</li><li>Deadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 mins</li><li>Unmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 mins</li><li>Killed on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 mins</li><li>The Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 mins</li><li>Killed on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 mins</li><li>The Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins</li><li>30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 mins</li><li>Caught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 mins</li><li>The Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 mins</li><li>Homegrown TerroristCould the Manchester Arena bombing have been stopped?24 mins</li><li>Twenty Minutes Of TerrorA gunman kills five people within minutes. Could the shootings have been prevented?20 mins</li><li>Found Under the FloorThe story of Bennylyn and Jellica who were murdered after starting a new life in the UK.23 mins</li><li>Groomed, Radicalised, GoneThe schoolgirl charged with terrorism, but found to have been exploited.14 mins</li></ul><h2>Pagination controls</h2>Previous<ul><li>1Page 1 of 2</li><li><a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954/the-big-cases-the-aristocrat-the-convict-and-the-missing-baby?seriesId=unsliced&amp;page=2\">2Page 2 of 2</a></li></ul><p><a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954/the-big-cases-the-aristocrat-the-convict-and-the-missing-baby?seriesId=unsliced&amp;page=2\">Next</a></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "epstein-victim-s-family-speaks-out-over-mandelson",
    "title": "Epstein Victim's Family Speaks Out Over Mandelson",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Epstein Victim's Family Speaks Out Over Mandelson",
    "cover": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "source": "https://www.bbc.co.uk/sounds/play/p0m2sd9g?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Newscast - Epstein Victim's Family Speaks Out Over Mandelson - BBC Sounds</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg\"/>\n    <h1>Newscast - Epstein Victim's Family Speaks Out Over Mandelson - BBC Sounds</h1>\n    <p>Epstein Victim's Family Speaks Out Over Mandelson</p>\n    <p>Virginia Giuffre's family says Mandelson should never have been appointed US ambassador.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/sounds/play/p0m2sd9g?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "stats-behind-england-s-31-match-record-winning-run",
    "title": "Stats behind England's 31-match record winning run",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "England dominate Scotland to set up semi-final with France",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9067/live/e2862420-9192-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/sport/rugby-union/articles/c89dyplee5wo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Stats behind England's 31-match record winning run</h1>\n    <p>England dominate Scotland to set up semi-final with France</p>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>England surpassed their own record winning streak across both men's and women's international rugby union by defeating Scotland 40-8 in their Women's Rugby World Cup quarter-final in Bristol.</strong>\n    </p>\n    <p>In 2022, the Red Roses became the first team in history to win 25 Tests in a row by beating Wales in a World Cup warm-up game at Ashton Gate and that record was extended by five more victories - until it ended with a <a href=\"https://www.bbc.com/sport/rugby-union/63605799\">defeat by New Zealand</a> at the World Cup final later that year.</p>\n    <p>Since that dramatic loss, England have not lost a Test and they broke new ground with a 31st consecutive win on Sunday.</p>\n    <p>If they are to lift the World Cup on 27 September at Twickenham, then the record will be extended to 33.</p>\n    <p>Here are the stats behind their incredible winning run.</p>\n    <p>Prior to losing the most recent World Cup final in Auckland, the Red Roses' previous defeat had come against the Black Ferns in 2019.</p>\n    <p>Not since a Women's Six Nations defeat by France in 2018 have England lost to a team other than the reigning world champions.</p>\n    <p>It has been 1,038 days (as of 15 September) since England have lost a game.</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published22 hours ago</li>\n        </ul>\n      </li>\n      <li>\n        <ul>\n          <li>Published21 hours ago</li>\n        </ul>\n      </li>\n    </ul>\n    <p>The current 31-game winning run started under former head coach Simon Middleton, who, after the World Cup final defeat in 2022, led the Red Roses to a Women's Six Nations Grand Slam in 2023.</p>\n    <p>Since taking charge midway through the 2023 WXV1 campaign, John Mitchell has won 26 games as head coach, winning back-to-back WXV1 titles and successive Six Nations Grand Slams.</p>\n    <p>Mitchell remains undefeated as England head coach and is yet to lose a game in charge.</p>\n    <p>Mitchell chose to change the team's captain in January, with Zoe Aldcroft taking over from Marlie Packer, who had spent two seasons leading England.</p>\n    <p>Number eight Alex Matthews has also captained the side twice, most recently in England's final pool game of the World Cup against Australia in Brighton.</p>\n    <p>Former captain Sarah Hunter, who captained the Red Roses to the World Cup final in 2022, is now the side's defence coach.</p>\n    <h2>Biggest score and narrowest defeat</h2>\n    <p>England score 14 tries in record World Cup win over Samoa</p>\n    <p>The Red Roses' <a href=\"https://www.bbc.com/sport/rugby-union/articles/cqjynzvq0j0o\">record 92-3 Women's Rugby World Cup win</a> over Samoa is currently the biggest victory during the winning run.</p>\n    <p>In terms of the winning run nearly ending, England held off a late France fightback in this year's Six Nations Grand Slam finale to <a href=\"https://www.bbc.com/sport/rugby-union/articles/c89g522dw72o\">win 43-42.</a></p>\n    <p>Les Bleues also lost by <a href=\"https://www.bbc.com/sport/rugby-union/65434340\">five points</a> in front of a record women's crowd of 58,498 at Twickenham in 2023.</p>\n    <p>World Cup contenders Canada lost by <a href=\"https://www.bbc.com/sport/rugby-union/articles/ce3zel504n3o\">nine points</a> at last year's WXV1 in Vancouver, conceding a try in the final play, while world champions New Zealand were defeated by <a href=\"https://www.bbc.com/sport/rugby-union/articles/c17g7j9rr2vo\">12 points</a> at Twickenham last September.</p>\n    <p>Up next for England are France in Saturday's World Cup semi-final in Bristol.</p>\n    <p>England survive France comeback to win Grand Slam by a single point</p>\n    <h2>So why no World Cup?</h2>\n    <p>Despite the dominance, England most recently <a href=\"https://www.bbc.com/sport/rugby-union/28829205\">won the World Cup in 2014</a> when they defeated Canada in the final.</p>\n    <p>The Red Roses have lost five of the past six finals, with all those losses coming against New Zealand.</p>\n    <p>Will they finally add a third Women's World Cup to go alongside their impressive winning record?</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/rugby-union/articles/c89dyplee5wo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "who-will-win-champions-league-bbc-sport-experts-make-predictions",
    "title": "Who will win Champions League? BBC Sport experts make predictions",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The Champions League is back, but who will get their hands on the famous old trophy this season?",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca3c/live/48ac1f00-923f-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/sport/football/articles/c1kwmjxwpkxo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<ul>\n      <li>Published</li>\n    </ul>\n<p>\n      <strong>The Champions League is back, but who will get their hands on the famous old trophy this season?</strong>\n    </p>\n<p>Holders Paris St-Germain are one of 36 teams who begin the league phase this week, including six English sides - a record number for any country in the competition.</p>\n<p>Starting on Tuesday, there are a total of 189 games to be played, including the final at Budapest's Puskas Arena next May.</p>\n<p>We have asked some of BBC Sport's expert pundits, commentators and journalists who they think will lift the trophy in Hungary, as well as who will go furthest out of Arsenal, Chelsea, Liverpool, Manchester City, Newcastle United and Tottenham Hotspur.</p>\n<p>They have also picked their surprise package, and the player they are most looking forward to watching.</p>\n<p>And you can vote for who you think will be the winners below.</p>\n<p>Don't forget the BBC will again show highlights of the Champions League this season.</p>\n<p>From 22:00 BST on the Wednesday of Champions League weeks, there will be match-by-match highlights available on BBC iPlayer and the BBC Sport website and app, plus a special Champions League Match of the Day on BBC One at 22:40.</p>\n<p>This week there will also be be a highlights show on Thursday on BBC Two at 23:00.</p>\n<h2>Who will win the Champions League?</h2>\n<p>This is the 71st edition of Europe's elite club competition and the 34th since it was renamed the Champions League in 1992. Paris St-Germain won last season's tournament - the first to be held using a new expanded format with a 36-team league phase</p>\n<p><strong>BBC's chief football writer Phil McNulty:</strong> My pick to win it are <strong>Liverpool,</strong> purely on the basis of the huge strengthening they have carried out this summer. Florian Wirtz and Alexander Isak are two high-class players who are Champions League-ready.</p>\n<p>The vagaries of the new league system last season saw Liverpool meet eventual winners PSG in the last 16, where they lost on penalties at Anfield.</p>\n<p>If Liverpool reach the knockout phase, which they surely will, then the Anfield factor grows with every game.</p>\n<p>PSG will be the big danger once again, a superb side who deserve the status as the best team in Europe, while Real Madrid come into every Champions League conversation as potential winners.</p>\n<p><strong>BBC's senior football correspondent Sami Mokbel:</strong> I'm going for <strong>Liverpool.</strong> Four wins from four in the Premier League and they haven't even nearly hit top gear yet. Oh, and Isak is waiting in the wings. Arne Slot's side are the team to beat.</p>\n<p><strong>Former Germany midfielder Thomas Hitzlsperger:</strong> Real are usually the club with the strongest mentality in this competition, but PSG have to be one of the favourites and Liverpool are too, given that they had such a good Premier League season then invested so much in their squad.</p>\n<p>Those two teams come immediately to mind when I think about who will play in the final, and if I have to pick one to win it then I will go with <strong>Liverpool.</strong> Their squad depth is excellent, the quality was already there and now they have got Isak up front as well.</p>\n<p><strong>BBC Radio 5 Live football correspondent John Murray:</strong> When a team wins Europe's richest league at a comparative canter then spends the best part of half a billion pounds on new players, while at the same time securing the services of two of the club's greatest servants, it's difficult to tip anyone other than <strong>Liverpool.</strong></p>\n<p>Last season they lost out only narrowly to the eventual winners in a penalty shootout. It would be a tremendous prospect if this season Liverpool and PSG were to make it all the way to the final in Budapest.</p>\n<p><strong>Match of the Day commentator Steve Wilson:</strong> Tipping <strong>Real Madrid</strong> to win the Champions League is hardly the work of a soothsayer, but you are not likely to be far wrong. I thought Xabi Alonso did some interesting things with his squad in the Club World Cup - and getting Arda Guler more involved can only be a good thing. </p>\n<p>His progress was held back by the affection everyone at the Bernabeu had for Luka Modric, now he has licence to really spread his wings.</p>\n<p><strong>The Observer football correspondent Rory Smith:</strong> It's been a frankly unacceptable one season since <strong>Real Madrid</strong> won the trophy the club sees as its birthright, and Alonso's main task as manager is to put that right. Real are never the most coherent team in Europe, but they have more individual talent than anyone, and often that is what matters.</p>\n<p><strong>Former England captain Steph Houghton:</strong> I am backing <strong>PSG</strong> to win it again. They are a young squad that has experienced winning already, plus they are athletic and forward thinking.</p>\n<p><strong>Former Scotland winger Pat Nevin:</strong> For a change, I went with my head over my heart. I love <strong>PSG</strong> and the way they play, and the way they have changed the way football is being played now with their attacking attitude. I also love that they love their wingers!</p>\n<p><strong>Spanish football expert Guillem Balague:</strong> I feel <strong>PSG</strong> have started a new era of success that has to do with using cleverly the predominant model of our times - positional football - mixed with quality, clear leadership and top players in each position. </p>\n<p>Barcelona will be close, but I'm not sure they will sort out their defensive deficiencies.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/football/articles/c1kwmjxwpkxo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "where-the-manchester-derby-was-won-and-lost-tactical-analysis",
    "title": "Where the Manchester derby was won and lost - tactical analysis",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Haaland scores twice as Man City cruise to win against Man Utd",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7b70/live/98b7cac0-9231-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/sport/football/articles/ckge4jpy4l5o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>Haaland scores twice as Man City cruise to win against Man Utd</p>\n<ul>\n      <li>Published</li>\n    </ul>\n<p>\n      <strong>It was a Manchester derby to forget for Ruben Amorim's Manchester United, with defeat at the Etihad meaning the Portuguese's Premier League record now reads eight wins from 31 matches.</strong>\n    </p>\n<p>But was <a href=\"https://www.bbc.com/sport/football/live/c62q3y96n38t\">Sunday's 3-0 loss</a> a case of a faulty philosophy, individual mistakes, or an impressive performance from Manchester City?</p>\n<p>Here we analyse the game, focusing on both teams' tactics.</p>\n<h2>How City created a four v two in midfield</h2>\n<p>City focused much of their play down the left-hand side in the first half.</p>\n<p>Blues boss Pep Guardiola aimed to exploit weaknesses in United's defensive approach, with an eye on their back five, two central midfielders and the aggressive manner in which the wider centre-backs are asked to step out to press.</p>\n<p>The hosts' left-back - Nico O'Reilly - took a wider position on the touchline, aiming to draw United right wing-back Noussair Mazraoui towards him.</p>\n<p>Jeremy Doku - City's left winger - would ordinarily have been marked by Mazraoui, but as O'Reilly took the wide position, Doku was more central.</p>\n<p>That gave Mazraoui the difficult task of knowing who to pick up. His decision was to ignore Doku and instead defend the wide spaces - stepping up to press O'Reilly when the ball went to him.</p>\n<p>Doku's inside position ensured City had an overload around United's midfield.</p>\n<p>Rodri, Phil Foden (who had dropped deeper), Doku (who had moved inside) and Tijjani Reijnders formed a box around United's midfield duo.</p>\n<p>It was the same tactic <a href=\"https://www.bbc.com/sport/football/articles/c2djywy3754o\">Fulham used against United</a> earlier this season, when Alex Iwobi vacated his left-wing position to create an overload in midfield.</p>\n<p>O'Reilly stands on the touchline, Doku moves into midfield and City have an overload centrally</p>\n<h2>United's disjointed press</h2>\n<p>With Doku infield, it was Leny Yoro - United's right centre-back - who was tasked with pushing up aggressively on him.</p>\n<p>That is a difficult ask for a natural central defender, especially with Doku dropping as deep as his own half, and it was made more difficult as Foden also occupied those areas.</p>\n<p>Yoro's front-footed defending made the midfield battle a four against three - rather than four against two - at times, but he would often retreat when City's players moved deeper as he did not want to end up too far from his backline.</p>\n<p>By not committing entirely to backing up the press in a man-to-man fashion, United's press was disjointed - meaning City had a free man somewhere.</p>\n<p>United captain Bruno Fernandes touched on this after the match, admitting his team needed to be \"more brave with full pressure\" to prevent the opening goal.</p>\n<p>\"City take that risk against us - we need to do the same,\" he said.</p>\n<p>\"I was trying to press Rodri because the aim of the midfielders was for one to jump on Rodri, with one of the defenders on Foden.</p>\n<p>\"In the first moment, I can cover both but Leny comes up so I go more on Rodri. And Leny was going backwards because of a miscommunication and we end up giving too much space on the pitch.\"</p>\n<p>A team-wide man-to-man press would ensure easy passing options aren't available for the opposition.</p>\n<p>As Fernandes mentions, it was the job of one of the defenders - namely Yoro - to jump on Foden. But the clever positioning of O'Reilly and movement of Doku meant he was left in two minds.</p>\n<p>Foden was able to receive the ball under no pressure and carry it up the pitch - a situation that was replicated later in the game.</p>\n<p>Yoro was tasked with stepping up to press Foden but Doku's movement infield meant he had an extra player to pay attention to</p>\n<h2>City's clever use of pinning</h2>\n<p>City's use of pinning was particularly impressive.</p>\n<p>Pinning is the act of positioning a player in a certain area with the result an opponent also has to stay there.</p>\n<p>If a winger stands on the touchline next to the opposition full-back, for example, the defender is unlikely to leave that area as the attacker would be free. The winger has, therefore, 'pinned' the full-back.</p>\n<p>City used pinning throughout Sunday's game to make United's aggressive defending tactics weaker, and to open up space for their attackers.</p>\n<p>We've already spoken about how O'Reilly pinned Mazraoui to the touchline, leaving Doku free to move inside without being followed.</p>\n<p>On the other flank, we saw clever movement from Reijnders on to Luke Shaw that prevented him from leaving the back five. As a result, Doku's unorthodox positioning - having vacated his flank - allowed him to pick up the ball unopposed.</p>\n<p>Amorim asks his wide centre-backs to step out and apply pressure to the extra opposition player if United are outnumbered in midfield, but with Shaw stuck with Reijnders, City had Doku free.</p>\n<p>Given time, Doku was able to turn and drive with the ball and provided the assist for the first goal.</p>\n<p>With Shaw focused on Reijnders, Doku can receive the ball without pressure.</p>\n<h2>United's midfielders fail to track runners</h2>\n<p>For City's first goal, Fernandes and Manuel Ugarte were back in defensive positions, but the hosts were able to pick up the loose ball in the penalty area uncontested.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/football/articles/ckge4jpy4l5o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "cardiff-man-still-in-prison-20-years-after-stealing-phone",
    "title": "Cardiff man still in prison 20 years after stealing phone",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The father of a Cardiff man who has spent 20 years in prison after stealing a mobile phone has said his son has served a \"life sentence\" behind bars.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/38a0/live/a7d4ce20-91f2-11f0-aa72-1754a564291f.jpg",
    "source": "https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>The father of a Cardiff man who has spent 20 years in prison after stealing a mobile phone has said his son has served a \"life sentence\" behind bars.</p>\n<p>Leroy Douglas, 44, was handed a minimum term of two-and-a-half years in 2005 for robbery, but remains in custody as he is subject to an indeterminate sentence of Imprisonment for Public Protection (IPP).</p>\n<p>The controversial measure <a href=\"https://www.bbc.co.uk/news/uk-19630617\">was scrapped in 2012</a>, but campaigners are calling for those currently serving an IPP to be resentenced and have filed a case against the UK before the United Nations.</p>\n<p>The Ministry of Justice said it released the highest annual number of IPP prisoners on record last year with additional support given to those in custody.</p>\n<p>IPPs are a type of sentence which means inmates can be detained indefinitely if the parole board <a href=\"https://commonslibrary.parliament.uk/research-briefings/sn06086/\">decides it is not safe to release them</a>.</p>\n<p>They were designed to detain offenders who posed a \"significant\" risk of causing serious harm to the public, but faced criticism after being handed out for less serious crimes.</p>\n<p>Defendants must serve a minimum term before being considered for release by the parole board but this is not automatic. They are also subject to licence conditions which they must follow or risk being recalled to prison once they are released.</p>\n<p>Anthony Douglas, 63, said his son was a \"normal kid\" growing up who was \"easily led\" to make bad decisions.</p>\n<p>He said Leroy Douglas, who is now in<strong> </strong>HMP Stocken in Stretton, Rutland started to get into trouble along with friends and received convictions for crimes including for shoplifting as a teenager and young man.</p>\n<p>However, he said it \"all escalated\" when the dad-of-two was sentenced for stealing a mobile phone belonging to his cousin's boyfriend in 2005.</p>\n<p>Instead of a fixed term two and a half year custody sentence, he was handed an IPP, which his family said was a \"shock to everyone\".</p>\n<p>\"He got two-and-a-half years and the next thing I know is that he's still in there all these years later,\" Mr Douglas said.</p>\n<p>\"I expected him to do half of the two-and-a-half years and start fresh again.\"</p>\n<p>Mr Douglas has not been able to make the journey to visit his son in person since he was sentenced, but speaks to him regularly on the phone.</p>\n<p>While in custody, Leroy Douglas had to be told of his daughter's death after she suffered a fatal brain haemorrhage aged 20, as well as losing his grandparents and other family members, something which his dad said had affected his mental health.</p>\n<p>According to Mr Douglas he has been moved to different facilities a number of times, which has resulted in him having to repeat training and courses needed for him to be considered for release.</p>\n<p>\"We are not the only ones suffering, the whole family is with him being in prison,\" he said.</p>\n<p>Mr Douglas admitted his son had struggled with poor behaviour while in custody, but said being in a prison environment from a young age had created the \"product that he is today\".</p>\n<p>\"His family is outside, so inside the only role models he's got are those who are already in prison,\" he said.</p>\n<p>\"He started to act out because he doesn't think it's fair that he's been kept in there that long, so that's had an impact on his behaviour.\"</p>\n<p>While Leroy Douglas has suffered with addiction in the past, his dad said he had tested negative for drugs while in prison.</p>\n<p>Andrew Taylor, criminal barrister at Apex Chambers, has represented about 10 clients who were given IPP sentences.</p>\n<p>He described the situation as \"draconian and unfair\".</p>\n<p>\"I've had clients who on the face of it without IPP sentences might have faced fixed term sentences of four or five years which gives them a definite release date,\" he said.</p>\n<p>\"But if you have an IPP it's effectively for life. Many subjected to them get recalled sometimes for the most minor sentences.\"</p>\n<p>Mr Taylor said there needed to be a \"large scale resentencing\" of people who were subject to IPPs.</p>\n<p>While he said not all those subject to them would otherwise have been released immediately, \"there was no longer a need to have people locked up like this\".</p>\n<p>\"These people become hopeless, they have no hope on getting out which can lead to violent behaviour in prisons, and we have a radical shortage of prison spaces,\" he said.</p>\n<p>\"The first aim of prison should be rehabilitation, and IPP sentences go against that.\"</p>\n<p>Figures from June show there are about 2,500 prisoners who have either never been released or have been recalled to prison under the IPP scheme.</p>\n<p>On Thursday campaigners from Wales, including Shirley Debono whose son Shaun Lloyd was <a href=\"https://www.bbc.co.uk/news/articles/c1e5154j4z0o\">handed an IPP sentence aged 18</a>, went to Downing Street to hand over a letter calling for the sentences to be abolished retrospectively, and for those still affected to be resentenced.</p>\n<p>The group have also filed a case against the UK government before the UN Working Group on Arbitrary Detention.</p>\n<p>In the letter, the campaigners urged the government to \"do the right thing by ending one of the greatest miscarriages of justice and restore hope and justice to thousands of IPP prisoners and their families\".</p>\n<p>The added children had \"grown up separated from their parents, not knowing when or if they will ever see them again\".</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-and-us-unveil-nuclear-energy-deal-ahead-of-trump-visit",
    "title": "UK and US unveil nuclear energy deal ahead of Trump visit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg",
    "source": "https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>UK and US unveil nuclear energy deal ahead of Trump visit</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg.webp\" alt=\"Getty Images An engineer with a fuel rod handling machine in a nuclear power station\"/>\n    <p>The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.</p>\n    <p>The agreement aims to generate thousands of jobs and strengthen Britain's energy security.</p>\n    <p>It is expected to be signed off during US President Donald Trump's state visit this week, with both sides hoping it will unlock billions in private investment.</p>\n    <p>However, the designs behind some of the deals are relatively new and it could take many years before the nuclear projects generate energy for homes and businesses.</p>\n    <p>The key focus of the so-called Atlantic Partnership for Advanced Nuclear Energy is to make it quicker for companies to build new nuclear power stations in both the UK and the US.</p>\n    <p>The hope is to halve the time it takes to gain regulatory approval for nuclear projects from up to four years to two.</p>\n    <p>In practice, it means that if a reactor has already passed safety checks in one country, that work can be used to support the work of the other.</p>\n    <p>The UK's nuclear programme already includes plans for small modular reactors (SMRs), which are a scaled-down version of larger plants. Britain's engineering firm Rolls Royce has been selected to design and build the first in the country.</p>\n    <p>One of the commercial deals set to be signed this week is with US nuclear group X-Energy and the UK's Centrica, which owns British Gas, to build up to 12 advanced modular reactors (AMRs) in Hartlepool.</p>\n    <p>Unlike SMRs, which are water-cooled nuclear reactors, advanced modular reactors use gases such as helium as a coolant.</p>\n    <p>There are very few AMRs in the world operating on a commercial basis such as China's HTR-PM reactor.</p>\n    <p>X-Energy wants to build one in the US but, after announcing a partnership with US chemicals and plastics giant Dow in 2021, it has taken until March this year to submit a construction permit application to the Nuclear Regulatory Commission for the project in Texas.</p>\n    <p>X-Energy has said it hopes the reactor at a Dow site could be a blueprint for others and \"manufacturers worldwide could replicate this model\".</p>\n    <p>The government said the Hartlepool deal has the potential to power 1.5 million homes and create up to 2,500 jobs.</p>\n    <p>Energy Secretary Ed Miliband said: \"Nuclear will power our homes with clean, homegrown energy and the private sector is building it in Britain, delivering growth and well-paid, skilled jobs for working people.\"</p>\n    <p>But Greenpeace questioned the UK's focus on nuclear power.</p>\n    <p>\"If these proposals for new reactors scattered around Britain really materialise, the net effect will be higher bills from nuclear's relentlessly spiralling costs, and more CO2 as we wait for the builders to overcome their inevitable construction delays,\" said Dr Douglas Parr, chief scientist for Greenpeace UK.</p>\n    <p>The cost of building large nuclear plants in the UK, such as Sizewell C in Suffolk, has jumped to £38bn from a previous estimate of £20bn. Centrica is one of the key investors in Sizewell C.</p>\n    <p>SMRs work on the same principle as large reactors, using a nuclear reaction to generate heat that produces electricity, but have around a third of the generating output.</p>\n    <p>The modular element means they could be built to order in factories - as a kit of parts - then transported and fitted together, like a flat-packed power station.</p>\n    <p>However, the SMR industry is still young, and many different designs are being investigated.</p>\n    <p>Centrica's chief executive Chris O'Shea told the BBC's Today programme that increased costs and delays \"can happen in all large projects\".</p>\n    <p>But he said: \"What you need to do is you need to do more than just one every 20 years in order to get better. So, the more you practice, the better you get which is why small and advanced modular reactors are particularly interesting because they'll be repetitive so you'll produce the same thing over and over again.</p>\n    <p>\"That should bring improvements both in terms of cost and schedule and reliability and cost as well.\"</p>\n    <p>Prime Minister Sir Keir Starmer has previously said he wants the UK to return <a href=\"https://www.bbc.co.uk/news/articles/c805mjxe2y9o\">to being \"one of the world leaders on nuclear\"</a>.</p>\n    <p>In the 1990s, nuclear power generated about 25% of the UK's electricity but that figure has fallen to around 15%, with no new power stations built since then and many of the country's ageing reactors due to be decommissioned over the next decade.</p>\n    <p>In November 2024, the UK and 30 other countries signed a global pledge to triple their nuclear capacity by 2050.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "charges-dropped-against-two-men-accused-of-spying-for-china",
    "title": "Charges dropped against two men accused of spying for China",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Charges dropped against two men accused of spying for China</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"AFP/GETTY Split picture showing the faces of Christopher Cash and Christopher Berry.\"/>\n    <p>Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.</p>\n    <p>Christopher Cash, 30, and Christopher Berry, 33, had previously denied the charges under the Official Secrets Act. Beijing has called the allegations \"malicious slander\".</p>\n    <p>The two men were accused of gathering and providing information prejudicial to the safety and interests of the state between 28 December 2021 and 3 February 2023.</p>\n    <p>Speaking outside the Old Bailey following the decision to cease legal proceedings on Monday, Mr Cash said he was \"relieved that justice has been served\".</p>\n    <p>He described the two years since his arrest as a \"nightmare\" and said he hoped \"lessons are learned from this sorry episode\".</p>\n    <p>Prosecutor Tom Little told the the court that his team would offer no evidence against the men and that \"we simply cannot continue to prosecute this case\".</p>\n    <p>The court heard that the Crown Prosecution Service had determined the evidence it had gathered did not meet the threshold to go to trial.<strong> </strong>The pair were due to appear at Woolwich Crown Court from 6 October.</p>\n    <p>The Home Office said it was \"disappointing that they will not face trial given the seriousness of the allegations\".</p>\n    <p>\"We will continue to use the full range of tools and powers to guard against malign activity,\" it added in a statement.</p>\n    <p>Mr Berry, a teacher from Witney in Oxfordshire, and Mr Cash, of Whitechapel in London, were arrested in March 2023 as part of an investigation that involved counter-terror police.</p>\n    <p>They were accused of collecting information which was \"calculated to be, might be, or were intended to be, directly or indirectly, useful to an enemy\".</p>\n    <p>It had been reported that Mr Cash was involved with Parliament's China Research Group (CRG).</p>\n    <p>He was understood to have had access to several Conservative MPs, reportedly including former security minister Tom Tugendhat and then-foreign affairs committee chairwoman Alicia Kearns.</p>\n    <p>Defending Mr Cash, Henry Blaxland KC said his client's colleagues at the CRG had \"expressed disbelief\" at his arrest.</p>\n    <p>\"We only hope that he will be able to rebuild his life,\" he added.</p>\n    <p>Mrs Justice Cheema-Grubb said she was \"quite satisfied\" and entered the two men into not guilty verdicts.</p>\n    <p>When they were charged, a Chinese embassy spokesperson said \"the claim that China is suspected of 'stealing British intelligence' is completely fabricated\".</p>\n    <p>They urged the UK \"to stop anti-China political manipulation and stop putting on such a self-staged political farce\".</p>\n    <p>The government has previously said Chinese spies were targeting UK officials across the political, defence and business sectors as part of an increasingly sophisticated espionage operation.</p>\n    <p>In December, senior judges <a href=\"https://www.bbc.co.uk/news/articles/cp9n4211zn3o\">upheld a decision</a> by MI5 to warn that an alleged Chinese agent, Christine Lee, had infiltrated Parliament and funded a Labour MP, among others.</p>\n    <p>The same month, Yang Tengbo was named as a Chinese businessman who had been banned from the UK for allegedly spying.</p>\n    <p>Both Ms Lee and Mr Yang have denied the accusations made against them.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "fourteen-nhs-trusts-maternity-care-to-be-investigated-over-failures",
    "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d206/live/2b7512f0-9205-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.</p>\n<p>The inquiries are part of a rapid review of maternity care in England that was announced in June.</p>\n<p>Health Secretary Wes Streeting said bereaved families had shown \"extraordinary courage\" in coming forward with issues dating back more than 15 years.</p>\n<p>Some of the families have severely criticised the review and Streeting's handling of it, describing the investigation as \"not fit for purpose\".</p>\n<p>The NHS trusts that will be examined are:</p>\n<ul>\n      <li>Blackpool Teaching Hospitals</li>\n      <li>Bradford Teaching Hospitals</li>\n      <li>University Hospitals of Leicester</li>\n      <li>Leeds Teaching Hospitals</li>\n      <li>Sandwell and West Birmingham</li>\n      <li>Gloucestershire Hospitals</li>\n      <li>Yeovil District Hospital</li>\n      <li>Oxford University Hospital</li>\n      <li>University Hospitals Sussex</li>\n      <li>Barking, Havering and Redbridge University Hospitals</li>\n      <li>Queen Elizabeth, Kings Lynn</li>\n      <li>University Hospitals of Morecambe Bay</li>\n      <li>East Kent Hospitals</li>\n      <li>Shrewsbury and Telford Hospital</li>\n    </ul>\n<p>Baroness Amos, who will chair the review, said she was committed to ensuring families affected by maternity care failures were heard and that the 14 investigations would lead to improvements nationwide.</p>\n<p>She told BBC Radio 4's Today programme that she hoped the review would help families \"get the justice that they want and that they deserve\".</p>\n<p>She added that the current situation - in which trusts had been investigated already and \"hundreds\" of recommendations made, yet fresh reviews were required - was \"completely unacceptable\".</p>\n<p>Improved maternity care may have prevented the deaths of over 800 babies lives in 2022-23, according to research by the baby loss charities Sands and Tommy's.</p>\n<p>Streeting opted for the rapid review instead of a national inquiry into maternity care, which many families have been calling for.</p>\n<p>The review was due to be completed by December, but will now not report until Spring 2026. Baroness Amos says she will aim to produce interim findings around Christmas.</p>\n<p>The review will examine the experience of families and staff within England's struggling maternity services and investigate why the recommendations from previous maternity inquiries in Morecambe Bay, East Kent, and Shrewsbury and Telford have not led to sustained improvements.</p>\n<p>Past inquiries have revealed issues including ignoring women's voices, poor leadership, a failure to learn from safety incidents and a toxic culture. Yet families are still repeatedly reporting substandard care.</p>\n<p>There will also be \"particular attention\" paid to examining why black and Asian families have noticeably poorer outcomes, Baroness Amos said.</p>\n<p>The Department of Health said the trusts had been chosen based on data analysis and the views of families, as well as to ensure a geographical and demographic mix.</p>\n<p>The Royal College of Obstetricians and Gynaecologists said the focus on these trusts would \"create real anxiety among women, families and staff\" at the 14 trusts.</p>\n<p>It added that the review would need to re-build a world class maternity system.</p>\n<p>\"Too many women and babies are not getting the safe, compassionate care they deserve and the maternity workforce is on its knees, with staff leaving the profession,\" said the college's president, Prof Ranee Thakar.</p>\n<p>The strongest criticism of the review, however, comes from the Maternity Safety Alliance (MSA) - a group of families harmed by poor maternity care in several NHS trusts across England.</p>\n<p>Having engaged in a number of meetings with the Department of Health in recent weeks, they said Streeting had \"broken promises\" over how the investigation would be run and what it would examine, and that they had been left feeling \"used\".</p>\n<p>They are particularly critical of the decision not to investigate the role of NHS regulators, such as the Care Quality Commission and NHS Resolution, the health service's insurance and litigation arm.</p>\n<p>\"The review seems to have already decided that all the responsibility for these 800 deaths a year lies squarely with NHS trusts and the clinicians who work in them,\" said Tom Hender, who lost his son Aubrey in 2022.</p>\n<p>\"That's just not true - the whole system is in crisis and we need a whole system approach.\"</p>\n<p>The MSA said the investigation was \"not fit for purpose\" and will not achieve what Streeting said it would, adding: \"It is clear that only a statutory public inquiry can end the crisis in maternity care.\"</p>\n<p>Baroness Amos said the terms of the review were extensive given its time frame and that regulatory bodies were \"not excluded\", but added: \"The kind of in-depth review that is being requested is not something that I am able to conduct.\"</p>\n<p>The two families who successfully campaigned for an investigation into maternity care in Shrewsbury and Telford are more positive about the review, describing it as \"an important and brave first step\".</p>\n<p>But the parents of Kate Stanton-Davies and Pippa Griffiths also said it would be \"safer\" if the review proceeded at a slower pace, adding that proper mental health support had to be provided to those families sharing their experiences.</p>\n<p>\"It's not enough to have a nominal support figure in the room and an email address for follow-up,\" they said in a statement.</p>\n<p>The ongoing challenges facing maternity services were highlighted last week.</p>\n<p>On Monday, a review of care at Gloucestershire Hospitals NHS trust found that the deaths of <a href=\"https://www.bbc.co.uk/news/articles/c3rvqd7v52ro\">nine babies</a> between 2020 and 2023 could have been prevented.  </p>\n<p>Then on Friday, a report found that NHS trusts rated over half their maternity and neonatal buildings as being unsatisfactory, with 7% saying they ran a serious risk of imminent breakdown.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "killer-child-car-seats-still-on-sale-10-years-on",
    "title": "'Killer' child car seats still on sale 10 years on",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>'Killer' child car seats still on sale 10 years on</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"BBC Two unidentifiable people holding a child's car seat each. One on the left is orange and the other is blue. The seats are made of thin padded fabric without structure.\"/>\n    <p>Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.</p>\n    <p>Which? warned in 2014 the fabric seats were potentially dangerous to children due to safety defects and were illegal to use in the UK following tests by Surrey Trading Standards, which dubbed the products \"killers\".</p>\n    <p>Which? is urging parents not to be tempted into buying cheap seats after it found they are still being sold via online sites including Shein and eBay, both of which said they took safety very seriously.</p>\n    <p>Regulations state only EU-approved child car seats with R44 or R129 codes can be used in the UK.</p>\n    <p>Approved seats carry a clear orange label, on which the codes are printed, to indicate they have been put through EU safety testing and can therefore be legally sold on the UK market.</p>\n    <p>In 2014, Surrey Trading Standards tested a fabric seat which fell to pieces in a 30 mph accident. The crash test dummy of a three-year-old child was flung through the windscreen when the straps securing the seat failed.</p>\n    <p>Which? said families struggling with living costs could be tempted by the cheaper products, which cost as little as £12.50, compared to the more expensive ones that retail in excess of £80.</p>\n    <p>Stuart Howarth, a car seat safety advisor at Good Egg Safety, which campaigns on child safety, told BBC News he had seen a child using an unsafe seat that had \"no support to the body\" and \"no way of securing it to the car safely\".</p>\n    <p>\"It's just a lethal piece of material,\" he said.</p>\n    <p>\"You might as well just sit on a settee cushion and hope for the best.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7529/live/a7c0b5d0-8fc1-11f0-84c8-99de564f0440.jpg.webp\" alt=\"A rectangular orange label on a child's booster seat.\"/>\n    <p>Which? said it found more than a dozen listings of illegal car seats on websites such as eBay, Little Dreams, ManoMano, Shein and Wish.</p>\n    <p>One listing for a child's car seat on eBay warned against using it in cars despite the product being described as suitable.</p>\n    <p>The description in the listing read: \"It is best not to use it on high-speed cars.</p>\n    <p>\"We recommend that it be used in non-motorized products such as electric vehicles, two-wheelers... Because it is not a child safety seat that complies with traffic.\"</p>\n    <p>In response, eBay said consumer safety \"is a top priority\".</p>\n    <p>\"eBay swiftly removed the listings reported by Which? and the BBC and notified buyers,\" a spokesperson said</p>\n    <p>\"We have updated our existing measures accordingly and remain committed to preventing unsafe products from appearing on the site.\"</p>\n    <p>Which? said stricter rules were needed to \"impose a clear and robust duty on online marketplaces to prevent the sale of unsafe products\" and called for \"strong penalties and rigorous enforcement\".</p>\n    <p>Sue Davies, Which? head of consumer protection policy, said: \"It is appalling that these deadly car seats are reappearing on online marketplaces more than a decade after Which? first exposed them, but it is not surprising.\"</p>\n    <p>She said children's lives \"will be at risk\" until online retailers were forced to comply with product safety regulations.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e554/live/1c3d5cb0-8f04-11f0-84c8-99de564f0440.png.webp\" alt=\"Which? A screenshot of an eBay listing for a child's car seat.\"/>\n    <p>Which? advised families to look for retailers who can provide guidance and help fit the seat.</p>\n    <p>It suggested car seats should not be bought secondhand, as they might have been involved in an accident and damage to the seat may be unclear.</p>\n    <p>Janis James, chief executive of Good Egg Safety, urged parents not to \"skimp\" on cash when purchasing car seats for children.</p>\n    <p>In a statement, Shein said it was committed to \"offering safe and reliable products to its customers\".</p>\n    <p>The online retail giant said the product Which? found listed on its website had been \"mislabelled\" by a third-party seller and Shein had \"taken action against the seller\" after removing it from its platform.</p>\n    <p>It said vendors were required to comply with the company's rules and \"stringent safety standards and must also abide by the relevant laws and regulations of the markets where we operate\".</p>\n    <p>Little Dreams also told the BBC product safety was a \"top priority\".</p>\n    <p>ManoMano said its online marketplace was used by third party sellers to sell their own products.</p>\n    <p>It added: \"We rely on our sellers to provide a resolution to any product/fulfilment issues.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "strong-winds-and-rain-sweep-across-uk",
    "title": "Strong winds and rain sweep across UK",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Strong winds and rain sweep across UK</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A windswept-looking woman holds an orange umbrella which has blown inside out with an urban street scene in the background.\"/>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.</strong>\n    </p>\n    <p>A gust of 78mph (125km/h) was recorded at Needles, Isle of Wight, on Sunday night with widespread windy conditions expected to continue until the evening.</p>\n    <p>This is causing some travel disruption including the <a href=\"https://www.bbc.com/news/articles/cpvlr98m39do\">closure of the M48 Severn Bridge</a>.</p>\n    <p>However - contrary to some media reports - this weather system is not a named storm.</p>\n    <h2>Yellow wind warning for England and Wales</h2>\n    <p>The Met Office warning covers all of Wales and most of England - away from the far north - and is valid until 1800 on Monday.</p>\n    <p>Wind gusts of 45-55mph (72-89km/h) will continue to affect many inland areas with gusts of 60-70mph (97-113km/h) likely around exposed coasts and over hills.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1800/cpsprodpb/50e1/live/2bf53b40-920c-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A weather map showing the area covered by a yellow warning - all of Wales and most of England, away from the far north. The warning is valid until 18:00 on Monday.\"/>\n    <p>There is a risk of disruption on the roads and at airports, while <a href=\"https://www.nationalrail.co.uk/service-disruptions/poor-weather-20250911/\">Network Rail, external</a> is warning of possible delays on railways.</p>\n    <p>Large waves are expected around the coasts and some power cuts are possible.</p>\n    <p>The weather is expected to calm down during Monday evening as the strongest winds begin to ease.</p>\n    <p>Heavy rain also features with downpours across many northern and western parts of the UK.</p>\n    <h2>Why is this not a named storm?</h2>\n    <p>Some media reports, as well as posts on social media, are suggesting that this is Storm Amy - the first named storm of the UK season.</p>\n    <p>That is not the case.</p>\n    <p>The Met Office <a href=\"https://www.bbc.com/weather/articles/cwy54xllpyno\">names storms</a> in conjunction with the Irish and Dutch weather services based on how significant the impacts are forecast to be.</p>\n    <p>A storm is typically named if it is expected to be bad enough to warrant an amber or red weather warning, and that looks very unlikely this time.</p>\n    <p>When this area of low pressure first appeared on weather charts several days ago it did seem possible that it could be strong enough to be named.</p>\n    <p>However, as the forecast became firmer it looked less and less likely that there would be significant impacts.</p>\n    <p>Storm Amy is going to keep us waiting a while longer.</p>\n    <h2>Will there be a September storm?</h2>\n    <p>The UK had its <a href=\"https://www.bbc.com/weather/articles/c1kz18d3wjro\">hottest summer on record</a> but there is no doubt that the start of meteorological autumn has brought a big change.</p>\n    <p>The <a href=\"https://www.bbc.com/weather/av/54682820\">jet stream</a> has dropped southwards sending wind and rain-bearing weather systems on a beeline for our shores.</p>\n    <p>That has made it a wet September so far, especially in southern and western parts of the country where some places have already recorded more than their average rainfall for the whole month.</p>\n    <p>However, there is no suggestion that <a href=\"https://www.bbc.com/weather/articles/cyvj2lm2p14o\">hosepipe bans</a> and water restrictions will be lifted yet.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/f230/live/a0b35080-9215-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A row of beach huts with pebbles in front and a large puddle in the foreground, with a blue sky and white clouds overhead\"/>\n    <p>Parts of southern England have already seen one and a half times their typical September rainfall</p>\n    <p>The forecast for this week remains very unsettled.</p>\n    <p>After a calmer Tuesday with sunshine for many, Wednesday is expected to bring heavy rain in many areas.</p>\n    <p>Winds will also strengthen during midweek, particularly in the north of the UK with the chance of gales in northern Scotland by Thursday.</p>\n    <p>There is considerable uncertainty about exactly how this weather system will develop.</p>\n    <p>So while it does not currently look likely that this will be a named storm, it is worth staying in touch with the details on the BBC Weather <a href=\"https://www.bbc.com/weather\">website</a> and <a href=\"https://www.bbc.com/weather/articles/cwy00j3yj4eo\">app</a>.</p>\n    <p>Warmer weather could briefly develop at the end of the week, especially in England and Wales, with possible highs of 24C (75F) in the south-east on Friday.</p>\n    <p>Although northerly winds are expected to develop over the weekend bringing a return of cooler conditions - and probably more rain.</p>\n    <p>Some computer models do suggest a chance of higher pressure and drier weather towards the end of the month but this is by no means certain.</p>\n    <p>As we moved deeper into autumn you can keep an eye on the longer-term weather prospects with our <a href=\"https://www.bbc.com/weather/articles/c1ee0klzvneo\">monthly outlook</a>.</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published24 August</li>\n        </ul>\n        <graphic alt=\"A woman holds an umbrella to shelter from the Sun as she walks down a street. Some people are visible in the background, along with an old-fashioned red telephone box\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 976w\" width=\"3840\" height=\"2160.054657253473\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published5 days ago</li>\n        </ul>\n        <graphic alt=\"Satellite image of the tropical Atlantic showing areas of cloud but no tropical storms or hurricanes\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1536/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 976w\" width=\"1536\" height=\"864\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published5 December 2024</li>\n        </ul>\n        <graphic alt=\"Rows of static caravans standing in flood water\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 976w\" width=\"3840\" height=\"2161.029453817558\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "why-man-utd-s-problem-is-not-the-system-it-s-the-personnel",
    "title": "Why Man Utd's problem is not the system, it's the personnel",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "I feel like I am repeating myself whenever I talk about Manchester United's problems but the same things keep on happening.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9a1a/live/c56784a0-91b1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<ul>\n      <li>Published</li>\n    </ul>\n<p>\n      <strong>I feel like I am repeating myself whenever I talk about Manchester United's problems but the same things keep on happening.</strong>\n    </p>\n<p>They are making the same mistakes, and they are not even that difficult to prevent.</p>\n<p>I have watched every minute of United's four Premier League games this season and there are certainly areas of improvement, which seems a bizarre thing to say after they have just lost a derby 3-0.</p>\n<p>I've highlighted the issues with Ruben Amorim's 3-4-2-1 formation since he took charge at Old Trafford last season, and I am not a fan of that shape, but they have worked on it and you can tell.</p>\n<p>They look more compact as a team now, when they are attacking or defending. They get in quite a good shape and the distances between their lines are much smaller, which makes them harder to play through.</p>\n<p>Unfortunately for Amorim, the improvements they have made there have been overlooked because of the silly mistakes they are making in conceding goals which are costing them points.</p>\n<p>When I look at some of the goals they have conceded this season, including Phil Foden's opener for City at Etihad Stadium on Sunday, they are down to selection issues, and players being used in the wrong position, rather than the system itself.</p>\n<p>Haaland scores twice as Man City cruise to win against Man Utd</p>\n<h2>'A simple run by Foden was all it took'</h2>\n<p>In the first half against City, United did well. They won the ball back four or five times high up the pitch and, with a bit more finesse in those counter-attacks, they could have scored themselves.</p>\n<p>One of the problems with Amorim's 3-4-2-1 is the two holding midfielders can be outnumbered but that did not happen at Etihad Stadium because Bryan Mbeumo and Amad Diallo, who were playing either side of Benjamin Sesko, dropped in.</p>\n<p>The team narrowed up which helped Bruno Fernandes and Manuel Ugarte in midfield, because there were no big gaps.</p>\n<p>Most of the time the defence and the midfield were close to each other too, rather than the defence dropping off like they did last season because of a lack of pace or confidence.</p>\n<p>City did not completely play through them and tear them apart, and that's not how they scored their first goal either.</p>\n<p>What happened there is that you have got Fernandes, arguably one of the best number 10s in the world, playing in a deeper centre-midfield role as a number eight when his instincts are not defensive.</p>\n<p>A simple run off the back from Foden was all it took to lose him.</p>\n<p>Bruno Fernandes was watching Jeremy Doku, not Phil Foden when the Belgian winger reached the byeline</p>\n<p>Yes, you could argue Luke Shaw might have done better when the ball was in the box but Foden is free by that point, because Fernandes switched off.</p>\n<p>As I highlighted on Match of the Day, he is ball-watching when the cross comes over. I don't think he is lazy, because he is back in position.</p>\n<p>He is just not used to spotting runners and seeing danger.</p>\n<p>Doku put over a cross and found the unmarked Foden who was bursting into the box</p>\n<p>That's the second time he has cost United a goal this season, because he also failed to track Emile Smith Rowe for Fulham's equaliser when they dropped points at Craven Cottage in August.</p>\n<p>The irony with Fernandes against City was that certain aspects of his play in the middle of the pitch were extremely good.</p>\n<p>It's not a totally stupid idea to play him there, because his passing from deep is tremendous to find the runners ahead of him, and he is technically excellent as well as being brave on the ball.</p>\n<p>The problem is what happens without it. A player of his intelligence should be able to learn to switch on a bit more in defensive situations too, but it's clearly not happening.</p>\n<p>You just can't play in that role if that's a regular occurrence for you, and it is down to the manager to recognise that and put players in there who do it better.</p>\n<h2>More square pegs in round holes?</h2>\n<p>Man Utd a team with round pegs in square holes - analysis</p>\n<p>Fernandes is not the only United player I look at and think he is a square peg in a round hole.</p>\n<p>Shaw has played in a back three before but he has spent the majority of his career as a dynamic left-back and it feels like he is being shoe-horned into a centre-back position under Amorim.</p>\n<p>Again you can argue he should have the quality to adapt, and for Jeremy Doku to beat him so easily for the first goal was poor defending whether you are a left-back or a centre-half, but if any players are not completely comfortable in their roles, then it is going to affect the team.</p>\n<p>For City's second goal, again it was not down to the United system failing, more a mixture of things - and a multitude of individual mistakes.</p>\n<p>Ugarte starts off on Foden but then follows the ball, like he did in the City move that led to their opener, and goes to press Nico O'Reilly, leaving Foden free.</p>\n<p>From there it's a knock-on effect.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "boss-of-degrading-sex-trade-ring-in-dubai-s-glamour-districts-unmasked",
    "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Warning: Contains disturbing content and graphic descriptions of sexual acts",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c16/live/c327cfd0-919b-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>\n      <i>Warning: Contains disturbing content and graphic descriptions of sexual acts</i>\n    </p>\n<p>\n      <strong>A man running a sex ring operating out of Dubai's most glamorous neighbourhoods, and exploiting vulnerable women, has been identified by a BBC investigation.</strong>\n    </p>\n<p>Charles Mwesigwa, who says he is a former London bus driver, told our undercover reporter he could provide women for a sex party at a starting price of $1,000 (£740), adding that many can do \"pretty much everything\" clients want them to.</p>\n<p>Rumours of wild sex parties in the UAE emirate have circulated for years. The hashtag #Dubaiportapotty, which has been viewed more than 450 million times on TikTok, links to parodies and speculative exposés of women accused of being money-hungry influencers secretly funding their lifestyles by fulfilling the most excessive of sexual requests.</p>\n<p>Our BBC World Service investigation was told the reality is even darker.</p>\n<p>Young Ugandan women told us they had not expected to have to undertake sex work for Mr Mwesigwa. In some cases, they believed they were travelling to the UAE to work in places like supermarkets or hotels.</p>\n<p>At least one of Mr Mwesigwa's clients regularly asks to defecate on the women, according to \"Mia\", whose name we have changed to protect her identity, and who says she was trapped by Mr Mwesigwa's network.</p>\n<p>Mr Mwesigwa denies the allegations. He says he helps women find accommodation through landlords, and that women follow him to parties because of his wealthy Dubai contacts.</p>\n<p>We have also discovered that two women linked to Mr Mwesigwa have died, having fallen from high-rise apartments. Although their deaths were ruled as suicides, their friends and family feel the police should have investigated further.</p>\n<p>Mr Mwesigwa said the incidents were investigated by the Dubai police and asked us to contact them for information. They did not reply to our request.</p>\n<ul>\n      <li>\n        <strong>Outside of the UK you can</strong>\n        <a href=\"https://youtu.be/OboT09uRw6M\">watch on YouTube</a>\n      </li>\n    </ul>\n<p>One of the women who lost her life, Monic Karungi, arrived in Dubai from western Uganda.</p>\n<p>She found herself sharing a flat with dozens of other women working for Mr Mwesigwa, according to one of the women, who we are calling Keira, who says she lived with Monic there in 2022.</p>\n<p>\"[His] place was like a market… There were like 50 girls. She was not happy because what she expected is not what she got,\" Keira told us.</p>\n<p>Monic thought the job in Dubai was going to be in a supermarket, according to her sister Rita.</p>\n<p>\"He [Mr Mwesigwa] was violent when I told him I wanted to go back home,\" says Mia, who also knew Monic in Dubai. She says that, when she first arrived, he told her she already owed him £2,000 ($2,711) and that within two weeks that debt had doubled.</p>\n<p>\"Money for air tickets, for your visa, for where you're sleeping, food,\" says Mia.</p>\n<p>\"That means you have to work hard, hard, hard, pleading for men to come and sleep [with] you.\"</p>\n<p>Monic owed Mr Mwesigwa more than $27,000 (£19,918) after several weeks, according to what a relative of hers we are calling Michael says she told him. He adds that he received tearful voice notes from her.</p>\n<p>Mia told us that clients were mostly white Europeans, and included men with extreme fetishes.</p>\n<p>\"There's this one client, he poops on girls. He poops and he tells them to eat the shit,\" she explained quietly.</p>\n<p>Another woman we are calling Lexi, who says she was tricked by a different network, echoed Mia's story, saying \"porta potty\" requests were frequent.</p>\n<p>\"There was a client who said: 'We pay you 15,000 Arab Emirates Dirham ($4,084, £3,013) to gang-rape you, pee in your face, beat you, and add in 5,000 ($1,361, £1,004)'\" for being recorded eating faeces.</p>\n<p>Her experiences have led her to believe there is a racial element to this extreme fetish.</p>\n<p>\"Every time I said that I wouldn't want to do that, it seemed to get them more interested. They want somebody who is going to cry and scream and run. And that somebody [in their eyes] should be a black person.\"</p>\n<p>Lexi says she tried to get help from the only people she thought could intervene - the police. But she says they told her: \"You Africans cause problems for each other. We don't want to get involved. And they would hang up.\"</p>\n<p>We put this allegation to the Dubai police and they did not reply.</p>\n<p>Lexi eventually escaped back to Uganda and now helps to rescue and support women in similar situations.</p>\n<p>Finding Charles Mwesigwa wasn't easy. We could only find one picture of him online - and it was taken from behind. He also uses multiple names across social media.</p>\n<p>But through a combination of open-source intelligence, undercover research, and information from a former member of his network, we traced him to a middle class neighbourhood in Dubai - Jumeirah Village Circle.</p>\n<p>To corroborate what sources had told us about his business - supplying women for degrading sex acts - we sent in an undercover reporter posing as an event organiser sourcing women for high-end parties.</p>\n<p>Mr Mwesigwa appeared calm and confident when speaking about his business.</p>\n<p>\"We've got like 25 girls,\" he said. \"Many are open-minded… they can do pretty much everything.\"</p>\n<p>He explained the cost - from $1,000 (£738) per girl per night, but more for \"crazy stuff\". He invited our reporter for a \"sample night\".</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "my-wife-died-giving-birth-after-trump-cut-funding-to-our-clinic",
    "title": "'My wife died giving birth after Trump cut funding to our clinic'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "When Shahnaz went into labour, her husband Abdul called a taxi to take them to the only medical facility accessible to them.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d10a/live/fec88e30-8fe3-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>When Shahnaz went into labour, her husband Abdul called a taxi to take them to the only medical facility accessible to them.</p>\n<p>\"She was in a lot pain,\" he says.</p>\n<p>A 20-minute drive away, the clinic was in Shesh Pol village in Afghanistan's north-eastern Badakhshan province. It was where their two older children were born.</p>\n<p>Abdul sat next to Shahnaz comforting her as they drove over gravel tracks to reach help.</p>\n<p>\"But when we reached the clinic, we saw that it was closed. I didn't know it had shut down,\" he said, his face crumpling with agony.</p>\n<p>\n      <strong>Warning: Readers may find some details in this article distressing.</strong>\n    </p>\n<p>The clinic in Shesh Pol is one of more than 400 medical facilities that closed down in Afghanistan, one of the world's poorest countries, after the Trump administration cut nearly all US aid to the country earlier this year, in a drastic and abrupt move following the dismantling of the US Agency for International Development (USAID).</p>\n<p>A single-storey structure with four small rooms, white paint peeling off its walls, the Shesh Pol clinic has USAID posters tacked up everywhere with information and guidance for pregnant women and new mothers.</p>\n<p>It doesn't look like much but in Badakhshan's mountainous, unforgiving terrain, where a lack of access has been a major reason for historically high maternal mortality rates, the clinic was a critical lifeline, part of a wider programme implemented during the tenure of the US-backed government in the country, to reduce maternal and newborn deaths.</p>\n<p>It had a trained midwife who assisted around 25-30 deliveries every month. It had a stock of medicines and injections, and it also provided basic healthcare services.</p>\n<p>Other medical facilities are simply too far from Abdul's village, and it was not without risk for Shahnaz to travel on bumpy roads. Abdul also didn't have money to pay for a longer journey - renting the taxi cost 1,000 Afghani ($14.65; £12.70), roughly a quarter of his monthly income as a labourer. So they decided to return home.</p>\n<p>\"But the baby was coming and we had to stop by the side of the road,\" Abdul said.</p>\n<p>Shahnaz delivered their baby girl in the car. Shortly after, she died, bleeding profusely. A few hours later, before she could be named, their baby also died.</p>\n<p>\"I wept and screamed. My wife and child could've been saved if the clinic was open,\" said Abdul. \"We had a hard life, but we were living it together. I was always happy when I was with her.\"</p>\n<p>He doesn't even have a photo of Shahnaz to hold on to.</p>\n<p>There's no certainty the mother and baby would've survived if they'd been treated at the clinic, but without it, they didn't stand a chance, underlining the undeniable impact of US aid cuts in Afghanistan.</p>\n<p>For decades, America has been the largest donor to Afghanistan, and in 2024, US funds made up a staggering 43% of all aid coming into the country.</p>\n<p>The Trump administration has justified withdrawing it, saying there were \"credible and longstanding concerns that funding was benefiting terrorist groups, including... the Taliban\", who govern the country. The US government further added that <a href=\"https://www.state.gov/briefings/department-press-briefing-april-8-2025\">they had reports stating</a> that at least $11m were \"being siphoned or enriching the Taliban\".</p>\n<p>The report that the US State Department referenced <a href=\"https://www.sigar.mil/Reports/Category/24950/\">was made by the Special Inspector General for Afghanistan Reconstruction</a> (SIGAR). It said that $10.9m of US taxpayer money had been paid to the Taliban-controlled government by partners of USAID in \"taxes, fees, duties, or utilities\".</p>\n<p>The Taliban government denies that aid money was going into their hands.</p>\n<p>\"This allegation is not true. The aid is given to the UN, and through them to NGOs in provinces. They identify who needs the aid, and they distribute it themselves. The government is not involved,\" said Suhail Shaheen, the head of the Taliban's political office in Doha.</p>\n<p>The Taliban government's policies, especially its restrictions on women, the harshest in the world, have meant that after four years in power, it is still not recognised by most of the world. It's also a key reason donors have been increasingly walking away from the country.</p>\n<p>The US insists no one has died because of aid cuts. Shahnaz and her baby's deaths are not recorded anywhere. Neither are countless others.</p>\n<p>The BBC has documented at least half a dozen first-hand, devastating accounts in areas where USAID-supported clinics have shut down.</p>\n<p>Right next to Shahnaz's grave, villagers who had gathered around us pointed to two other graves. They told us both were of women who died in childbirth in the past four months – Daulat Begi and Javhar. Their babies survived.</p>\n<p>Not far from the graveyard, we met Khan Mohammad whose wife, 36-year-old Gul Jan, died in childbirth five months ago. Their baby boy Safiullah died three days later.</p>\n<p>\"When she became pregnant, she would go to the clinic for check-ups. But midway through her pregnancy it shut down. During the delivery she had a lot of pain and blood loss,\" Khan Mohammad said. \"My children are sad all the time. No one can give them the love of a mother. I miss her every day. We had a sweet and loving life together.\"</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "strictly-star-dani-dyer-on-why-she-d-like-to-pull-dad-danny-up-on-the-",
    "title": "Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "It's that time again. The nights are drawing in, the tans are fading and we all need a bit of sparkle in our lives as we head into autumn.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0316/live/fd5726f0-8efe-11f0-ad1d-477615c292d0.jpg",
    "source": "https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>\n      <strong>It's that time again. The nights are drawing in, the tans are fading and we all need a bit of sparkle in our lives as we head into autumn.</strong>\n    </p>\n<p>Never fear, Strictly Come Dancing is back with its 23rd series, with 15 new contestants ready to dust off their dancing shoes.</p>\n<p>Following last year's <a href=\"https://www.bbc.co.uk/news/articles/cz47pp1qwl7o\">controversies relating to the behaviour of some professional dancers</a>, plus a recently launched <a href=\"https://www.bbc.co.uk/news/articles/c4ge98v7j80o\">investigation into alleged drug use by two of the show's stars</a> and an <a href=\"https://www.bbc.co.uk/news/articles/cly3p58rm8go\">unnamed star being arrested on suspicion of rape</a> (it is understood the development is not related to the upcoming series), BBC bosses will be keen for fans and media to return to talking about the show itself.</p>\n<p>With that in mind, the press gathered for an annual event which gives journalists a chance to speak to all the contestants ahead of the show launch (well, almost all, more on that later).</p>\n<p>Here's all the behind-the-scenes gossip we found out from the likes of Dani Dyer, Vicky Pattison and Jimmy Floyd Hasselbaink.</p>\n<h2>On being 'Strictified'</h2>\n<p>One of the big attractions for most celebrity contestants on the show is the chance to glam up to the max every Saturday night.</p>\n<p>Former Love Island star Dani Dyer says she's game for any dance costume.</p>\n<p>\"I can't wait to be a bit sexy, I've been a mum... my oldest is four... am I sexy?,\" she giggles.</p>\n<p>\"On Love Island I never wore the thong bikinis and now I'm like 'Why didn't I do that?\"</p>\n<p>Dani in a carnival thong number for the samba? You heard it here first.</p>\n<p>La Voix, who competed in the 2024 series of RuPaul's Drag Race UK, arrives at the press event in full make-up with trademark coiffured hair-do. How on earth can you \"Strictify\" a drag performer?</p>\n<p>\"I might be the only one that dresses down on a live show! I want the full Strictly experience. They're going to take it to the next level. They have already – I've been lucky enough to have seen my first dress.</p>\n<p>\"The glamour is wonderful, I feel like I'm living my dream. I don't want to do the dancing, just the dressing up bit!\"</p>\n<h2>Keeping control of the nerves</h2>\n<p>Former Geordie Shore star and podcast host Vicky Pattison has always been very open about her struggles with anxiety, recently revealing on her podcast Get A Grip that she had gone back to therapy to deal with Strictly nerves.</p>\n<p>\"Everyone's handling me with kid gloves at the moment, I keep getting loads of cuddles off everyone.</p>\n<p>\"I'm scared, a little bit overwhelmed. I think it's because I've wanted to do this show for so long, I'm a big fan. I'm desperate to make the most of it... but I'm worried I'll get in my own head.\"</p>\n<p>But support from the likes of former contestants Pete Wicks and her podcast co-host Angela Scanlon is helping.</p>\n<p>\"With Pete, our careers, there's a lot of parallels, we both come from reality TV and there's this common misconception that we're not very talented or capable of anything. I would really like to change that narrative. Pete just said be yourself.</p>\n<p>\"I just need to get a handle on myself and put my big girl pants on. I'll kick myself if I'm in my own head the whole time and I don't enjoy it. I think I'm putting a lot of pressure on myself.\"</p>\n<p>Social media star George Clarke says the nerves haven't hit him - yet.</p>\n<p>\"I don't really get nervous until it's just about to happen, which is nice, until it's just about to happen! Nice build-up and then a breakdown in the dressing room!\"</p>\n<p>Model, actress and influencer Ellie Goldstein says she's \"excited and nervous but nerves are good. I'm so competitive, I want to win!\"</p>\n<p>And Dani's famous dad Danny Dyer will be cheering her on.</p>\n<p>\"Dad is so excited for me, he loves the show. He came to support when Rose Ayling Ellis (his on-screen daughter in EastEnders) was doing it and it was emotional then. He loves a dance himself. I should get him up!\"</p>\n<h2>The Strictly curse</h2>\n<p>None of the contestants seemed bothered about the so-called Strictly curse, which refers to several former contestants who were already in relationships and ended up finding romance with fellow participants.</p>\n<p>In fact, La Voix jokes: \"Bring it on, I'm single!\"</p>\n<p>Dyer points to the fact she's only just got married earlier this year (to West Ham footballer Jarrod Bowen), so has no concerns.</p>\n<p>ER and Doctor Who actress Alex Kingston quips: \"I'm at the age where I don't have to worry about that!\" Come on Alex, 62 is nothing these days.</p>\n<p>Former footballer and manager Jimmy Floyd Hasselbaink says his wife won't be bothered in the slightest.</p>\n<p>\"Take him, take the old fart, take him!\"</p>\n<h2>Thomas is a no-show</h2>\n<p>Sadly, we didn't get the chance to chat to former Apprentice star and social media personality Thomas Skinner, who <a href=\"https://www.bbc.co.uk/news/articles/c1l8vnzmeqpo\">later apologised for picking up a journalist's phone before he walked out of the event.</a></p>\n<p>But Thomas also made it clear that he is staying on the line-up, stressing that he \"can't wait to give it my all on that dancefloor\".</p>\n<p>He'll no doubt be keen for his feet to do the talking from now on.</p>\n<h2>Does previous dance experience <i>really</i> help?</h2>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "trade-war-and-faltering-economy-five-challenges-facing-canada-s-mark-c",
    "title": "Trade war and faltering economy - five challenges facing Canada's Mark Carney",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "A trade war with its largest economic partner, a faltering economy - and a lot of promises to deliver on.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b744/live/b03b4e10-91ff-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>A trade war with its largest economic partner, a faltering economy - and a lot of promises to deliver on.</p>\n<p>These are only some of the high-stake tests facing Canadian Prime Minister Mark Carney as parliament returns for the autumn sitting on Monday.</p>\n<p>Here is a look at some of the political pressures on his Liberal government's horizon.</p>\n<h2>Voters want action on lofty pledges</h2>\n<p>Carney's Liberals made a series of lofty promises during the recent election campaign, from making Canada's economy the strongest in the G7 to \"turbo-charging\" major infrastructure projects and massively ramping up housing development.</p>\n<p>Now, voters are ready to see progress.</p>\n<p>Canadians \"will be looking for clear actions that make a difference, and that's where the rubber will really hit the road for Mark Carney\", said Sébastien Dallaire, an executive vice-president with polling firm Leger.</p>\n<p>There has been some movement on big issues. Last week, the prime minister unveiled the first series of \"nation-building\" projects that Ottawa will review for fast-track approvals - a key part of his wider economic agenda.</p>\n<p>They include a plan to double production of liquefied natural gas (LNG) at a British Columbia plant, the expansion of part of Montreal's port, and building a small modular nuclear reactor in Ontario.</p>\n<p>Carney has also announced $13bn (£6.9bn, $9.4bn) for a new federal housing agency to help build new homes, and vowed to diversify trade away from the US.</p>\n<p>In politics it's usually prudent to under-promise and over-deliver, said Marci Surkes, chief strategy officer at public affairs firm Compass Rose and a former policy director to Carney's predecessor, Justin Trudeau.</p>\n<p>\"Mr Carney has taken quite a different tack, where he has really set the bar very high in terms of expectations,\" she said.</p>\n<p>She added: \"There's already impatience from those who are waiting to see results.\"</p>\n<h2>Economic woes surpass Trump fears</h2>\n<p>Anxiety around an unpredictable US president helped propel Carney to power last April.</p>\n<p>Donald Trump has since imposed punishing tariffs on some sectors of the economy, like steel and autos, but has granted a majority of Canadian goods a broad tariff exemption under the current US-Mexico-Canada free trade deal.</p>\n<p>Mr Dallaire said Canadians know it won't be \"an easy ride\" for the next few years.</p>\n<p>\"The question has turned to: 'OK, what now?'\"</p>\n<p>Recent opinion polling suggests that voters are feeling less panicked by Trump but increasingly worried about the economy.</p>\n<p>Canada's unemployment rate rose to 7.1% last month, a level not seen since 2016, excluding the pandemic, and economic growth slowed sharply over the summer, contracting by 1.6%.</p>\n<p>A poll released by Abacus Data this month indicates that six in 10 respondents felt the Ottawa government was too focused on the US president at the expense of pressing concerns like housing, healthcare, and affordability.</p>\n<p>Still, for Carney, there's some silver lining. Many don't blame him directly for the economic shocks of Trump's policies - but they will be watching how the prime minister navigates what he has called a \"rupture\" in the global economy.</p>\n<p>\"A souring economy will become a drag on the popularity of the government, but it really depends to what extent it happens and to what extent Canadians see visible changes,\" said Mr Dallaire.</p>\n<h2>An opposition leader back in the saddle</h2>\n<p>Pierre Poilievre is making his return to the House of Commons.</p>\n<p>The Conservative leader lost his long-held seat in the April election to a Liberal challenger and was forced to spend his summer seeking a path back to parliament.</p>\n<p>In August, he won a by-election in Alberta, securing a new seat and a chance to be a foil for Carney in the House.</p>\n<p>\"The real fighting match is about to begin, and Mr Carney is going to have to swat away or figure out how to handle the punches that will be coming at him,\" said Ms Surkes.</p>\n<p>In an open letter to Carney last week, Poilievre set the stage, saying: \"So far, you have been judged only by the lofty things you have promised to do one day, not by what you have done.\"</p>\n<p>Poilievre has sharply focused his message on cost-of-living and crime issues and he plans to target the Liberals - who have been in power since 2015 - on their record, as well as on immigration.</p>\n<p>That includes pushing them on the number of temporary foreign workers allowed into the country, a programme that has seen a significant expansion in recent years.</p>\n<h2>An 'austerity' warning</h2>\n<p>An \"austerity and investment\" federal budget is expected later this autumn - a financial balancing act Carney has said is possible with \"discipline\".</p>\n<p>The prime minister has criticised government spending under Trudeau as \"unsustainable\" and has asked his finance minister to find programme spending cuts across departments that would increase to 15% reductions over the next three years.</p>\n<p>\"We need to rein in spending. We need to find efficiencies,\" Carney has said.</p>\n<p>But the prime minister will also have to find a way to deliver on major commitments, including a multi-billion dollar increase in defence spending promised to Nato partners, notably the US.</p>\n<p>It comes amid lower revenues from tariffs and other financial challenges, likely leaving officials \"shaking every couch cushion loose for change\", said Ms Surkes.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "play-now",
    "title": "Play now",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9457/live/a4b0d300-8366-11f0-ab3e-bd52082cd0ae.png",
    "source": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Play: Cooler Than Me?</h1>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?</strong>\n    </p>\n    <p>Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.</p>\n    <p>You can find the latest forecast on <a href=\"https://www.bbc.com/weather\">the BBC Weather website</a>.</p>\n    <p>Want to know how Cooler Than Me? works? <a href=\"https://www.bbc.com/weather/articles/c3dpnpkv3m4o\">Read the FAQ</a>.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {}
]