[
  {
    "slug": "beer-is-losing-its-grasp-on-football-here-s-why",
    "title": "Beer Is Losing Its Grasp On Football. Here’s Why.",
    "category": "test",
    "subcategory": "12Drink",
    "category_slug": "test/12drink",
    "date": "2025-09-19",
    "excerpt": "Late last month, I received a comment from a reader about my column on the American brewing industry’s collective overcapacity problem. Well, more of a request, really.",
    "cover": "https://vinepair.com/wp-content/uploads/2025/09/hop-take-football-season-social.jpg",
    "source": "https://vinepair.com/articles/hop-take-football-season-beer-sales-down/",
    "source_domain": "vinepair.com",
    "source_name": "Vinepair",
    "author": "Dave Infante",
    "rights": "Unknown",
    "body": "<p>Late last month, I received a comment from a reader about my column on the American brewing industry’s collective overcapacity problem. Well, more of a request, really.</p>\n<p>“Dave can you put out a piece that’s happy?” they <a href=\"https://bsky.app/profile/dinfontay.com/post/3lxmsck6gdc2s\">asked</a>. “Love your journalism, I believe their <i>[sic]</i> are winners out there though. You do ask the tough questions which I appreciate.”</p>\n<p>I saw it as a teachable moment. “Generally speaking, I don’t consider it a columnist’s role to produce coverage designed to evoke a specific emotion,” I responded. “That said, you’re always welcome to send me pitches and tips about the ‘winners’ you’re seeing in the market (which, I agree, certainly exist!)” I never heard back. Maybe that’s for the best, though, because this week’s column hangs on a tough question, too. Namely: How have beer sales been looking now that both college and professional football are back in full swing?</p>\n<p>The answer is hardly happy. Data from the market-intelligence platform BeerBoard indicate beer sales <a href=\"https://www.beerboard.com/blog/2025-nfl-opening-weekend-report/\">took a beating</a> in the on-premise over the National Football League’s opening weekend (Sept. 4-7), fumbling 7.3 percent on draft and 8.3 percent in package compared to the same frame last year. “Much of that decline fell on beer and seltzers,” <a href=\"https://www.beerboard.com/blog/2025-nfl-opening-weekend-report/\">noted</a> chief marketing officer J.C. Whipple in a press release. “[W]hile RTD and NA options do not claim as much share as Light Lager and Lagers in package sales, they continued to outperform with impressive growth of +37.6 percent and +39.7 percent, respectively.” As is often the case in the contemporary beer market, if you’re looking for silver linings, you’ll strictly find them shining in small denominators. Beer proper used to be capable of delivering those sorts of gains on gameday, too, and not so long ago: BeerBoard <a href=\"https://www.brewbound.com/news/beerboard-draft-sales-21-during-nfl-opening-weekend/\">tracked</a> a 21 percent bump in on-premise draft sales during the NFL’s opening weekend in 2022, and 19 percent in 2021. Those are sobering stat lines compared to this year’s tackle for loss.</p>\n<p>Of course, for every jersey-clad jabroni yelling at a flatscreen in America’s sports bars, there are several more doing the exact same thing at home. But off-premise sales figures coming out of the NFL’s opening weekend are looking pretty gritty, too. According to off-premise scan data from the market research firm Circana, the category’s 3.4 percent dollar and 5 percent volume year-over-year declines for the week through Sept. 7 outran those of total beverage alcohol (-2.6 percent and -4.3 percent). “Upcoming, the data is likely to remain rangebound for [the] next several weeks and perhaps until Halloween when we may see [a] small spike in the data,” wrote Circana’s executive vice-president of BevAl, Scott Scanlon, in a depressing dispatch <a href=\"https://www.brewbound.com/news/circana-post-labor-day-scans-bev-alc-dollar-sales-2-6-volume-4-3-rtds-return-to-growth\">reported</a> by Brewbound. Translation: Don’t expect supermarket and convenience store sales to come blitzing back in Week Two, or thereafter.</p>\n<p>No one factor fully explains beer’s loosening grip on the pigskin. But from my spot on the sideline, a few loom particularly large. Let’s draw this up together. (All right, that’s my last football pun.)</p>\n<p>First, foremost, and football-agnostically: To the extent that the category has had a “typical” year since the pandemic, 2025 certainly hasn’t been one of them. Between the Trump administration’s <a href=\"https://vinepair.com/articles/hop-take-trump-tariff-impact-on-american-beer-exports/\">disastrous</a>, <a href=\"https://vinepair.com/articles/hop-take-craft-brewers-protest-trump-tariffs/\">deeply unpopular</a> <a href=\"https://vinepair.com/articles/hop-take-trump-tariffs-impact-on-beer-industry/\">tariffs</a>, its <a href=\"https://www.fingers.email/p/constellation-s-euphemisms-for-fascism-aren-t-cutting-it\">reign of terror</a> <a href=\"https://www.fingers.email/p/disappearing-drinkers-is-bad-for-the-booze-business\">on immigrant communities</a>, and its performative militarization of American cities more generally, there are a lot of new headwinds gusting forth from the White House and buffeting national beer sales apace.</p>\n<p>Constellation Brands, with its industry-leading exposure to both Mexican imports and Hispanic consumers, is an obvious bellwether here, and just last month, it revised down its guidance for the current fiscal year, projecting a 2 to 4-percent decline in its beer division’s net sales growth and a 7 to 9 percent decline in that division’s net operating income. (Both metrics had previously been projected to land just barely in the black.) “Over the last several months, high-end beer buy rates decelerated sequentially, as both trip frequency and spend per trip declined,” wrote Constellation chief executive Bill Newlands in a note to investors. “Notably, high-end beer buy rate declines for Hispanic consumers were more pronounced than general market declines, which has an outsized impact on our Beer Business compared to the broader beer category.”</p>\n<p>That’s certainly true, but there’s no reason to assume the broader beer category isn’t getting dragged down with it. Research from the multicultural consumer insights firm Collage Group <a href=\"https://www.nacsmagazine.com/Issues/October-2024/Mexican-Beer%E2%80%99s-%E2%80%98Fighting-Spirit%E2%80%99\">reported</a> by beverage journalist Kate Bernot in October 2024 — shortly before the election that would send Trump back to Washington — showed that 77 percent of Hispanic drinkers reported drinking beer in the prior three months, 12 percent higher than non-Hispanics. Between its taste for beer and its rapid-until-recently population growth, this is a key demographic for the category (not to mention for the NFL itself). That beer sales would be suffering as Hispanic drinkers suffer — <i>because</i> Hispanic drinkers suffer — makes sense.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://vinepair.com/articles/hop-take-football-season-beer-sales-down/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "what-did-guests-drink-at-trump-s-state-banquet",
    "title": "What did guests drink at Trump’s state banquet?",
    "category": "test",
    "subcategory": "14Drink",
    "category_slug": "test/14drink",
    "date": "2025-09-19",
    "excerpt": "A special transatlantic cocktail and a line-up of rare wines and spirits were poured at Windsor Castle on Wednesday night, as King Charles III and Queen Camilla hosted a state banquet for US president Donald Trump and First Lady Melania.",
    "cover": "https://www.thedrinksbusiness.com/content/uploads/2025/09/iStock-92282312-scaled.jpg",
    "source": "https://www.thedrinksbusiness.com/2025/09/what-did-guests-drink-at-trumps-state-banquet/",
    "source_domain": "thedrinksbusiness.com",
    "source_name": "Thedrinksbusiness",
    "author": "Sophie Arundel",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>What did guests drink at Trump’s state banquet?</h1>\n    <p>\n      <strong>A special transatlantic cocktail and a line-up of rare wines and spirits were poured at Windsor Castle on Wednesday night, as King Charles III and Queen Camilla hosted a state banquet for US president Donald Trump and First Lady Melania.</strong>\n    </p>\n    <p>\n      <graphic src=\"https://www.thedrinksbusiness.com/content/uploads/2025/09/iStock-92282312-640x427.jpg\"/>\n    </p>\n    <h4>A US–UK cocktail creation</h4>\n    <p>As is tradition under King Charles, the evening began with a bespoke cocktail created to mark the occasion. This year’s version was a UK–US twist on the classic whisky sour, blending Johnnie Walker Black Label with the citrus notes of marmalade, widespread media have reported.</p>\n    <p>The drink was topped with pecan foam and finished with a toasted marshmallow on a star-shaped biscuit, designed to echo the warmth of a fireside s’more.</p>\n    <p>Trump has previously said he does not drink alcohol, telling Fox News he has “never had a drink”, meaning the gesture was largely enjoyed by other guests.</p>\n    <h4>Wines and champagne</h4>\n    <p>The 160-strong guest list, which included Rupert Murdoch, Apple CEO Tim Cook, and BAE Systems chief Charles Woodburn, was served Wiston Estate Cuvée 2016 English sparkling wine for the toasts.</p>\n    <p>From California, Ridge Vineyards’ Monte Bello 2000 featured on the menu, alongside Domaine Bonneau du Martray’s Corton-Charlemagne Grand Cru 2018.</p>\n    <p>Champagne was provided by Pol Roger, with the Extra Cuvée de Réserve 1998 chosen in recognition of the president’s admiration for Sir Winston Churchill, who was known to favour the house.</p>\n    <h5>Partner Content</h5>\n    <h4>Rare spirits and fortified Wines</h4>\n    <p>After dinner, guests were offered a Warre’s 1945 Vintage Port, selected in reference to Trump’s status as both the 45th and 47th US president.</p>\n    <p>Also poured was a Hennessy 1912 Grande Champagne Cognac, the same year that Trump’s mother, Mary Anne MacLeod, was born.</p>\n    <p>A Bowmore Queen’s Cask 1980 single malt, originally gifted to Queen Elizabeth II and bottled for her Golden Jubilee in 2002, was also served to reflect the president’s Scottish heritage.</p>\n    <h4>A banquet fit for 160</h4>\n    <p>The menu, written in French as is customary, opened with Hampshire watercress panna cotta and Parmesan shortbread with quail egg salad. The main course was ballotine of organic Norfolk chicken wrapped in courgettes with thyme and savoury jus, followed by bombe glacée Cardinal – a vanilla ice cream bombe with Kentish raspberry sorbet and poached plums.</p>\n    <p>The table in St George’s Hall stretched 47.32 metres, decorated with 139 candles and set with 1,452 pieces of cutlery. Household staff spent days preparing, with the final flowers placed just hours before the banquet began.</p>\n    <p>In his speech, King Charles III highlighted the enduring ties between the United Kingdom and the United States, while the menu and drinks offered a carefully curated nod to both nations’ traditions.</p>\n    <p>\n      <strong>Related news</strong>\n    </p>\n    <p>\n                                <a href=\"https://www.thedrinksbusiness.com/2025/09/snoop-doggs-iconic-tonics-partners-with-the-butchers-daughter/\">\n                                    Snoop Dogg’s Iconic Tonics partners with The Butcher’s Daughter\n                                </a>\n                            </p>\n    <p>\n                                <a href=\"https://www.thedrinksbusiness.com/2025/09/hong-kongs-bar-leone-heads-for-shanghai/\">\n                                    Hong Kong's Bar Leone heads for Shanghai\n                                </a>\n                            </p>\n    <p>\n                                <a href=\"https://www.thedrinksbusiness.com/2025/09/the-new-london-bar-thats-an-antidote-to-all-things-capitalist-shiny-and-clean/\">\n                                    The new London bar that's an antidote to all things 'capitalist, shiny and clean'\n                                </a>\n                            </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.thedrinksbusiness.com/2025/09/what-did-guests-drink-at-trumps-state-banquet/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "psa-these-chai-latte-milano-cookies-are-better-than-the-fall-drink",
    "title": "PSA: These Chai Latte Milano Cookies Are Better Than The Fall Drink",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "I grew up on Pepperidge Farm. I loved (and still love) everything in their arsenal— Goldfish , croutons, cookies—you name it, I snacked on it. In particular, one of my go-to desserts from childhood was the Mint Milano. Milk chocolate and creamy mint sandwiched between two cook…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/img-7160-jpg-68cb18ce919ba.jpg",
    "source": "https://www.delish.com/food-news/a66338878/milano-chai-latte-review/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <ul>\n      <li>Pepperidge Farm added a new cookie to its Autumn Exclusive lineup: the Chai Latte Milano.</li>\n      <li>The sandwich cookie is made with white chocolate, cardamom, nutmeg, clove, and black tea extract.</li>\n      <li>It's more well-balanced than the actual drink, and I'd gladly grab these over a cup.</li>\n    </ul>\n    <p>I grew up on Pepperidge Farm. I loved (and still love) everything in their arsenal—<a href=\"https://www.delish.com/food-news/g65175236/best-goldfish-flavors-ranked/\">Goldfish</a>, croutons, cookies—you name it, I snacked on it. In particular, one of my go-to desserts from childhood was the Mint Milano. Milk chocolate and creamy mint sandwiched between two cookies? Say less. And while there are countless different flavors of my beloved Milanos, I must admit I'm rather inexperienced. Sure, I've tried the classic Dark Chocolate, but that's where my diversity in <a href=\"https://www.delish.com/cooking/recipe-ideas/a38314751/milano-cookies-copycat-recipe/\">Milano</a> flavors ends. Needless to say, when I learned that Pepperidge Farm was introducing a new Milano flavor for its Autumn Exclusive cookie collection, I knew it was time to get my hands on it. </p>\n    <p>Joining the Pumpkin Spice Milano and the Pumpkin Cheesecake Soft Baked cookie is the Chai Latte Milano. I find an actual <a href=\"https://www.delish.com/cooking/recipe-ideas/a28899368/how-to-make-chai-latte-recipe/\">chai latte</a> to be a little too spice-forward. Often, when I grab one on the go, the combination of sweet spices is overwhelming, and instead of giving me that autumnal hug a warm mug is supposed to, I get potpourri or scented candle in my mouth instead. I'm more of a subtle girly.  </p>\n    <p>So I was happily surprised when I bit into the Chai Latte Milano. While it absolutely tastes like a chai latte, it's much more balanced and subtle than the drink—I'd grab these over a cup any day. The combination of white chocolate, cardamom, nutmeg, clove, and black tea extract ensures the cookie sandwich is neither too sweet nor too spice-forward. And I'm not the only one hopping on the Chai Latte Milano bandwagon.</p>\n    <p>A social media <a href=\"https://www.instagram.com/p/DMvQquwOLrm/\">post</a> announcing the flavor garnered many enthusiastic reactions. </p>\n    <p>\"Sounds like it would be good!!! I loved the London Fog ones, so I probably will like these too!!!\" one person exclaimed.</p>\n    <p>\"Can’t wait for these,\" wrote another. \"Neeeeed these! One bag to dunk in hot chai, and the other to crumble into some homemade chai ice cream,\" another commented.</p>\n    <p>\"Oooh yes please!\" one person wrote. \"Heading to the store asap,\" said another.</p>\n    <p>I don't think they'll be disappointed.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/food-news/a66338878/milano-chai-latte-review/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "4-easy-ways-to-chill-your-wine-fast",
    "title": "4 Easy Ways To Chill Your Wine FAST",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "We’ve all heard the saying, “If you stay ready, you don’t have to get ready.” But life doesn’t always work that way—and more times than I’d like to admit, I’ve ended up with a warm bottle of wine and guests on the way. Whether you’re running late to grab a bottle before a potl…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/bottle-of-wine-in-ice-bucket-with-wine-glasses-royalty-free-image-1757517724.pjpeg",
    "source": "https://www.delish.com/kitchen-tools/kitchen-secrets/a66029806/how-to-chill-wine/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<ul>\n      <li>In general, white wines should be served between 40°F and 60°F, sparkling and rosé wines between 40°F and 50°F, and red wines between 55°F and 65°F.</li>\n      <li>Wines served too warm have heavy, alcoholic flavors, while wines served too cold taste dull and flat.</li>\n      <li>We tested four different methods to quickly chill wine when you don’t have time to wait patiently for the wine to cool in the refrigerator.</li>\n    </ul>\n<p>We’ve all heard the saying, “If you stay ready, you don’t have to get ready.” But life doesn’t always work that way—and more times than I’d like to admit, I’ve ended up with a warm <a href=\"https://www.delish.com/entertaining/wine/\">bottle of wine</a> and guests on the way. Whether you’re running late to grab a bottle before a <a href=\"https://www.delish.com/cooking/recipe-ideas/g43446365/summer-potluck-recipes/\">potluck</a> or scrambling to prep for a last-minute <a href=\"https://www.delish.com/holiday-recipes/valentines-day/g4640/easy-dinner-recipes-for-two-for-beginners/\">date night</a>, there are plenty of moments when a quick method for chilling wine is a lifesaver.</p>\n<p>The best plan is always to plan <i>ahead</i>, so if you really want to ensure properly chilled wine for each occasion, it may be a good idea to invest in a wine fridge, or clear out space in your fridge ahead of time, as a bottle in the fridge has less of a chance of getting overchilled than a bottle in the freezer or an ice bath. However, even the most strict of planners can’t foresee every event in life, so it is important to have a few tricks up your sleeve for quicker chilling. We tried several popular methods for chilling wines in order to find out exactly which method works the best in a pinch. We tested these techniques with white wine, but they can be used with red, rosé, and sparkling wines as well. </p>\n<h2>What Is The Ideal Temperature For Wine?</h2>\n<p>While there is a long-held rumor that <a href=\"https://www.delish.com/entertaining/wine/g29023291/red-wine-types/\">red wine</a> should never be chilled, this isn’t exactly true. There is a range of temperatures at which they are best enjoyed—if too warm, they can taste heavy and unbalanced, and if too cold, dull and one-note. </p>\n<p>Full-bodied red wines, like Cabernet Sauvignon or Malbec, should be served between 60°F and 65°F, as the concentrated flavor and higher alcohol content and tannins shine best at a higher temperature, but begin to become unbalanced any warmer than 65°F.</p>\n<p>Lighter-bodied, fruitier red wines, like Pinot Noir or Grenache, should be served at a slightly lower temperature, around 55°F to 60°F, and often benefit from a slight chilling prior to service, but be careful not to cool them down too much, or their flavor will become muted and dull.</p>\n<p>Fuller-bodied white wines, like Chardonnay or Riesling, should be served somewhere between 45°F and 60°F, with especially rich white wines, like oaked Chardonnay, benefiting from a slightly higher temperature closer to 60°F, and more medium-bodied whites, like a Pinot Gris, tending more towards the low end of this spectrum.</p>\n<p><a href=\"https://www.delish.com/holiday-recipes/new-years/g196/champagne-cocktails/\">Sparkling</a>, rosé, and dry white wines, like Pinot Grigio or Sauvignon Blanc, like colder temperatures, between 40°F and 50°F. This is especially important with sparkling wines, as they will retain more bubbles at colder temperatures.</p>\n<h2>\n      <strong>Four Ways To Chill Wine Quickly</strong>\n    </h2>\n<p>We tested four common methods for chilling wine, using identical, room-temperature bottles of white wine and allowing only 20 minutes for chilling. Here are the results.</p>\n<h2>Put It In The Freezer</h2>\n<p>The first method that we tested was simply placing the bottle of room-temperature (66°F) wine in the freezer on its own. This method was not particularly effective, only lowering the temperature to about 59°, which is too warm for most white wines. However, this method could be useful for quickly chilling red wines.</p>\n<h2>Wrap It In A Wet Paper Towel</h2>\n<p>The next method we tried was similar, but instead of placing the bottle of wine in the freezer, we first wrapped it in a wet paper towel. The idea is that the damp paper towel will act almost as an ice pack and rapidly chill the wine. It was more effective than a bottle in the freezer without wrapping, but didn’t get quite as cool as you would want for most white wines. Registering at just about 55°F, this method is helpful if you have a little more time on your hands, but in a pinch, it doesn’t quite cut it.</p>\n<h2>Add It To A Plastic Bag Of Ice</h2>\n<p>The next trick we tried can be messy, but with a bit of care, it shouldn’t be too bad. Place your bottle of wine in a gallon Ziploc bag, and then fill the bag with ice and water until the bottle is completely surrounded. This method worked well, chilling the wine from 65°F to about 42°F in only 20 minutes. But if you’ve got the supplies on hand, we’ve got one method that is even better.</p>\n<h2>Submerge It In An Ice Bucket</h2>\n<p>The tried-and-true method for chilling your wine is to add the wine bottle to an ice bath with salt. Grab a bucket that is large enough to fit your bottle, or bottles, of wine completely, then fill it with ice, salt, and water, and place the bottle into the ice bath so it is fully submerged. After just 20 minutes, this method brought our room temperature wine all the way down to a chilly 39°F.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/kitchen-tools/kitchen-secrets/a66029806/how-to-chill-wine/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "orange-snow-balls",
    "title": "Orange Snow Balls",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "These snow balls are perfectly sweet with just a hint of tart orange flavor. Everyone loves them, and I always get recipe requests when I bring them to a party. —Brooke Wofford, Travelers Rest, South Carolina",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/Orange-Snow-Balls_EXPS_RC25_279177_DR_04_15_03b.jpg",
    "source": "https://www.tasteofhome.com/recipes/orange-snow-balls/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Taste of Home Editorial Team",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>These snow balls are perfectly sweet with just a hint of tart orange flavor. Everyone loves them, and I always get recipe requests when I bring them to a party. —Brooke Wofford, Travelers Rest, South Carolina</p>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Orange-Snow-Balls_EXPS_RC25_279177_DR_04_15_03b.jpg\" alt=\"Orange Snow Balls\"/>\n    <h1>Orange Snow Balls</h1>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Orange-Snow-Balls_EXPS_RC25_279177_DR_04_15_03b.jpg\" alt=\"Orange Snow Balls\"/>\n    <p>\n      <a href=\"https://www.tasteofhome.com/article/test-kitchen-approved/\">Test Kitchen Approved</a>\n    </p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>1 package (11 ounces) vanilla wafers</li>\n      <li>2/3 cup chopped pecans</li>\n      <li>1/2 cup butter, melted</li>\n      <li>1/4 cup frozen orange juice concentrate, thawed</li>\n      <li>3 cups confectioners' sugar, divided</li>\n    </ul>\n    <h3>Directions</h3>\n    <ul>\n      <li>Place vanilla wafer cookies and pecans in a food processor; pulse until fine crumbs form. Add butter, thawed orange juice concentrate and one cup of confectioners sugar; pulse until mixture comes together.</li>\n      <li>Shape mixture into 1-in. balls; roll in remaining confectioners sugar. Store at room temperature.</li>\n    </ul>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Popular in the Community</p>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Reviews</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/recipes/orange-snow-balls/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-stanley-cross-bottle-is-here-and-we-re-obsessed-with-the-dazzling-",
    "title": "The Stanley Cross Bottle Is Here—And We’re Obsessed With the Dazzling Midnight Glitz Hue",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "We're calling it: The Stanley Cross Bottle is fall's best-kept accessory secret.",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/The-Stanley-Cross-Bottle-Is-Here_via-stanley1913.com_GSedit_FT.jpg",
    "source": "https://www.tasteofhome.com/article/stanley-cross-bottle/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Mary Henn",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>We're calling it: The Stanley Cross Bottle is fall's best-kept accessory secret.</p>\n    <p>Our editors and experts handpick every product we feature. We may earn a commission from your purchases.<a href=\"https://www.tasteofhome.com/about-product-testing/\">Learn more.</a></p>\n    <p>We're calling it: The Stanley Cross Bottle is fall's best-kept accessory secret.</p>\n    <p>Our editors and experts handpick every product we feature. We may earn a commission from your purchases.<a href=\"https://www.tasteofhome.com/about-product-testing/\">Learn more.</a></p>\n    <p>Last month, Stanley pulled a fast one and restocked the coveted <a href=\"https://www.tasteofhome.com/article/stanley-midnight-glitz/\">Midnight Glitz ProTour tumblers</a> without warning. If you snagged one before they sold out, lucky you. (I managed to buy one, and yes, they’re even more dazzling IRL.)</p>\n    <p>If you missed the restock and want a taste of the shimmering Midnight Glitz hue, it’s still up for grabs in one sleek style: the <a href=\"https://go.skimresources.com?id=131817X1598243&amp;xs=1&amp;url=https%3A%2F%2Fwww.stanley1913.com%2Fproducts%2Fthe-midnight-glitz-stanley-cross-bottle-23-oz-1\">Stanley Cross Bottle</a>. Here’s everything you need to know about the bottle that’s keeping the shimmer alive.</p>\n    <p>An on-the-go hydrator comes in one of our all-time favorite Stanley hues.</p>\n    <p>The <a href=\"https://go.skimresources.com?id=131817X1598243&amp;xs=1&amp;url=https%3A%2F%2Fwww.stanley1913.com%2Fproducts%2Fthe-midnight-glitz-stanley-cross-bottle-23-oz-1\">23-ounce Stanley Cross Bottle</a> is your go-anywhere, hydrate-anytime companion. With a tethered lid, leakproof design and comfy jacquard strap, it’s built for hands-free carry. Bonus: the silicone base softens every set-down, so there are no clunks and spills.</p>\n    <p>The Midnight Glitz shimmers as you move—sort of like a disco ball. It’s a deep, glossy black with rainbow glitter that catches the light, and it’s topped with a sheer purple lid and straw for a sophisticated cup with just the right amount of glitz.</p>\n    <p>If the Midnight Glitz colorway isn’t your style, the <a href=\"https://go.skimresources.com?id=131817X1598243&amp;xs=1&amp;url=https%3A%2F%2Fwww.stanley1913.com%2Fproducts%2Fthe-stanley-cross-bottle-23-oz%3Fvariant%3D44560048423039\">Cross Bottle</a> also comes in 10 other hues like Rose Quartz, Mist and Cream.</p>\n    <p>We won’t lie, we’re kind of obsessed with how sleek the Cross Bottle looks. It’s easily one of the prettiest sling-style water bottles out there, and honestly, perfect for travel and outdoor adventures. (No more accidentally leaving your bottle behind in the terminal—this one stays strapped on.)</p>\n    <p>It’s got all the classic Stanley perks too: a removable straw and double-wall vacuum insulation to keep drinks cold for hours.</p>\n    <p>Yes, the price is a little higher than the <a href=\"https://www.tasteofhome.com/article/stanley-quencher-tumbler-review/\">Stanley Quencher tumbler</a>, but reviewers say it’s worth it for a hands-free, ultra-portable bottle made for city exploring, trail walking and everything in between. Fans also rave about the Cross Bottle’s durable strap and say it provides just the right amount of hydration without weighing too heavily on the shoulder.</p>\n    <p>A Stanley cup that offers hands-free carrying and a glittery design? Sign us up!</p>\n    <p>You can buy the Midnight Glitz Cross Bottle now on the <a href=\"https://go.skimresources.com?id=131817X1598243&amp;xs=1&amp;url=https%3A%2F%2Fwww.stanley1913.com%2Fproducts%2Fthe-midnight-glitz-stanley-cross-bottle-23-oz-1\">Stanley website</a> for $75, but act fast! We suspect it will be hard to get as soon as people catch on to the hype.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/article/stanley-cross-bottle/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-art-of-building-a-menu-with-shared-plates",
    "title": "The Art of Building a Menu With Shared Plates",
    "category": "test",
    "subcategory": "5Food",
    "category_slug": "test/5food",
    "date": "2025-09-18",
    "excerpt": "On the whole, I love the shared-plates phenomenon at restaurants. I delight in sampling as much of the menu as possible and in the community derived from the table tasting and reacting to dishes in unison. But the awkwardness of this format can ratchet up quickly as the number…",
    "cover": "https://assets.bonappetit.com/photos/68b7478d58c8c1807204acfb/master/pass/0902-BonAppetit-1920x1080-RGB-OP5b.png",
    "source": "https://www.bonappetit.com/story/share-plates-menu-chefs-trends",
    "source_domain": "bonappetit.com",
    "source_name": "Bonappetit",
    "author": "Maggie Hennessy",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>On the whole, I love the shared-plates phenomenon at restaurants. I delight in sampling as much of the menu as possible and in the community derived from the table tasting and reacting to dishes in unison. But the awkwardness of this format can ratchet up quickly as the number of diners surpasses two. Consider the absurdity of carving a single oozing arancini into three or four pieces, doling out two measly salad leaves each to a foursome, or hacking a pristine fish fillet into chum for five.</p>\n    <p>Some of this discomfort arises from the fact that we’re in a semi-formal, semi-public setting, which upends our instincts about sharing food the way we do at home. But successful sharing in groups also depends heavily on the restaurant—in the mix and makeup of dishes it serves and how it trains staff, so they know when to suggest doubling or subtracting certain items, or adding one more prawn (for crying out loud). This keeps the focus where it should be, on the company and conversation, rather than the logistics of divvying up a bone-in chicken thigh.</p>\n    <p>“Sharing is how most of us eat 90 percent of the time,” says Sayat Ozyilmaz, executive chef of <a href=\"https://www.dalidasf.com/\">Dalida</a>, an Eastern Mediterranean restaurant in San Francisco. “When Mom or your grandmother cooks for you, she’s not making individual plates of steak or chicken. You grab some and put it on your plate. If you want more, you grab more. There’s an understanding across the table of how people eat and share.”</p>\n    <p>Ozyilmaz believes that shareable dining at restaurants, when done right, can foster more intimacy with our companions. Dalida takes that up as a concept centered around themes of connection and breaking bread. Its “chubby” pitas run a hefty 5 oz. to satisfy four. (The restaurant even dialed back on the bread’s surface oil slick for less messy tearing.) Groups larger than six are required to order from a set chef’s choice menu—to better ward off indecision and infighting. Servers undergo “information-heavy” training, not just to become well-versed in the large menu with flavors spanning Turkey, Greece, Israel, Armenia, and Iran, but to confidently shepherd diners toward meal builds that make the most sense. This includes letting them know when they should add another kibbe or lamb chop if the number of pieces doesn’t line up with the group size.</p>\n    <p>“It’s up to the server to be the ambassador of the restaurant, to be the person that’s there to relate everything to you, translate the language, and so on,” agrees Andy Elliott, chef and owner with his wife, Emily Stewart, of <a href=\"https://modernbirdtc.com/\">Modern Bird</a>, a seasonal American shared-plates restaurant in Traverse City, Michigan.</p>\n    <p>If a table of six wants to start with Modern Bird’s pillowy cheese bread with ranch butter, servers will suggest they order two. The same goes for the gnudi, which arrives in four oversized pieces.</p>\n    <p>Just as importantly, though, cooks engineer plates that are physically easier to share and more generously portioned. Instead of a leafy house salad, diners get chunky shareable beets with horseradish, speck and a jammy egg. “No soup either!” Elliott says. Wagyu denver steak is pre-sliced and plated on one side with maitake mushrooms on the other and sauce in the middle, so it’s easy to stack everything on a fork and drag it through the sauce “without it being a fussy plate you have to dissect,” Elliott says.</p>\n    <p>“So much of plating is logistical,” he adds. “Part of that is I have X amount of line cooks working with X equipment for X amount of time between fire and plate. But the biggest part of that equation is, how are people gonna eat this thing?”</p>\n    <p>It’s an apt question for crudo submerged in chilled liquid, a decidedly unshareable dish that seems to show up on every trendy shared-plates menu. Elliott recently menued a hamachi crudo with ponzu foam on top instead of submerging it in broth to facilitate easier sharing. Likewise, at a recent shared-plates dinner at Italian-Croatian restaurant <a href=\"https://www.rosemarychicago.com/\">Rose Mary</a> in Chicago, four ruddy slabs of tuna crudo arrived nestled in veal aioli with capers and beef fat vinaigrette, which enabled four diners to each stab a piece and throw it back in one clean go.</p>\n    <p>Nick Tamburo, chef-owner of <a href=\"https://www.smithereensnyc.com/\">Smithereens</a>, a seasonal seafood spot in New York, refused to re-engineer a recent crudo of delicate sea bream in melony leche de tigre. Instead, he offers up a more controversial solution for diners: Embrace the intimacy of eating directly off the serving dish then passing it on.</p>\n    <p>“If you aren't eating directly off of the dish that the food is plated on, you can miss out on a lot of the flavor and nuance,” Tamburo says. “Sure I get it; germs and stuff. I encourage you to live a little and eat and drink with abandon.\"</p>\n    <p>Unfortunately, in a post-COVID culture in which plenty of diners hesitate to even “tear bread with their hands,” as Ozyilmaz has found at Dalida, not many tables want to share in the uninhibited way they might at home. Smithereens does provide share plates, just in case.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bonappetit.com/story/share-plates-menu-chefs-trends\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "this-3-ingredient-smoky-sauce-improves-any-bowl-of-noodles",
    "title": "This 3-Ingredient Smoky Sauce Improves Any Bowl of Noodles",
    "category": "test",
    "subcategory": "5Food",
    "category_slug": "test/5food",
    "date": "2025-09-18",
    "excerpt": "It’s That Simple is our series about recipes so easy, you can make them with your eyes closed. Think tiny ingredient lists, laid-back techniques, and results so delicious you’ll text home about them.",
    "cover": "https://assets.bonappetit.com/photos/68c07b79cdf965e8ccfe1f18/master/pass/20250701_1025_01_ITS_Smoky%20Brown%20Butter%20Pasta_049_FINAL.jpg",
    "source": "https://www.bonappetit.com/story/this-3-ingredient-smoky-sauce-improves-any-bowl-of-noodles",
    "source_domain": "bonappetit.com",
    "source_name": "Bonappetit",
    "author": "Jesse Szewczyk",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p><i>It’s That Simple</i><i>is</i> <i>our series about recipes so easy, you can make them with your eyes closed. Think tiny ingredient lists, laid-back techniques, and results so delicious you’ll text home about them.</i></p>\n    <p>There’s undeniable comfort in a bowl of warm buttered noodles, but by the umpteenth time eating one, its simplicity in flavor becomes expectedly boring. I long for a little spice, an unexpected twist that catapults the dish out of kid’s menu territory into a more sophisticated stratosphere. The answer is Smoky Brown-Butter Pasta.</p>\n    <p>We all know about <a href=\"https://www.bonappetit.com/story/how-to-brown-butter?srsltid=AfmBOop5UDTTDJC1q5cR3YU7ZtJahaxDsHamSBu9yl0Tqtrep7CafAey\">browning butter</a>, a technique that’s practically required in any modern-day <a href=\"https://www.bonappetit.com/recipe/bas-best-chocolate-chip-cookies\">chocolate chip cookie recipe</a>. As butter melts, the milk solids toast, tinting the fat a warm amber hue while imbuing it with a toasted-hazelnut-like essence. I like to sprinkle in smoked paprika (a.k.a. Pimentón or Spanish paprika), which sizzles in the hot butter, a game-changing method called blooming. This step unlocks the spice’s fat-soluble compounds, unleashing its brawny, savory-sweet flavors. Now, peppery and earthy notes, with whispers of charred oak, are detectable.</p>\n    <p>I like to use spaghetti and cook it just a smidge under al dente (it will finish cooking in the sauce), but just about any pasta shape is fair game. Heck, you could even use gnocchi if you’re feeling it. The robust sauce clings to the pasta, creating a dish far greater than the sum of its parts.</p>\n    <p>A scattering of salted, roasted almonds (like the kind you snack on) and chopped parsley elevates this to bistro-worthy fare. Think of the finisher as a crunchier, more lively alternative to breadcrumbs. It’s a dish just as fitting to eat on the couch as it is with company.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bonappetit.com/story/this-3-ingredient-smoky-sauce-improves-any-bowl-of-noodles\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "create-a-salad-bar-in-your-fridge-with-these-amazing-organizers-they-r",
    "title": "Create a Salad Bar in Your Fridge with These “Amazing” Organizers (They’re on Sale!)",
    "category": "test",
    "subcategory": "6Food",
    "category_slug": "test/6food",
    "date": "2025-09-18",
    "excerpt": "independently select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.",
    "cover": "assets/img/cover-fallback.jpg",
    "source": "https://www.thekitchn.com/ykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+main",
    "source_domain": "thekitchn.com",
    "source_name": "Thekitchn",
    "author": "Megan Gray",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Create a Salad Bar in Your Fridge with These “Amazing” Organizers (They’re on Sale!)</h1>\n    <p><a href=\"https://www.thekitchn.com/about/the-kitchn-commerce-guidelines\">independently</a>select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.</p>\n    <p>I dream about a perfectly <a href=\"https://www.thekitchn.com/best-fridge-organizers-23607780\">organized refrigerator</a> and pantry, where everything is clearly visible and nothing is wasted. But I haven’t found the <a href=\"https://www.thekitchn.com/refrigerator-organizers-266097\">right containers</a> to make that a reality — until now. Available as a 10-pack, the <a href=\"https://www.amazon.com/Refrigerator-Organizer-Stackable-Countertops-Vegetable/dp/B0B6HXQV6N/?asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">Ykioke Refrigerator Pantry Organizer Bins</a> have a clear and stackable design that makes it easy to see and store fruit, vegetables, freezer items, snacks, and more. They also include lids!</p>\n    <p>And the best part? They’re <strong>on sale at Amazon, bringing the price down from $27.99 to $23.99</strong>. This is a deal that you just can’t miss, so snag these bins now.</p>\n    <h2>What Are the Ykioke Refrigerator Pantry Organizer Bins?</h2>\n    <p>The <a href=\"https://www.amazon.com/Refrigerator-Organizer-Stackable-Countertops-Vegetable/dp/B0B6HXQV6N/?asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">Ykioke Refrigerator Pantry Organizer Bins</a> are plastic storage containers that can tidy up your fridge, pantry, kitchen cabinets, and more. They include three different sizes (one large, three medium, and six small), and the large bin features a drain hole for emptying out excessive water after washing fruits or vegetables. Everything easily stacks, and the side handles are convenient for pulling the organizers in and out. They’re also ideal for prepping ingredients: reviewers rave that you can create a “salad bar in your refrigerator.”</p>\n    <p>So if you want to declutter your fridge or pantry, and make meal prep a breeze, add these <a href=\"https://www.amazon.com/Refrigerator-Organizer-Stackable-Countertops-Vegetable/dp/B0B6HXQV6N/?asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">organizer bins</a> to your cart. They won’t last long!</p>\n    <h2>What Amazon Shoppers Are Saying</h2>\n    <p>\n      <strong>Average Rating: 4.4 / 5</strong>\n    </p>\n    <p>“Amazing product for my mini fridge, definitely a lifesaver for organizing and maximizing the small space available. Definitely recommend for any mini fridge optimization.” — <a href=\"https://www.amazon.com/gp/customer-reviews/R2KZKK7ZOA7I7B/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&amp;asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">Jeyson Diaz</a></p>\n    <p>“These really made a difference in the lifetime of my fruit and veggies. Nice to prep and have fruit to just grab and eat.” —<a href=\"https://www.amazon.com/gp/customer-reviews/R2CWMN1J50GPBQ/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8&amp;asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">jessica</a></p>\n    <p>“These are nice, sturdy, clear plastic containers with covers. They work really well for creating a salad bar in your refrigerator.” —<a href=\"https://www.amazon.com/gp/customer-reviews/R126RBCQJU8GKE/ref=cm_cr_getr_d_rvw_ttl?ie=UTF8&amp;asc_campaign=KT-23746282&amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282&amp;asc_source=%7BREFERRAL_SOURCE%7D&amp;tag=kitchn-20\">PK</a></p>\n    <p>\n      <strong>Buy:  Ykioke 10-Pack Refrigerator Pantry Organizer Bins, $23.99 (normally $27.99)</strong>\n    </p>\n    <h2>Cook/Shop</h2>\n    <p>A weekly newsletter to keep you up to date on all the latest cooking gadgets, must-have kitchen tools, and can’t-miss sales to shop.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.thekitchn.com/ykioke-refrigerator-pantry-organizer-bins-amazon-deal-september-2025-23746282?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+main\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "why-i-loved-slow-decorating-my-kitchen",
    "title": "Why I Loved \"Slow Decorating\" My Kitchen",
    "category": "test",
    "subcategory": "6Food",
    "category_slug": "test/6food",
    "date": "2025-09-18",
    "excerpt": "independently select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.",
    "cover": "assets/img/cover-fallback.jpg",
    "source": "https://www.thekitchn.com/slow-decorating-for-kitchen-23746320?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+main",
    "source_domain": "thekitchn.com",
    "source_name": "Thekitchn",
    "author": "Dana McMahan",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Once I Tried the “Slow Decorating Rule” in My Kitchen, I Decided to Use It in Every Room</h1>\n    <p><a href=\"https://www.thekitchn.com/about/the-kitchn-commerce-guidelines\">independently</a>select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.</p>\n    <p>There’s something I just love about <a href=\"https://www.thekitchn.com/best-kitchen-makeovers-apartment-therapy-23111166\">before and after kitchen transformations</a> — it’s just so satisfying to see a complete makeover unfold. I renovated my last house in 49 days, including a <a href=\"https://www.apartmenttherapy.com/kitchen-renovation-exposed-brick-ba-37341777\">dramatic gut job remodel of the kitchen</a>, and it felt <i>good</i> (although highly not recommended in that time frame!). In my current home, a mid-century tri-level with a <a href=\"https://www.instagram.com/p/C58WAgJOFy7/?img_index=1\">vintage pink wall oven</a> in the kitchen, things are going a little (okay, a <i>lot</i>) slower. </p>\n    <p>It’s equal parts budget constraints and just being tired from several years of pretty <a href=\"https://www.apartmenttherapy.com/reno-diaries-victorian-kitchen-gut-renovation-louisville-kentucky-37404521\">relentless renovation work</a>. All I want to do is just relax at home (a novel concept, no?). But luckily, the kitchen is pretty great as it is. There’s definitely a wish list underway (those 70-year-old <a href=\"https://www.thekitchn.com/love-letter-formica-23508520\">Formica counters</a> are showing their age, and the busy black-and-white vinyl floor the previous owners installed isn’t quite the vibe we want), but there’s simply no urgency. </p>\n    <p>Regardless of the reason, I’m really leaning into the whole “slow decorating” movement. <strong>This idea, which shouldn’t be revolutionary, but kind of is in our immediate gratification and algorithm-fueled lives, encourages us to take some breathing room when it comes to making our homes our own.</strong> It also dovetails nicely with the no-demo-reno approach designer Jessica Rhodes shared from <a href=\"https://www.thekitchn.com/how-to-update-kitchen-without-gut-renovation-23649304\">her own stunning kitchen redo</a>; her thoughts on kitchen design really resonated with me.</p>\n    <p>This approach has been <a href=\"https://www.apartmenttherapy.com/slow-decor-slow-home-37091950\">gaining steam</a> for a little while now, but this is the first time I’ve found myself in a place that it feels not only right, but also necessary. There’s no budget for tearing out the kitchen — and it doesn’t need it! That means I get to settle into it, learn how to work in it, and spend some time thinking about what would make our little household happiest to change. The seriously vintage electric coil cooktop, for instance? We’re not ready to upgrade our cookware collection for induction-friendly goods, so we’re swapping that for a gas cooktop (scored as a floor model at The Home Depot for $250!). The grubby, beat-up sink? Pretty high on the priority list to upgrade. We can take our time and save some money for the floor. </p>\n    <p>The only things we’ve done so far are paint the walls and cabinets, change one light fixture (<a href=\"https://www.menards.com/main/lighting-ceiling-fans/indoor-lighting/flush-mount-lights/patriot-lighting-reg-moosa-led-flush-mount-ceiling-light/63905/p-1642874299155817-c-7496.htm\">Menards for the $50 win</a>!), and had some shelves made. Oh, and there was no fridge so we had to buy a new one. I haven’t picked <a href=\"https://www.thekitchn.com/kitchen-hardware-trends-out-23654271\">cabinet hardware</a> yet, let alone a backsplash. The truth is that none of this matters to anyone but us, and we’ve been happily hosting friends and families for meals or drinks, and guess what? Nobody minds that the kitchen is a work in progress.</p>\n    <h2>Why I Love “Slow Decorating” My Kitchen</h2>\n    <p>There’s a sense of relief that comes with not having to make dozens of decisions, with not needing to figure out how and where to cook with a kitchen that’s out of commission during a renovation, with just … going with the flow. And I know that when we’re ready to update some things, we’re making decisions based on what matters most, and choosing what we actually <i>like</i>, rather than frantically picking from what’s available right this minute.</p>\n    <p>This leaves time for inspiration to appear in unexpected places. In Detroit recently, we stayed in an <a href=\"https://danamcmahan.substack.com/p/with-love-from-detroit\">incredibly restored building</a>, the <a href=\"https://www.instagram.com/p/C8zkYB-u_1A/\">Book Tower</a>, where the French restaurant <a href=\"https://www.lesupremedetroit.com/\">Le Suprême</a> has an open kitchen near the lobby. My husband and I paused there every time we walked in to admire the kitchen, particularly the gorgeous, chunky wood countertop in an unusual reddish hue. I didn’t know I wanted <a href=\"https://www.thekitchn.com/all-about-butcher-block-countertopscountertop-spotlight-166471\">butcher block</a>, but the moment I saw that kitchen, the decision was made. With the luxury of time, I tracked down the designer (<a href=\"https://www.stokesarch.com/\">Stokes Architecture &amp; Design</a>) and got sourcing info (it’s a <a href=\"https://www.johnboos.com/products/countertops/walnut-countertops/\">John Boos walnut number</a> that you can bet is going on the vision board!).<br/>The kitchen as it stands now is comfortable, it’s homey, it’s completely fine. We’ll improve it slowly, over time, knowing that every element that goes in was chosen with intention and inspiration, that it truly reflects us, and that we’re not just buying things for the sake of checking the box and moving to what’s next. There might not be a dramatic before and after for a while (or maybe ever!), but that’s more than OK with us.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.thekitchn.com/slow-decorating-for-kitchen-23746320?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+main\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "cans-changed-craft-beer-forever-what-comes-next",
    "title": "Cans Changed Craft Beer Forever. What Comes Next?",
    "category": "test",
    "subcategory": "12Drink",
    "category_slug": "test/12drink",
    "date": "2025-09-18",
    "excerpt": "Will craft beer lovers still host “bottle shares” if bottles themselves cease to exist? That may sound like a modern-day Zen koan, but it’s not exactly beyond contemplation.",
    "cover": "https://vinepair.com/wp-content/uploads/2025/09/craft-beer-cans-social.jpg",
    "source": "https://vinepair.com/articles/cans-changed-american-craft-beer-whats-next/",
    "source_domain": "vinepair.com",
    "source_name": "Vinepair",
    "author": "Evan Rail",
    "rights": "Unknown",
    "body": "<p>Will craft beer lovers still host “bottle shares” if bottles themselves cease to exist? That may sound like a modern-day Zen koan, but it’s not exactly beyond contemplation.</p>\n<p>This summer, cans made up about <a href=\"https://www.brewersassociation.org/insights/a-good-time-to-be-single-2024-packaging-trends/\">76 percent</a> of craft beer’s slipping retail sales, according to the Brewers Association, with glass dropping to just 24 percent, a major shift from where things were less than a generation ago. Back in 2013, bottles were so ubiquitous in the craft beer world that beer-focused meetups were understandably named after them, and the folks at Sam Adams could make <a href=\"https://www.forbes.com/sites/larryolmsted/2013/05/01/craft-beers-say-hello-cans-goodbye-bottles-an-aluminum-revolution/\">headlines</a> for simply planning to “do something they have never done in this country in their 29 years of existence: sell beer in a can.”</p>\n<p>Things have shifted substantially since the days of the second Obama administration, to put it mildly, with cans moving from the new hotness to the industry standard. But as the pendulum swings to its furthest point, cans are evolving in new ways, while traditional glass bottles seem to be turning into a type of branding or a signifier unto themselves. Canning may have changed craft beer culture forever, but additional shifts are clearly coming down the pipe.</p>\n<h2>The Message of Craft Cans</h2>\n<p>OG craft beer fans remember the first ISO cans of the early days of the movement, starting with Dale’s Pale Ale, which Oskar Blues originally launched in its local market in 2002, followed a few years later by the brewery’s groundbreaking Ten Fidy, described as “a beer from a small Colorado brewery which has gained somewhat of a cult following lately, due to its scarcity” by an early reviewer in one <a href=\"https://blogaboutbeer.com/ten-fidy-one-imperial-stout/\">2008 blog pos</a>t. That was the first imperial stout anyone I knew saw in a can, and one of the early turning points for the spread of cans nationwide. Ten Fidy showed that cans could work for small breweries in that era, including styles beyond lawnmower beer, as Sayre Piotrkowski, an Advanced Cicerone and the executive director of the Bay Area Brewers Guild, recalls.</p>\n<p>“The can was novel and had charm when Oskar Blues was doing it way before everybody else,” he says.</p>\n<p>Cans grew steadily over the next decade, and by the time the pandemic started in early 2020, many if not most craft breweries were offering the same format — 4-packs of 16.9-ounce cans — for retail sales. Social distancing and pandemic restrictions pushed even more breweries into packaging for off-premise sales, almost universally in the same 4-packs. With just about every local brewery using the same packaging to sell its products at the retail level, the 4-pack itself started to mean something to consumers. “That format came to indicate, rightfully or wrongly, that this is fresh, local beer,” Piotrkowski says.</p>\n<p>Long after most craft brewers had switched to cans, one subset of the beer world conspicuously stuck to old-fashioned bottles: imports, especially those from traditional Old World producers. Eventually, however, that piece of the puzzle also fell into place. By December 2021, grocery store shoppers could also buy Saison Dupont — which claims a history dating to 1844 — in modern craft-beer 4-packs. Today, Dupont is selling about twice as much in the U.S. as it was before it added cans to its options, according to Lauren Summer, a senior manager at <a href=\"http://www.totalbeveragesolution.com\">Total Beverage Solution</a>, the brewery’s importer.</p>\n<p>“It’s honestly been a great resurgence for the brand,” she says. “Having that pack format is opening up doors for us.”</p>\n<blockquote>\n      <p>“Because the shipping is lighter, we’re able to bring the price point a little bit down. So that got us into some retailers that previously weren’t willing to give us a shot.”</p>\n    </blockquote>\n<p>Those doors include more on-premise sales — that is, bars and restaurants — that previously wouldn’t or couldn’t stock Saison Dupont in bottles. The packaged version is even leading to increased interest in the draft version.</p>\n<p>“Those pack formats are allowing us to get into on-premise accounts where we didn’t have a shot in the dark in the past,” Summer says. In part, she credits the familiarity of the packaging to more “craft-centric” outlets carrying the beer, instead of just “Belgian import” accounts.</p>\n<h2>Context Is Everything</h2>\n<p>Other importers are having similar experiences, though not always with the same approach. Like Total Beverage Solutions, <a href=\"http://www.specialtybeer.com\">D&amp;V International</a> now offers cans for a limited number of its European imports, after first experimenting with cans of St. Bernardus Wit in 2018. That beer was chosen because it was a relatively new style for the brewery and not among the importer’s leading sellers at the time, according to sales director James Curti.</p>\n<p>“Obviously, it worked tremendously well,” he says. “The cans made it one of our top SKUs.” Other beers from the brewery, including its annual Christmas Ale and St. Bernardus Tokyo, originally developed for the Japanese market, are now also available in cans. But with an eye on tradition, the Belgian producer has kept St. Bernardus Abt 12 and its other traditional ales in glass.</p>\n<p>One big benefit of importing cans from Europe is reduced weight and space, which led to Trader Joe’s recently agreeing to stock cans of the Christmas Ale.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://vinepair.com/articles/cans-changed-american-craft-beer-whats-next/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-state-of-the-margarita-in-los-angeles-by-the-numbers",
    "title": "The State of the Margarita in Los Angeles, by the Numbers",
    "category": "test",
    "subcategory": "13Drink",
    "category_slug": "test/13drink",
    "date": "2025-09-18",
    "excerpt": "In Los Angeles, the Margarita is more than a cocktail, it’s a lingua franca. It’s ordered by the pitcher at neon-lit cantinas, clarified and crystalline at fine dining restaurants, shaken with hibiscus on the Eastside or dosed with smoked pineapple distillate at one of the cit…",
    "cover": "https://punchdrink.com/wp-content/uploads/2025/09/Social-Margarita-Survey-Los-Angeles.jpg",
    "source": "https://punchdrink.com/articles/margaritas-los-angeles-cocktail-tequila/",
    "source_domain": "punchdrink.com",
    "source_name": "Punchdrink",
    "author": "Hillary Eaton",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>In Los Angeles, the Margarita is more than a cocktail, it’s a lingua franca. It’s ordered by the pitcher at neon-lit cantinas, clarified and crystalline at fine dining restaurants, shaken with hibiscus on the Eastside or dosed with smoked pineapple distillate at one of the city’s most ambitious cocktail bars. In a place where tequila is as common as traffic, the Margarita still dominates.</p>\n    <p>On a recent weekend, I asked bartenders across L.A. to share how Angelenos are ordering their Margaritas by tallying their sales for one night of service. The numbers don’t lie. At Matt Egan and Max Reis’ new Sherman Oaks hot spot, Daisy Margarita Bar, the namesake drink accounted for 424 orders. At Damian, Enrique Olvera’s Arts District restaurant, Margaritas made up nearly 70 percent of total cocktail sales and Bar Flores, in Echo Park, sold 32 pitchers,15 nonalcoholic variations and an impressive 220 by-the-glass Margaritas—the cocktail is alive and well in all its many forms. Even at a spirits-driven bar like the iconic cocktail haunt Thunderbolt, the Margarita still accounts for about one-fifth of all orders.</p>\n    <p>According to Jon Cross, GM and beverage director at Loreto, in Frogtown, where more than half of all orders are for Margaritas, the drink’s popularity is due to its specific geometry. “It’s the Platonic ideal of a sour. Spirit, citrus, sweetener, tuned for balance. Tequila’s grassy heat, lime’s sparkle, orange liqueur or agave’s cushion, then a salt rim that literally rewires your palate,” he says.</p>\n    <h6>A Survey of House Margs</h6>\n    <p>Every bar we surveyed has at least one Margarita on the menu, but the approaches vary. At Thunderbolt, the house take is La Frutera #3, a lush blend of tequila, guanábana, smoked pineapple distillate, pepita and cashew. Mírate’s best-seller is El Guero, an aguachile-inspired riff that plays like a Margarita in disguise. Daisy Margarita Bar pushes volume through signatures like the Salsa Verde Margarita (made with tomatillo, green chile and cilantro), while Bar Flores leads with its hibiscus-infused Pink Marg. At Valle, the crystal-clear, gold-dusted Maggie transforms the classic through milk-punch clarification.</p>\n    <h6>Spirit Choice</h6>\n    <p>Angelenos are more interested in what spirit goes into the mix more than ever before. As Cross put it, guests are chasing transparency: “‘Is it additive-free?’ is the new ‘salt or no salt?’” Tromba’s blanco tequila was the most common bottle for the job among surveyed bartenders, and Fortaleza was the most requested by name. For orders of the classic drink, about two-thirds of guests requested tequila, while one-third asked for mezcal.</p>\n    <h6>Salt Choice</h6>\n    <p>While most surveyed bars use a classic kosher salt rim, some cocktails, like the gold-dusted Maggie at Valle or the cinnamon sugar-garnished house Cadillac at Damian, get creative with it. Brynn Smith, at Bar Next Door, reports that customers are ordering Tajín rims more often than salt. And at Daisy, there are no salt rims whatsoever. Instead, the bar adds salt solution straight to the cocktail; they say this offers a perfectly balanced drink. For bars that do offer salt rims, very few customers (around one percent) request their Margarita without.</p>\n    <graphic src=\"https://punchdrink.com/wp-content/uploads/2025/09/Inline-Margarita-Survey-Los-Angeles.jpg\"/>\n    <h6>The Most Unhinged Margarita Orders</h6>\n    <p>Let’s get to why you’re really here: the downright unhinged requests. At Daisy Margarita Bar, one customer ordered a Casamigos Añejo Margarita with lime, lemon, orange juice and Citrus Splenda. At Mírate, a guest called for a version built on a half-pour of Fuenteseca 21-year Extra Añejo, no sweetener. Damian fielded a so-called French Margarita; as they put it: “Instead of Combier, they asked to substitute Chambord. We used crème de cassis instead and it was surprisingly quite tasty.” According to Smith at Bar Next Door, one bare-bones order is the most unhinged of all: just lime juice and tequila in the glass, a “skinny Margarita” of sorts.</p>\n    <h6>Finally, a Note on Skinny Margs</h6>\n    <p><a href=\"https://punchdrink.com/articles/skinny-margarita-just-wont-quit/\">Skinny Margaritas</a> accounted for about six percent of Margarita orders. Surveyed bartenders find the order perplexing. “Some people say no sugar and sub agave. Some want just lime and tequila. So [it’s] a lot of questions to ask,” says Karla Flores-Mercado of Bar Flores. Some mean less sugar, others no agave at all. Loreto’s Jon Cross calls the result “A palate bomb in a rocks glass,” and Valle is similarly confused with the order. He sums it up more dryly: “The skinny Marg; because self-care and self-sabotage pair beautifully with tequila.” </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://punchdrink.com/articles/margaritas-los-angeles-cocktail-tequila/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "andr-hueston-mack-in-2025-the-biggest-challenge-of-being-a-somm-is-hav",
    "title": "André Hueston Mack: ‘In 2025 the biggest challenge of being a somm is having a job’",
    "category": "test",
    "subcategory": "14Drink",
    "category_slug": "test/14drink",
    "date": "2025-09-18",
    "excerpt": "In an exclusive interview with db , celebrated somm and Maison Noir winemaker André Hueston Mack reveals what really happened to his Brooklyn wine bar, & Sons, after it seemingly dropped off the face of the earth in 2023. While he won’t completely rule out a relaunch, Mack adm…",
    "cover": "https://www.thedrinksbusiness.com/content/uploads/2025/09/Andre_Mack_Danielle_Simone-e1758204178399.jpeg",
    "source": "https://www.thedrinksbusiness.com/2025/09/andre-hueston-mack-in-2025-the-biggest-challenge-of-being-a-somm-is-having-a-job/",
    "source_domain": "thedrinksbusiness.com",
    "source_name": "Thedrinksbusiness",
    "author": "Amelie Maurice-Jones",
    "rights": "Unknown",
    "body": "<p>\n      <strong>In an exclusive interview with </strong>\n      <i>db</i>\n      <strong>, celebrated somm and Maison Noir winemaker André Hueston Mack reveals what really happened to his Brooklyn wine bar, &amp; Sons, after it seemingly dropped off the face of the earth in 2023. While he won’t completely rule out a relaunch, Mack admits ‘I lost myself in it’.</strong>\n    </p>\n<p>\n      <graphic src=\"https://www.thedrinksbusiness.com/content/uploads/2025/09/Andre_Mack_Danielle_Simone-427x640.jpeg\" alt=\"André Hueston Mack &amp; Sons Ham Bar what happened\"/>\n    </p>\n<p>“In 2025, the biggest challenge of being a sommelier is having a job,” André Hueston Mack tells<i> the drinks business. </i>With restaurant closures in America hitting a 7-year low in 2025, there are, simply, fewer jobs to go around.</p>\n<p>And when it comes to operating struggles, Mack gets it. Back in 2020, he launched his first-ever restaurant and wine bar, &amp; Sons Ham Bar, in Brooklyn. Heralded by <i> RESY </i>as a “buzzy neighbourhood magnet bursting with regulars”, with Mack proudly pledging to be “striving for more terroir, more pride in our roots, more distinction”, its future looked bright. But in 2023, the venue vanished from social media. With no official closure information online, </p>\n<p>So what happened? When it opened, the establishment was touted as a family affair, named after Mack’s four sons, with his wife, Phoebe Damrosch, co-running the show. “So here’s the hard part,” Mack tells <i>db</i>. “I lost myself in it. I was trying to keep it all together, then when I took a step back I realised I hadn’t shown up for my family in the way I wanted to.</p>\n<p>“It made me realise I was fighting too hard for something that was going to cost me something else. My entire life had been about having fun, and I’d gotten to a place where, if I wasn’t having fun, I didn’t do it anymore. I had lost sight of that.” Adding to that were <a href=\"https://www.thedrinksbusiness.com/2023/10/on-trade-sales-may-never-return-to-pre-pandemic-levels/\">post-pandemic pressures.</a> “It was hard to be a restaurant owner in Covid – it was a hard time being a human being. Interactions with people, how people acted, that was hard.”</p>\n<p>He admits it’s “very sad” but equally “not a tender thing”: “I don’t have a lot of pride hung up on it. It became one of those things where it was a big challenge and it wasn’t worth that challenge.” Will &amp; Sons ever return? “We’ll see.”</p>\n<p>Anything’s possible in a wine scene as dynamic and fast-moving as New York’s. And Mack has his finger (and nose and palate) on the pulse: he arrived in the city two decades ago, when big lists, baller bottles and classics – Burgundies, Bordeauxes and Champagnes – were a huge flex. “But New York has started pushing for more perspective,” he says, “you’re seeing lists with more growers, more regions”.</p>\n<p>Drinking wine has gone from ‘show and tell’ to ‘come and share’. “Now, it’s not about somebody buying a USD $2,000 bottle. There’s a more democratic approach of ‘wine for the people’. It’s not really a dinner without wine on the table, so it’s taking on a more European approach,” Mack explains.</p>\n<p>Nonetheless, exclusivity is still a draw, with punters buying less but trading up. “There’s an idea that people aren’t drinking heavy wines, but the big reds are slowly starting to creep back in,” Mack tells me. He notes a love for the local area, with Finger Lake wines taking off, as well as chilled reds and orange wines. <a href=\"https://www.thedrinksbusiness.com/2024/06/orange-wine-hipster-trend-or-global-phenomenon/\">Brushed off by some as a ‘hipster trend’</a>, Mack insists they’re not a fad: “They’re better made, more precise, and they’ve become part of the conversation in New York.”</p>\n<p>Looking forward, he thinks lists will tighten, becoming “less encyclopedic, more dinner party energy”. Once-obscure regions, like Canada and Santorini, are piquing curiosity. “The best thing about working as a somm in 2025 is the idea of going to a place, learning about a wine, being passionate, then coming back to your restaurant and telling those people’s story as it relates to the wine.”</p>\n<p>His zeal may have you thinking Mack was born with a glass of Pinot Noir in hand. But it was only after ditching a prestigious career with Citicorp Investment Services that he even considered wine. Having quit with no exit plan, he’d pass time “hanging out on the couch” in Texas, watching re-runs of American sitcom <i>Frasier</i>. It was the pompous brothers’ camaraderie around wine that “encouraged me to walk into a wine shop for the first time in my life.”</p>\n<p>Next, he returned to his old haunt, the Red Lobster, where he’d previously been a pot-washer, before heading to The Palm, San Antonio. “That’s where the flame started,” he looks back. “Every waking moment I was studying wine, understanding wine, serving it. Wine is the first place I felt curiosity mattered more than credentials. It’s history, it’s geography, it’s culture – all bottled up, and it connects people who might otherwise never sit at the same table.”</p>\n<p>Now, that restaurant’s just a footnote in the wine expert’s gold-varnished career: For years, he worked at <a href=\"https://www.thedrinksbusiness.com/2020/09/the-french-laundry-launches-lavish-us850-dining-experience/\">Thomas Keller’s famed French Laundry in Napa Valley</a> before moving to the east coast to run the beverage programme at Per Se – one of New York’s most prestigious tasting menu ventures. </p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.thedrinksbusiness.com/2025/09/andre-hueston-mack-in-2025-the-biggest-challenge-of-being-a-somm-is-having-a-job/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "american-limoncello-is-all-grown-up",
    "title": "American Limoncello Is All Grown Up",
    "category": "test",
    "subcategory": "15Drink",
    "category_slug": "test/15drink",
    "date": "2025-09-18",
    "excerpt": "<p>In the United States, a wave of excellent hyper-regional limoncellos are proving that the spirit has truly gone global. [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://www.wineenthusiast.com/culture/spirits/american-limoncello/\">Read More..…",
    "cover": "assets/img/cover-fallback.jpg",
    "source": "https://www.wineenthusiast.com/culture/spirits/american-limoncello/",
    "source_domain": "wineenthusiast.com",
    "source_name": "Wineenthusiast",
    "author": "Maria Yagoda",
    "rights": "Unknown",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.wineenthusiast.com/culture/spirits/american-limoncello/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-7-most-haunted-distilleries-in-the-u-s",
    "title": "The 7 Most Haunted Distilleries in the U.S.",
    "category": "test",
    "subcategory": "15Drink",
    "category_slug": "test/15drink",
    "date": "2025-09-18",
    "excerpt": "<p>These American distilleries are full of spirits—both of the paranormal and alcoholic variety. [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://www.wineenthusiast.com/culture/travel/us-haunted-distilleries/\">Read More...</a></p>\n<p>The post <…",
    "cover": "assets/img/cover-fallback.jpg",
    "source": "https://www.wineenthusiast.com/culture/travel/us-haunted-distilleries/",
    "source_domain": "wineenthusiast.com",
    "source_name": "Wineenthusiast",
    "author": "Kara Newman",
    "rights": "Unknown",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.wineenthusiast.com/culture/travel/us-haunted-distilleries/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "one-to-one-meetings-return-to-brewbound-live-2025-meet-with-key-bev-al",
    "title": "One-to-One Meetings Return to Brewbound Live 2025: Meet with Key Bev-Alc Retail Buyers and Distributors",
    "category": "test",
    "subcategory": "17Drink",
    "category_slug": "test/17drink",
    "date": "2025-09-18",
    "excerpt": "",
    "cover": "https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1.jpg",
    "source": "https://www.brewbound.com/news/events/brewboundlivewinter25/one-to-one-meetings-return-to-brewbound-live-2025-meet-with-key-bev-alc-retail-buyers-and-distributors",
    "source_domain": "brewbound.com",
    "source_name": "Brewbound",
    "author": "Brewbound.com Staff",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://www.brewbound.com/events/brewboundlivewinter25/one-to-ones\">\n        <graphic class=\"size-full wp-image-173314 aligncenter\" src=\"data:image/svg+xml,%3Csvg%20xmlns=\"http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20628'%3E%3C/svg%3E\" alt=\"Brewbound Live 2025\" width=\"1200\" height=\"628\" data-lazy-srcset=\"https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1.jpg 1200w, https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1-300x157.jpg 300w, https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1-1024x536.jpg 1024w, https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1-768x402.jpg 768w\" data-lazy-sizes=\"(max-width: 1200px) 100vw, 1200px\" data-lazy-src=\"https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18124035/BBL-1to1s_OG-1.jpg\"/>\n      </a>\n    </p>\n    <p>At <a href=\"https://www.brewbound.com/events/brewboundlive\">Brewbound Live</a> 2025 (December 10-11 in L.A.), the <a href=\"https://www.brewbound.com/events/brewboundlivewinter25/one-to-ones\">1:1 structured networking series</a> returns to connect brewers and brands with the retailers and distributors who shape market access and growth across the beer and beverage-alcohol landscape. It’s a chance to align early, sharpen your strategy and build the kind of relationships that matter in an evolving industry.</p>\n    <p>\n      <strong>What It Is</strong>\n    </p>\n    <p>Instead of chance encounters in the hallway, 1:1 meetings give attendees 10-minute, pre-scheduled conversations with leaders who allocate shelf space, shape portfolios and build distribution plans across key regions and national accounts. These curated meetings are subject to approval to ensure they’re productive for both parties. Space is limited so register early to have the best chance to secure time with your top choices.</p>\n    <p>\n      <strong>How It Works</strong>\n    </p>\n    <ul>\n      <li><strong>Who:</strong>Open exclusively to registered attendees</li>\n      <li><strong>What:</strong>10-minute, pre-scheduled, private conversations with retailers and distributors</li>\n      <li><strong>When:</strong>Meetings run throughout Dec 10+11 of Brewbound Live 2025 in a designated area</li>\n      <li><strong>How:</strong>Brewers and brands request meetings with specific retailers and distributors; requests are reviewed and approved to ensure the best matches</li>\n      <li><strong>Host commitment:</strong>Each host will take 10-30 meetings across the event</li>\n    </ul>\n    <p>Confirmed participants include leaders from Whole Foods Market, Breakthru Beverage, Sunset Distributing Company, Heimark Distributing LLC, with additional names to be announced in the coming weeks.</p>\n    <p>To participate, <a href=\"https://app.bevnet.com/event/brewboundlivewinter25/register?_gl=1*1fixv49*_gcl_aw*R0NMLjE3NTYyMjc5MTMuQ2p3S0NBand0clhGQmhCaUVpd0FFS2VuMTdibHNtZ0tsVVozQzc4V21vSXlzLU9tdm4wNV9NZmdRZ0NjVkx3bUJVYmdpVzNqYzh4bE9Sb0MzMDBRQXZEX0J3RQ..*_gcl_au*NTY2NjI5MjcxLjE3NTMxOTMwNTMuMjgyNDEyNzA2LjE3NTY5MTg4MjIuMTc1NjkxODgyMQ..&amp;_ga=2.211727637.1610153636.1756823552-2008455208.1755284545&amp;_gac=1.222440937.1756227888.CjwKCAjwtrXFBhBiEiwAEKen17blsmgKlUZ3C78WmoIys-Omvn05_MfgQgCcVLwmBUbgiW3jc8xlORoC300QAvD_BwE\">register for Brewbound Live 2025</a>. Early registration and hotel discounts are available now and early sign-up provides early access to meetings.</p>\n    <p>\n      <strong>Register for Brewbound Live 2025 (Dec. 10+11) &gt;&gt;</strong>\n    </p>\n    <p>Interested in hosting a meeting as an industry mentor? Fill out <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScmr4z82POS7gGVSf_BSH7ndPTxkMpYlE_OdnkWEIHPsfvDDg/viewform?usp=header\">this form.</a></p>\n    <p>\n      <strong>About Brewbound Live</strong>\n    </p>\n    <p>Brewbound Live is a key business event for beer and beverage alcohol professionals. Through editorial-led sessions, tactical breakout discussions, and high-value networking, we offer operators real insight, operational clarity, and actionable strategies. From M&amp;A and portfolio planning to distribution tactics and beyond-beer innovation, Brewbound Live equips leaders to navigate what’s next strategically, candidly, and ahead of the crowd.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.brewbound.com/news/events/brewboundlivewinter25/one-to-one-meetings-return-to-brewbound-live-2025-meet-with-key-bev-alc-retail-buyers-and-distributors\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "hard-italian-soda-bravazzi-chases-100k-cases-in-2025",
    "title": "Hard Italian Soda Bravazzi Chases 100k Cases in 2025",
    "category": "test",
    "subcategory": "17Drink",
    "category_slug": "test/17drink",
    "date": "2025-09-18",
    "excerpt": "Hard Italian Soda Bravazzi Chases 100k Cases in 2025 Justin Kendall Sep. 18, 2025 at 12:50 PM TweetRedditShareShareEmail Beyond BeerFMBs",
    "cover": "https://d1ynl4hb5mx7r8.cloudfront.net/wp-content/uploads/2025/09/18093826/brewbound_bravazzi_og.jpg",
    "source": "https://www.brewbound.com/news/hard-italian-soda-bravazzi-chases-100k-cases-in-2025",
    "source_domain": "brewbound.com",
    "source_name": "Brewbound",
    "author": "Justin Kendall",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Hard Italian Soda Bravazzi Chases 100k Cases in 2025 Justin Kendall Sep. 18, 2025 at 12:50 PM TweetRedditShareShareEmail Beyond BeerFMBs</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.brewbound.com/news/hard-italian-soda-bravazzi-chases-100k-cases-in-2025\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "this-couple-quit-their-9-5-to-work-on-a-floating-pizzeria-in-the-carib",
    "title": "This Couple Quit Their 9-5 To Work On A Floating Pizzeria In The Caribbean",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "When you think of a dream job, you might come up with athlete, actor, or firefighter. What you’re probably not imagining is working at a floating pizza restaurant in the middle of the Caribbean. But for engaged couple Jack Coutinho and Kinsey Brown , that seemingly far-fetched…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/photo-jul-26-2025-11-09-33-am-68c46752371ee.jpg",
    "source": "https://www.delish.com/food/a66069056/pizza-pi-floating-caribbean-restaurant/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<p>When you think of a dream job, you might come up with athlete, actor, or firefighter. What you’re probably <i>not</i> imagining is working at a floating pizza restaurant in the middle of the Caribbean. But for engaged couple <a href=\"https://www.instagram.com/alohawithus/\">Jack Coutinho and Kinsey Brown</a>, that seemingly far-fetched dream became a reality.</p>\n<p>The pair were living in Los Angeles with two kids under two when they realized they wanted to make a change. Coutinho worked in sales for a wine company while doing photography on the side. Brown was a preschool teacher, model, and home stager. “[We needed] a few jobs just to pay rent; everything over there is quite the hustle,”  Coutinho tells <i>Delish</i>.</p>\n<p>The couple was, understandably, burnt out. Their solution to breaking out of their routine? In May, they picked up and moved to the U.S. Virgin Islands. “We were looking to just get totally out of California,” Coutinho says. “Like, okay, what could be the opposite?”</p>\n<p>They quickly settled on moving to the Caribbean. Coutinho, who visited St. Thomas a few years prior, suggested the island in order to remain on U.S. soil and avoid any visa-related obstacles. The pair saved enough money to give themselves a cushion, booked flights, arranged childcare, and secured an apartment.</p>\n<p>The one thing they didn’t have was a lead for a new job. That changed a mere month before their departure when Coutinho found an open position at a pizza place. But <a href=\"https://pizza-pi.com/\">Pizza Pi</a> isn’t your average slice spot—it’s a 37-foot boat moored in St. Thomas’s Christmas Cove. </p>\n<p>“I showed my family and said, ‘Look at this cool job!’” Coutinho says. “My family was like ‘Is this real?’”</p>\n<p>It is indeed real. A little over a decade ago, a married couple in the yachting industry converted the vessel into a restaurant to fulfill their dream of running a pizza restaurant. Pizza Pi was once a limited, take-out-only operation to deliver to nearby boats. The business changed hands a few times before it was taken over in 2023 by its current owners, Wisconsin native and R.D.N. Katie Hackl, and her fiancé, Chris Cilliers.</p>\n<p>The couple expanded the business to include a floating seating area for guests to dine right on the cove’s crystal-blue waters. They built an extensive craft cocktail program and added a few items to the menu. The one thing they didn’t change was the pizza itself. “Sometimes when something’s not broken, you don’t mess with it,” Hackl explains.</p>\n<p>Pizza Pi’s unique and exciting concept has drawn employees from all corners of the world. Coutinho and Brown were no exception. “They just picked up the phone and called and said they were going to be on the island in a couple of weeks,” says Hackl. “So when [Jack] got down here, we did a trial day and [he] just knocked it out of the park from day one.”</p>\n<p>Brown had initially planned to watch the kids while hunting for a job elsewhere. A couple of weeks in, she decided to join Coutinho on the boat. “We ended up bringing her on, too,” says Hackl. “And they’re just a power couple.”</p>\n<p>“You’re in a great environment, you’re just talking to tourists all day and telling your story,” Brown says. “It almost feels like you’re not at work when you are at work.”</p>\n<p>That’s not to say that the work is easy. Each day at Pizza Pi starts at 9 a.m. when the crew loads up all the ingredients on land to bring to the restaurant on a dinghy. The rest of the morning involves preparing pizzas for guests by the time they open at 11 a.m.</p>\n<p>“The whole day is normally booked from like 11:30 to the end of the day, because there are so many charters that come in and out,” Brown says. The restaurant receives booking requests by text every morning, and the team works to fit each party into a reserved time slot. Those slots are usually fully booked within an hour of opening.</p>\n<p>Pizza Pi serves both small families and large charter boats with as many as 100 people. The team juggles orders for guests floating on the water and dozens of pizzas delivered to neighboring boats. “From when you leave the office in the morning to when you get to the boat to the end of the day, you just don’t stop moving,” Brown says.</p>\n<p>Her favorite part of the job is working behind the bar, where she can interact with guests and mix up fun frozen drinks. Her favorite is the Bushwhacker, a St. Thomas classic that tastes like a cross between a piña colada and a chocolate milkshake.</p>\n<p>Coutinho, on the other hand, loves cooking the pizzas. His favorite is the restaurant’s most popular: pepperoni. He also prepares specialty pizzas you can only find at Pizza Pi. The Peachy Goat, a crowd favorite, is a white pie with goat cheese, peaches, basil, balsamic, and honey.</p>\n<p>The work is rewarding, but not without obstacles. “We joke that owning a restaurant and owning a boat are two of the hardest things you can do,” Hackl says. The added challenge of tackling mechanical problems can make a day on the job even more difficult. But the extra effort is well worth it.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/food/a66069056/pizza-pi-floating-caribbean-restaurant/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "chicken-parmesan",
    "title": "Chicken Parmesan",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "Let us know how it went in the comments below!",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/chicken-parmesan-index-644042afa49de.jpg",
    "source": "https://www.delish.com/cooking/recipe-ideas/a51451/easy-chicken-parmesan-recipe/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<h2>Made This?</h2>\n<p>Let us know how it went in the comments below!</p>\n<p>Chicken Parm is one of those rare dishes that almost everyone can agree upon. While developing this recipe, I wondered: <i>Why are we, citizens of the world, so obsessed with chicken Parmesan?</i> After discussing with the food team, testing multiple variations, and summoning various <a href=\"https://www.delish.com/cooking/menus/g2616/italian-dinner-recipes/\">Italian</a> (-American) gods, I realized the reason is simple: It’s fatty, umami-licious, and has that perfect crispy AND melt-in-your-mouth texture. Though we’ve done it many different ways here, this classic recipe is the chosen one, the holy grail. It has everything you want in <a href=\"https://www.delish.com/cooking/recipe-ideas/g2972/chicken-weeknight-dinners/\">chicken</a> Parm, full stop—fried cutlets shrieking with crispiness, a perfect blend of <a href=\"https://www.delish.com/cooking/g40048963/mozzarella-recipes/\">mozzarella</a> and Parm, and a sauce that is full of life with basil and just enough sweetness. Read on to find out just how I achieved this:</p>\n<p><strong>What People Are Saying: </strong>“So I made this for my parents for a 'romantic date night' for a surprise, and the instructions were so well-detailed it was super easy to follow (I'm 12), so thank you so much, as the other recipes online were much more confusing!!” </p>\n<p>“Phenomenal recipe and easy to follow. Made this as the first meal in my college apartment (I never have cooked before this). Man, my roommates were impressed. Everything was full of flavor, and looked amazing. Thanks for such an easy to follow, delectable recipe!” <i>- andyh735</i> </p>\n<p><strong>• Olive Oil: </strong>I prefer to use extra-virgin olive oil to cook the onion and garlic in, while I use a more neutral oil to fry the chicken. Use your favorite olive oil here, or check out our list of the <a href=\"https://www.delish.com/kitchen-tools/cookware-reviews/g46931475/best-olive-oil-brands-ranked/\"> best olive oil brands</a>.</p>\n<p><strong>• Panko Bread Crumbs: </strong>Panko is what creates the crispy coating on the chicken Parmesan. To really ensure a crispy, even coating, I recommend adding even more panko than you need to your bowl (more panko is never a bad idea).<strong>• Parmesan: </strong>I use Parmesan in two ways here: I add it to the panko to create extra flavor, and to the shredded mozzarella for a richer cheese mixture. Panko doesn’t have a super strong flavor on its own, so the addition of Parmesan amps up the flavor and richness of the coating.<strong> </strong></p>\n<p>Like all good things, this recipe starts with cooking down chopped yellow onion and garlic in olive oil. I choose to cover the pot to speed up the process, occasionally stirring the garlic and onion to prevent burning. You’re looking for a few things when cooking your garlic and onions: they should taste sweet, be soft, and appear completely translucent. Once you’ve achieved the 3 golden rules, you’re ready to continue on your journey.</p>\n<p>Once your onion and garlic are good to go, it’s time to add in the main characters of the sauce show: crushed tomatoes and basil. Add in the basil leaf AND stem (it’s where all the flavor is!). Now, this isn’t a sauce that you can just leave alone—it requires a bit of babysitting. The tomato chunks will start to fall to the bottom, which makes them susceptible to burning. Stir the sauce occasionally to prevent any burning, and cook until the sauce is nice and thick. No one (especially me) wants a watery tomato sauce falling off the chicken Parm.</p>\n<p>Now, we’re on to the star of our show: the chicken cutlets. Once your cutlets are perfectly thin, it’s time to begin the dredging process. Create three stations: a flour station, an egg and water station, and a panko, Parmesan, and garlic powder station. I add freshly grated Parmesan and garlic powder to the panko to amp up the flavor; it takes the chicken cutlet experience to the next level.</p>\n<p>My tried-and-tested rule for this step: cover every <i>inch</i> of your chicken cutlets at every dredging station. For the flour and egg: cover every inch of the surface, then shake off any excess before moving on. </p>\n<p>With the panko, you can add more than you really need to make sure your entire cutlet is covered and crisp. To avoid ending this process with hands that look just like your chicken cutlets, I highly recommend having a “dry” hand and a “wet” hand while dredging. Use one hand to cover your cutlets in the flour and panko, and another to coat them in the egg mixture. No mess here!</p>\n<p>Repeat with every piece of chicken, then set them aside on a baking sheet as we prepare to fry.</p>\n<p>Before adding your chicken, heat the neutral oil until a thermometer registers 350°. If it smokes a bit, no stress—it’s all part of the plan. Add your cutlets one at a time, and fry until perfectly golden brown before flipping to the other side. If you’re shallow frying and the oil isn’t hitting every surface, I highly recommend basting your chicken with a spoon to ensure the chicken is well-fried and extra-crispy.</p>\n<p>After your chicken is golden-brown, crispy perfection, place them on a wire rack to let all the excess oil drip off. Now, it’s time to bring all of our characters together. Spoon some of your prepared marinara on top of your chicken, then add your prepared bowl of shredded mozzarella and Parmesan on top of the sauce. Now, it’s time to get cheesy.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/cooking/recipe-ideas/a51451/easy-chicken-parmesan-recipe/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "guava-margaritas",
    "title": "Guava Margaritas",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "While visiting family, I tasted a guava margarita and fell in love with the tropical flavors. I rushed home to create my own version! —Renee Page, Rochelle, Illinois",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg",
    "source": "https://www.tasteofhome.com/recipes/guava-margaritas/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Taste of Home Editorial Team",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>While visiting family, I tasted a guava margarita and fell in love with the tropical flavors. I rushed home to create my own version! —Renee Page, Rochelle, Illinois</p>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg\" alt=\"Guava Margaritas\"/>\n    <h1>Guava Margaritas</h1>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg\" alt=\"Guava Margaritas\"/>\n    <p>\n      <a href=\"https://www.tasteofhome.com/article/test-kitchen-approved/\">Test Kitchen Approved</a>\n    </p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>Ice cubes</li>\n      <li>2 cups guava nectar</li>\n      <li>1-1/2 cups tequila</li>\n      <li>1 cup fresh lime juice</li>\n      <li>1/2 cup simple syrup</li>\n      <li>1/4 cup triple sec</li>\n      <li>Lime wedges</li>\n      <li>Coarse sugar</li>\n    </ul>\n    <h3>Directions</h3>\n    <ul>\n      <li>In a pitcher filled with ice cubes, combine guava nectar, tequila, lime juice, simple syrup and triple sec. Stir until condensation forms on outside of the pitcher, 15-20 seconds.</li>\n      <li>Moisten rims of 8 margarita or cocktail glasses with lime wedges. Sprinkle sugar on a plate; dip rims in sugar. Immediately serve over ice in prepared glasses (use a spoon while pouring to hold ice cubes in pitcher).</li>\n    </ul>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Popular in the Community</p>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Reviews</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/recipes/guava-margaritas/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "muffaletta-dip",
    "title": "Muffaletta Dip",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "I love everything about a Muffaletta sandwich, so I just had to make it into a dip. It makes for a great party appetizer! —Courtney Stultz, Weir, Kansas",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg",
    "source": "https://www.tasteofhome.com/recipes/muffaletta-dip/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Taste of Home Editorial Team",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>I love everything about a Muffaletta sandwich, so I just had to make it into a dip. It makes for a great party appetizer! —Courtney Stultz, Weir, Kansas</p>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg\" alt=\"Muffaletta Dip\"/>\n    <h1>Muffaletta Dip</h1>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg\" alt=\"Muffaletta Dip\"/>\n    <p>\n      <a href=\"https://www.tasteofhome.com/article/test-kitchen-approved/\">Test Kitchen Approved</a>\n    </p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>8 ounces cream cheese, softened</li>\n      <li>2 teaspoons olive oil</li>\n      <li>1 teaspoon minced garlic</li>\n      <li>1 teaspoon red wine vinegar</li>\n      <li>1 teaspoon minced fresh parsley</li>\n      <li>1/2 cup chopped pitted green olives</li>\n      <li>1/4 cup chopped pitted Kalamata or Greek olives</li>\n      <li>1/4 cup chopped ripe olives</li>\n      <li>1/4 cup chopped roasted sweet red peppers</li>\n      <li>1/4 cup chopped pepperoncini</li>\n      <li>1 teaspoon capers, drained</li>\n      <li>Assorted crackers</li>\n    </ul>\n    <h3>Directions</h3>\n    <ul>\n      <li>In a small bowl, beat cream cheese, olive oil, garlic, red wine vinegar and parsley until well combined. Fold in olives, peppers, pepperoncini and capers. Serve with assorted crackers.</li>\n    </ul>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Popular in the Community</p>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Reviews</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/recipes/muffaletta-dip/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "q-a-david-wondrich-author-of-the-comic-book-history-of-the-cocktail",
    "title": "Q&A: David Wondrich, Author of The Comic Book History of the Cocktail",
    "category": "test",
    "subcategory": "11Drink",
    "category_slug": "test/11drink",
    "date": "2025-09-17",
    "excerpt": "Enjoy This Article? Sign up for our newsletter and get biweekly recipes and articles delivered to your inbox. arrow",
    "cover": "https://imbibemagazine.com/wp-content/uploads/2025/09/comic-book-of-history-of-the-cocktail-crdt-dean-kotz.jpg",
    "source": "https://imbibemagazine.com/qa-david-wondrich-author-of-the-comic-book-history-of-the-cocktail/",
    "source_domain": "imbibemagazine.com",
    "source_name": "Imbibemagazine",
    "author": "Caroline Pardilla",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Enjoy This Article? Sign up for our newsletter and get biweekly recipes and articles delivered to your inbox. arrow</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://imbibemagazine.com/qa-david-wondrich-author-of-the-comic-book-history-of-the-cocktail/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "drinks-may-finally-be-getting-their-the-bear-moment",
    "title": "Drinks May Finally Be Getting Their The Bear Moment",
    "category": "test",
    "subcategory": "13Drink",
    "category_slug": "test/13drink",
    "date": "2025-09-16",
    "excerpt": "It’s rare that drinks culture makes its way on-screen beyond the superficial—perhaps a bar as a backdrop for a date or a breakup, or a character getting too drunk as a plot point. This fall, though, I’m looking forward to checking out two new drinks-related shows and hearing w…",
    "cover": "https://punchdrink.com/wp-content/uploads/2025/09/Social-Black-Rabbit-House-Guinness-Netflix-Shows.jpg",
    "source": "https://punchdrink.com/articles/black-rabbit-house-of-guinness-netflix-shows-bartending/",
    "source_domain": "punchdrink.com",
    "source_name": "Punchdrink",
    "author": "Mary Anne Porto",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>It’s rare that drinks culture makes its way on-screen beyond the superficial—perhaps a bar as a backdrop for a date or a breakup, or a character getting too drunk as a plot point. This fall, though, I’m looking forward to checking out two new drinks-related shows and hearing what you think about them: <i>Black Rabbit</i> and <i>House of Guinness</i>, both on Netflix. </p>\n    <p>As my colleagues at Eater <a href=\"https://chicago.eater.com/2023/7/5/23774566/the-bear-fx-hulu-tv-show-chicago-restaurants-reviews-summary-coverage\">have seen with  The Bear</a>, a spotlight on the industry can have a lasting influence, which is sometimes fun (my friend’s dad says he recently “got into restaurants”—whatever that means—because of the show), and other times a little charged, exposing the cracks and toxicity behind the scenes. Last year, </p>\n    <p><i>Baby Reindeer,</i>a Netflix show about a bartender being stalked by a customer, elucidated something that civilians (those outside the industry, in</p>\n    <p><a href=\"https://punchdrink.com/articles/new-vocabulary-cocktail-bartending/\">bartender speak</a>) don’t always understand. It showed, plainly, that “bartending is an office that makes its holder a captive audience in a way that few other jobs do,” Rosie Schaap</p>\n    <p><a href=\"https://punchdrink.com/articles/baby-reindeer-netflix-show-bartending-bars/\">wrote for Punch</a>.</p>\n    <p>Here’s a preview of what’s to come:</p>\n    <p><i>House of Guinness</i><i>:</i><i>House of Guinness</i>, from the creator of Peaky Blinders, follows four adult children who, in the wake of their father’s death, inherit the Guinness brewery and all of the sociopolitical challenges that come with it. This, from what I can tell, sounds a little like if <i>Succession </i>were set in 1860s Dublin and revolved around one of the world’s most famous beer companies. </p>\n    <p><i>Black Rabbit</i><strong> :</strong> In this new drama, Jude Law plays the owner of a Manhattan restaurant that also has a VIP cocktail lounge and is on the verge of its big break. But when his brother (Jason Bateman) comes to town, so does </p>\n    <p><i>trouble.</i>Honestly, it sounds a little like</p>\n    <p><i>The Bear</i>if it were set in New York and more focused on nightlife.</p>\n    <p>Relatedly: Black Rabbit is <i>also</i> the name of <a href=\"https://blackrabbitbar.com/\">a pub in Brooklyn</a>—no official relation to the show. I asked Kent Lanier, the bar’s owner, what he thinks of the forthcoming series. “It’s all gravy,” he says. “If Jude Law and Jason Bateman want to come in, I’ll buy them a drink.”</p>\n    <p>\n      <i>This is an excerpt from our Saturday newsletter, a weekly dispatch from our editors on the latest news in the drinks world.  Subscribe for more takes like this in your inbox.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://punchdrink.com/articles/black-rabbit-house-of-guinness-netflix-shows-bartending/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "drink-like-a-pirate-the-tale-of-the-pirate-s-dream-cocktail",
    "title": "Drink Like a Pirate: The Tale of the Pirate’s Dream Cocktail",
    "category": "test",
    "subcategory": "11Drink",
    "category_slug": "test/11drink",
    "date": "2025-09-15",
    "excerpt": "Enjoy This Article? Sign up for our newsletter and get biweekly recipes and articles delivered to your inbox. arrow",
    "cover": "https://imbibemagazine.com/wp-content/uploads/2025/09/Mixopedia-pirates-dream-crdt-matty-newton.jpg",
    "source": "https://imbibemagazine.com/drink-like-a-pirate-the-tale-of-the-pirates-dream-cocktail/",
    "source_domain": "imbibemagazine.com",
    "source_name": "Imbibemagazine",
    "author": "Wayne Curtis",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Enjoy This Article? Sign up for our newsletter and get biweekly recipes and articles delivered to your inbox. arrow</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://imbibemagazine.com/drink-like-a-pirate-the-tale-of-the-pirates-dream-cocktail/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "22-easy-fall-recipes-for-busy-nights",
    "title": "22 Easy Fall Recipes for Busy Nights",
    "category": "test",
    "subcategory": "10Food",
    "category_slug": "test/10food",
    "date": "2025-09-12",
    "excerpt": "Easy fall dinners that are cozy, simple, and totally doable for busy weeknights. Soups, curries, casseroles, and more!",
    "cover": "https://pinchofyum.com/wp-content/uploads/Easy-Fall-Recipes-01-scaled.jpg",
    "source": "https://pinchofyum.com/easy-fall-recipes",
    "source_domain": "pinchofyum.com",
    "source_name": "Pinchofyum",
    "author": "Lindsay",
    "rights": "Unknown",
    "body": "<p>Easy fall dinners that are cozy, simple, and totally doable for busy weeknights. Soups, curries, casseroles, and more!</p>\n<p>\n      <a href=\"#respond\"/>\n    </p>\n<p>Fall feels like the best and busiest time of year! It’s the back-to-school transition, the arrival of evening activities, and all kinds of new routines. It feels like a lot, and somehow dinner still needs to be made!?</p>\n<p>These recipes are the weeknight lifesavers that I need when life feels a little crazy: cozy, simple, and very doable meals that don’t ask for much, but deliver big.</p>\n<p>Here are the easy fall dinners I’m making on repeat!</p>\n<h2>Easy Fall Dinner Recipes</h2>\n<h2>Instant Pot Spicy Short Rib Noodle Soup</h2>\n<p>Short ribs simmer away in an Instant Pot or slow cooker, and are served in bowls with tender noodles and lots of delicious broth! This is one of my all-time cold-weather favorites.</p>\n<h2>Ricotta Meatballs with the Crispy Topping</h2>\n<p>One of the most popular weeknight dinners on the site! Homemade ricotta meatballs baked under a blanket of crispy topping. Serve it with garlic bread or pasta!</p>\n<h2>Chicken with Coconut Kale</h2>\n<p>A luxurious-feeling but super easy one-skillet meal packed with protein! I love to serve this one over a pile of steamy rice.</p>\n<h2>Sausage, Kale, and White Bean Soup</h2>\n<p>Such a simple, delicious, and cozy soup! Herby Italian sausage, kale, smoky paprika, creamy beans and potatoes, and a splash of cream.</p>\n<h2>Steph’s Chickpea Curry with Spinach and Rice</h2>\n<p>Amazingly creamy, saucy chickpea curry served over rice with a dollop of chili crisp and a side of cucumber salad. Ready in 20 minutes!</p>\n<h2>Red Pepper Cashew Pasta with Roasted Cauliflower</h2>\n<p>Three-ingredient red pepper cashew sauce, roasted crispy cauliflower, and piles of noodles. Hearty and so delicious!</p>\n<h2>Butter Chicken Meatballs</h2>\n<p>Storebought (or homemade) chicken meatballs covered in a rich and mildly spiced tomato gravy that is made luxurious with just a little bit of butter and cream. One of my family’s absolute favorites!</p>\n<h2>Brandon’s Egg Roll Tacos</h2>\n<p>Egg rolls meet tacos! I love this! Easy to make and ridiculously good with a classic egg roll filling, crunchy veg, pillowy tortillas, and a spicy gochujang sauce.</p>\n<h2>Shortcut Sesame Butter Noodles</h2>\n<p>One of my favorite back-pocket recipes! Packaged noodles for ease, butter for creaminess, honey for sweetness, and sesame oil for depth. Just tangly slips of joy!</p>\n<h2>Chicken Wontons in Spicy Chili Sauce</h2>\n<p>Big, beautiful, bossy flavors! Shiitake mushrooms and chicken wontons swim in a brothy flavor-filled sauce and get finished with a swirl of sesame oil and chili crisp on top.</p>\n<h2>The Best Detox Crockpot Lentil Soup</h2>\n<p>This one is such a classic, and has been made so many times by so many of you! Lentils, squash, kale, and all sorts of soothing and nutritious things. Made in the crockpot so super hands-off, too!</p>\n<h2>Gnocchi with Creamy Mushroom Sauce</h2>\n<p>Delicious pillowy gnocchi swimming in a silky creamy sauce that’s laced with thyme and loaded with little slips of garlic butter-browned mushrooms! This is fall!</p>\n<h2>Life Changing Instant Pot Beef Stew</h2>\n<p>Six ingredients, 45 minutes, SO EASY. The perfect, comforting meal that’s filling, heart, and incredibly simple to make.</p>\n<h2>Chipotle Tahini Bowls</h2>\n<p>The chipotle tahini in this recipe is in my top 10 sauces of all time. It’s perfectly smoky, luxuriously creamy, and the perfect spicy combo with a pile of roasted sweet potatoes.</p>\n<h2>Crockpot Chicken Gnocchi Soup</h2>\n<p>Another crockpot favorite for fall soups! You let it simmer all day with chicken to make a delicious soup base, and then add creaminess and carby-ness with gnocchi before serving. Love this one!</p>\n<h2>Chicken Tortilla Soup</h2>\n<p>Just a basic and super delicious chicken tortilla soup! I could eat this every week, and the bonus is that it makes for excellent leftovers for lunch.</p>\n<h2>Three Cheese Baked Gnocchi with Spinach</h2>\n<p>This is so cheesy, cozy, and comforting and it really is a stunner all bubbled up in a skillet. Serve with bread and salad!</p>\n<h2>Instant Pot Wild Rice Soup</h2>\n<p>This really is the best wild rice soup (and as a Minnesotan, I know these things!). You can even add chicken too if that’s your thing, or keep it veg with mushrooms only. Either way, it’s not fall without it!</p>\n<h2>Instant Pot Minestrone Soup</h2>\n<p>This soup has a shocking amount of veggies! And packed with cannelini beans and cheese, it’s the perfect balance of nourishing and nutritious but also filling and comforting. Made all in one pot!</p>\n<h2>Spicy Peanut Soup with Sweet Potato + Kale</h2>\n<p>Another one of the most popular soups on the site! There’s something so magical about the sweet potatoes, coconut milk, and peanut butter coming together to make the most creamy (vegan!) bowl of deliciousness.</p>\n<h2>Red Curry Chicken Stir Fry with Spicy Cashew Sauce</h2>\n<p>Caramelized red curry chicken sits next to a bed of hot, fluffy rice and steamed broccoli and then totally sauced up with the BEST spicy cashew sauce. Ooof, this is so, so good.</p>\n<h2>Chicken Enchilada Casserole</h2>\n<p>A five-ingredient stacked enchilada casserole layered with tortillas, beans, and chicken and covered with cheese and enchilada sauce. Basic, easy, filling, and so good.</p>\n<h2>Little Things That Make Fall Cooking Easy</h2>\n<p>I have a few favorite tricks and tools to make dinner easier throughout the week. Here’s what I recommend checking out! <i>(FYI: Some links below are affiliate links!)</i></p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://pinchofyum.com/easy-fall-recipes\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "cabbage-and-halloumi-skewers",
    "title": "cabbage and halloumi skewers",
    "category": "test",
    "subcategory": "7Food",
    "category_slug": "test/7food",
    "date": "2025-09-09",
    "excerpt": "Every September, I step up onto my soapbox to report for my self-appointed duty — one part desperate, one part cantankerous — to remind us that summer isn’t over yet. I beg us to put away the decorative gourds and pumpkin spice for just a tiny bit longer. It’s a slippery slope…",
    "cover": "https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2025/09/cabbage-and-halloumi-skewers-6-scaled.jpg?fit=1200%2C800&#038;ssl=1",
    "source": "https://smittenkitchen.com/2025/09/cabbage-and-halloumi-skewers/",
    "source_domain": "smittenkitchen.com",
    "source_name": "Smittenkitchen",
    "author": "deb",
    "rights": "Unknown",
    "body": "<p>Every September, I step up onto my soapbox to report for my self-appointed duty — one part desperate, one part cantankerous — to remind us that summer isn’t over yet. I beg us to put away the decorative gourds and pumpkin spice for just a tiny bit longer. It’s a slippery slope from “hooray, scarves!” and “look at that perfect rainbow of a tree!” to a very long winter where I forget what warmth feels like on my skin and I am beseeching us not to wish it away. Or, I struggle with change? Hm, it’s hard to tell!</p>\n<p><graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54776341426_aa794e62a2_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"cabbage and halloumi skewers-4\"/><br/>\n<graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54776576208_eb8ae2330c_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"cabbage and halloumi skewers-3\"/></p>\n<p><br/>\nThese cabbage and halloumi skewers, like me, have their feet in both seasons: a heartier, warming vegetable but with flavors that still taste like weather warm enough to eat outside. If you haven’t grilled cabbage before, you’re in for a treat. Even on the most pathetic gas grill (i.e. mine), the thick leaves get a little sweet, a little smoky, and — as we’ve learned via <a href=\"https://smittenkitchen.com/2025/04/charred-salt-and-vinegar-cabbage/\">this charred salt and vinegar cabbage</a>, <a href=\"https://smittenkitchen.com/2019/11/roasted-cabbage-with-walnuts-and-parmesan/\">this roasted cabbage with walnuts and parmesan</a>, and <a href=\"https://smittenkitchen.com/2022/02/crispy-cabbage-and-cauliflower-salad/\">this crispy cabbage and cauliflower salad</a> — the more char, the better. Thin slices of salty halloumi are threaded between the chunks of cabbage and they, too, taste astoundingly good grilled. The cheese was, in fact, designed for it. Finally, we make an herby, punchy mixture with garlic, lemon, capers, and red pepper and brush it all over and then my husband and I stand in the kitchen and wolf it all down and forget why we’d want to eat anything else for dinner.</p>\n<p>\n      <graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54776676740_df7faec667_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"cabbage and halloumi skewers-9\"/>\n    </p>\n<p/>\n    <p><a href=\"https://smittenkitchen.substack.com/s/off-the-menu\"/>The Smitten Kitchen now has two newsletters! <graphic src=\"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2025/09/substack-otm-header.jpg?resize=300%2C60&amp;ssl=1\"/></p>\n<p><a href=\"https://smittenkitchen.substack.com/welcome\">The Smitten Kitchen Digest</a>, my many years running Monday newsletter, is for catching up on all things SK: what’s new, announcements, fun things to read, and seasonal menu suggestions.</p>\n<p><a href=\"https://smittenkitchen.substack.com/p/welcome-to-the-weekly-yap\">The Weekly Yap</a>, my new Friday newsletter, is all about everything off-the-menu and not always about cooking, like what I’m up to, into, great meals out, books, travel, and more.</p>\n<p><a href=\"https://smittenkitchen.substack.com/subscribe\">Sign up for both (free!) right here.</a>If you’re already a Monday newsletter subscriber, you can add the Friday newsletter via your</p>\n<p><a href=\"https://substack.com/settings\">Substack settings</a>&gt; Subscriptions &gt; The Smitten Kitchen Digest &gt; Slide the toggle next to Off-The-Menu to receive the emails.</p>\n<p/>\n    <p><graphic src=\"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2025/09/staub-smitten-kitchen-rainbow-braiser-square3.jpg?resize=250%2C250&amp;ssl=1\"/><strong>Big braiser news!</strong> In the 18 months since we launched the Staub x Smitten Kitchen Braiser, nothing has made me happier than seeing how many of you are cooking in it. It remains my forever, perfect pan — just the right size for weeknights, the right shape for sautéing, and the right depth for baking, roasting, and braising. Your number one request? More colors! And it’s finally happening. <a href=\"https://williams-sonoma.pdy5.net/YRxrZq\">The Staub x Smitten Kitchen Braiser is now sold exclusively through Williams-Sonoma</a>, which means that in addition to the original black, it comes in six! new! colors: Cranberry (bright red), Grenadine (deep red), Sage (light green), Basil (dark green), La Mer (dark blue-green), and Sapphire (dark blue). If you’re looking for inspiration for what to cook in your braiser, <a href=\"https://smittenkitchen.com/recipes/method/braiser/\">start here</a>!</p>\n<p/>\n    <p>\n      <graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54776676800_7b3aab34f3_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"cabbage and halloumi skewers-8\"/>\n    </p>\n<h3>Cabbage and Halloumi Skewers</h3>\n<ul>\n      <li>1 cup (1 ounce) packed fresh herbs, such as chives, parsley, and mint</li>\n      <li>1 tablespoon capers, drained</li>\n      <li>1 large lemon</li>\n      <li>2 garlic cloves</li>\n      <li>1 teaspoon kosher salt</li>\n      <li>1/2 to 1 teaspoon mild red pepper flakes</li>\n      <li>8 tablespoons olive oil, divided</li>\n      <li>1 8-ounce package halloumi, at room temperature so it’s easier to slice</li>\n      <li>1 to 1 1/4 pound green cabbage, cut into 1-to-2-inch chunks</li>\n    </ul>\n<p><strong>Make herb sauce:</strong>In a food processor or high-speed blender, pulse herbs, capers, finely grated zest of your lemon, salt, and pepper together until the herbs are finely chopped. Drizzle in 6 tablespoons of the olive oil with the machine running. Taste for seasoning and adjust to taste.</p>\n<p><strong>Assemble skewers:</strong> Cut halloumi block into 1/4-inch slices, then cut each slice in approximately 1-inch flat squares. If your halloumi is breaking a lot, you can soak the block in warm water for 5 to 10 minutes to soften it slightly, making it easier to slice.</p>\n<p>Thread chunks of cabbage and halloumi slices onto skewers, alternating the two for the length of the skewer. Brush skewers lightly with remaining 2 tablespoons olive oil. Halve your zested lemon.</p>\n<p><strong>Grill the skewers:</strong> Heat your grill to a high temperature. Arrange the skewers across the grill and cook until lightly charred underneath, then turn the skewers to char the next side. Brush the just-grilled parts with the herb oil, continuing to turn the skewers until they’re charred on all sides and you’ve used all of the oil. You can put the lemon halves on the grill as well to grill them. Squeeze the lemon halves over the skewers and enjoy them as soon as possible.</p>\n<p><strong>No grill?</strong> You can arrange the skewers on a baking sheet and run them under your oven’s broiler, turning and brushing them as you would on the grill.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://smittenkitchen.com/2025/09/cabbage-and-halloumi-skewers/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "apple-pancakes",
    "title": "Apple Pancakes",
    "category": "test",
    "subcategory": "9Food",
    "category_slug": "test/9food",
    "date": "2025-09-09",
    "excerpt": "This apple pancake recipe features freshly grated apple and ground cinnamon. These apple pancakes are wholesome, delicious and easy to make!",
    "cover": "https://cookieandkate.com/images/2025/09/apple-pancakes.jpg",
    "source": "https://cookieandkate.com/apple-pancakes/?adt_ei=*|EMAIL|*",
    "source_domain": "cookieandkate.com",
    "source_name": "Cookieandkate",
    "author": "Kathryne Taylor",
    "rights": "Unknown",
    "body": "<p>This apple pancake recipe features freshly grated apple and ground cinnamon. These apple pancakes are wholesome, delicious and easy to make!</p>\n<p>\n      <a href=\"https://cookieandkate.com/about/\">\n        <graphic data-pin-nopin=\"nopin\" alt=\"Kathryne Taylor\" src=\"https://cookieandkate.com/images/2024/10/cropped-kathryne-taylor-200-40x40.jpg\" srcset=\"https://cookieandkate.com/images/2024/10/cropped-kathryne-taylor-200-80x80.jpg 2x\" class=\"avatar avatar-40 photo\" height=\"40\" width=\"40\" decoding=\"async\"/>\n      </a>\n    </p>\n<p>Posted by <a href=\"https://cookieandkate.com/about/\">Kathryne Taylor</a> on  September 9, 2025</p>\n<p>When you buy through our links, we may earn a commission. <a href=\"https://cookieandkate.com/affiliate-discretion/\">Learn more</a></p>\n<p><strong>Let’s celebrate the cooler weather with a stack of warm apple pancakes!</strong> These apple-flavored pancakes are the perfect autumnal breakfast treat. They’re a simple weekend breakfast project that keeps well for quick weekday mornings (they freeze and thaw well, too). </p>\n<p><strong>This apple pancake recipe is made from scratch with freshly grated apple,</strong> which is enhanced by a touch of ground cinnamon. Tart apples like Honeycrisp or Granny Smith offer the most impactful flavor. You’ll see that I used Honeycrisp apples in this batch—they’re our family’s favorite, and they yield terrific pancakes. </p>\n<p>You might already have everything you need to make these pancakes in your pantry. Let’s make some.</p>\n<h2>Apple Pancake Tips</h2>\n<p>You’ll find the full recipe below. Here are a few tips to help achieve pancake success.</p>\n<p><strong>Flour options include white whole wheat flour, regular whole wheat flour or all-purpose flour.</strong> I try to use whole-grain flours when I can, but all-purpose flour offers the most neutral flavor, allowing the apple to shine. Otherwise, you can use white whole wheat flour (now called “golden wheat” by King Arthur Flour) for all of the nutrition of whole wheat without the nutty flavor. </p>\n<p><strong>Lightly coat your griddle or skillet with oil.</strong> I cook my pancakes with avocado oil because it offers a high smoke point and neutral flavor (butter burns quickly). Whichever you use, be sure to wipe off the excess with a paper towel so it doesn’t start smoking.</p>\n<p><strong>Start by cooking just one pancake.</strong> Once you’ve practiced with one pancake and ensured that your skillet is adequately preheated, you can make more at once. Leave a couple of inches between each pancake to allow for easy flipping.</p>\n<p><strong>The pancakes are ready to flip when about 1/2-inch of the perimeter has turned from glossy to matte.</strong> The underside should be nicely golden at this point. If you’re uncertain, it’s best to wait a little longer than end up with a doughy mess.</p>\n<p><strong>As time goes on, dial down the heat.</strong> The skillet gets hotter the longer it’s on the stove. If your pancakes are burning on the outside before they are cooked through on the inside, your skillet is too hot. Turn down the heat a bit after every few pancakes.</p>\n<h3>Watch How to Make Apple Pancakes</h3>\n<h2>Pancake Serving Suggestions</h2>\n<p>These apple-infused pancakes are lovely with a drizzle of maple syrup, but even better with something extra. Here’s a list of toppings or sides to consider:</p>\n<ul>\n      <li><a href=\"https://cookieandkate.com/homemade-almond-butter-recipe/\">Almond butter</a>,<a href=\"https://cookieandkate.com/pecan-butter-recipe/\">pecan butter</a>(my top pick) or<a href=\"https://cookieandkate.com/peanut-butter-recipe/\">peanut butter</a></li>\n      <li>Butter</li>\n      <li>Diced apples or warm <a href=\"https://cookieandkate.com/how-to-make-applesauce/\">homemade applesauce</a></li>\n      <li>Greek yogurt</li>\n      <li>Maple syrup</li>\n      <li>\n        <a href=\"https://cookieandkate.com/perfect-scrambled-eggs/\">Scrambled eggs</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/best-whipped-cream-recipe/\">Whipped cream</a>\n      </li>\n    </ul>\n<h2>More Apple Recipes to Enjoy</h2>\n<p>Here are a few more classic <a href=\"https://cookieandkate.com/tag/apples/\">apple recipes</a> to make this autumn:</p>\n<ul>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-gluten-free-apple-crisp/\">Apple Crisp</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/favorite-green-salad-with-apples-cranberries-and-pepitas/\">Favorite Green Salad with Apples, Cranberries and Pepitas</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-apple-muffins-recipe/\">Healthy Apple Muffins</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/how-to-make-applesauce/\">How to Make Applesauce</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/baked-apples-recipe/\">Perfect Baked Apples</a>\n      </li>\n    </ul>\n<p><strong>Please let me know how your pancakes turn out in the comments!</strong> I love hearing from you. You can find more <a href=\"https://cookieandkate.com/category/food-recipes/breakfast/pancakes/\">pancake recipes here</a>. </p>\n<h2>Apple Pancakes</h2>\n<p>This apple pancake recipe incorporates freshly grated apple and ground cinnamon. These apple pancakes are wholesome, delicious and easy to make. Recipe yields 8 to 9 pancakes.</p>\n<h3>Ingredients</h3>\n<ul>\n      <li>1 cup buttermilk or make your own*</li>\n      <li>1 cup <a href=\"https://www.target.com/p/king-arthur-flour-unbleached-white-whole-wheat-flour-5lbs/-/A-14776414\">white whole wheat flour</a>or regular whole wheat flour or all-purpose flour</li>\n      <li>1 ½ teaspoons baking powder</li>\n      <li>½ teaspoon baking soda</li>\n      <li>¼ teaspoon ground cinnamon</li>\n      <li>¼ teaspoon salt</li>\n      <li>1 large egg</li>\n      <li>2 tablespoons unsalted butter, melted</li>\n      <li>2 tablespoons maple syrup or honey</li>\n      <li>1 teaspoon pure vanilla extract</li>\n      <li>1 cup grated Honeycrisp or Granny Smith apple (about 1 medium)</li>\n      <li>Avocado oil or vegetable oil, for greasing the pan</li>\n    </ul>\n<h3>Instructions</h3>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cookieandkate.com/apple-pancakes/?adt_ei=*|EMAIL|*\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "single-serve-cottage-cheese-pancake",
    "title": "Single Serve Cottage Cheese Pancake",
    "category": "test",
    "subcategory": "10Food",
    "category_slug": "test/10food",
    "date": "2025-09-05",
    "excerpt": "A cottage cheese pancake with a souffle-like texture with a golden, buttery edge and fluffy rich insides. SO GOOD. And 15 grams of protein, too!",
    "cover": "https://pinchofyum.com/wp-content/uploads/Single-Serve-Cottage-Cheese-Pancake.jpg",
    "source": "https://pinchofyum.com/single-serve-cottage-cheese-pancake",
    "source_domain": "pinchofyum.com",
    "source_name": "Pinchofyum",
    "author": "Lindsay",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>A cottage cheese pancake with a souffle-like texture with a golden, buttery edge and fluffy rich insides. SO GOOD. And 15 grams of protein, too!</p>\n    <h1>Single Serve Cottage Cheese Pancake</h1>\n    <p>\n      <a href=\"#respond\"/>\n    </p>\n    <h2>News Flash: Cottage Cheese Makes An Amazing Pancake.</h2>\n    <graphic src=\"https://pinchofyum.com/wp-content/uploads/Lindsay-Post-Notes-960x960.jpg\" alt=\"Lindsay Ostrom headshot. \"/>\n    <p>Guys, this cottage cheese pancake is really something.</p>\n    <p>It’s got a souffle-like texture with a golden, buttery edge and fluffy, rich insides – and I never would have expected myself to love something like this so much (what?! cottage cheese! <a href=\"https://pinchofyum.com/my-new-favorite-pizza-has-a-cottage-cheese-crust\">not again</a>!). But whipping up one of these pancakes for myself after getting the girls off to school is just a real joy and delight in my life right now.</p>\n    <p>This is a pancake for one person, and it will need to be fried in butter, because that is the law. With just the right heat, it’s going to get this golden, crispy, extremely beautiful exterior that makes it look like a pancake you’d be getting from a bougie brunch spot in New York City. Except… it’s you. In your house. In your pajamas.</p>\n    <p>I do not make this pancake for health reasons – I just love the taste and texture. But I know many of us have protein on the radar, and this girl packs in a nice solid 15 grams of protein for us. Thank you, ma’am!</p>\n    <p>This is a fun one. I hope you love it.</p>\n    <graphic src=\"https://pinchofyum.com/wp-content/uploads/lindsay-signature-notes.png\" alt=\"Lindsay signature.\"/>\n    <graphic src=\"https://pinchofyum.com/wp-content/uploads/Single-Serve-Cottage-Cheese-Pancake-Square-183x183.jpg\" alt=\"A picture of Single Serve Cottage Cheese Pancake\"/>\n    <h2>Single Serve Cottage Cheese Pancake</h2>\n    <ul>\n      <li>Total Time: 7 minutes</li>\n      <li>Yield: 1 big, wonderful pancake! 1x</li>\n    </ul>\n    <h3>Description</h3>\n    <p>A cottage cheese pancake with a souffle-like texture with a golden, buttery edge and fluffy rich insides. SO GOOD. And 15 grams of protein, too!</p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>1/4 cup <strong>cottage cheese</strong><i>(4% milkfat)</i></li>\n      <li>1 large <strong>egg</strong></li>\n      <li>2 tablespoons <strong>all-purpose flour</strong><i>(or 2 1/2 tablespoons gluten free all-purpose flour)</i></li>\n      <li>1/2 teaspoon <strong>baking powder</strong></li>\n      <li>teeny tiny bit of <strong>salt</strong><i>(let’s say 1/8 teaspoon)</i></li>\n      <li>1/2 tablespoon <strong>butter</strong>for frying</li>\n      <li><strong>maple syrup</strong>and<strong>butter</strong>for serving</li>\n    </ul>\n    <h3>Instructions</h3>\n    <ul>\n      <li><strong>Make Batter:</strong>In this order, add cottage cheese, egg, flour, baking powder, and salt to a blender and blend until smooth.<i>(I use the</i><a href=\"https://geni.us/NsuejE\">Beast Mini Blender</a>– affiliate link)</li>\n      <li><strong>Melt Butter:</strong>Heat a nonstick pan over medium-high heat for a minute or so. Add the butter until melted.</li>\n      <li><strong>Cook Pancake:</strong>Pour pancake batter into the pan (I do enjoy one mega, buttery, super large pancake so I do this all in one, hence the single serve).</li>\n      <li><strong>Flip and Finish:</strong>Cook until bubbles form on top, about 1-2 minutes. Check underneath to ensure it’s nice and golden, then flip and finish for 1-2 minutes longer.</li>\n      <li><strong>Serve:</strong>Serve with butter and maple syrup, or whatever toppings you like!</li>\n    </ul>\n    <h3>Equipment</h3>\n    <p>\n      <a href=\"https://amzn.to/4l8IsOZ\">\n        <graphic loading=\"lazy\" decoding=\"async\" src=\"https://m.media-amazon.com/images/I/41N9IGvOHUL._SL500_.jpg\" height=\"500\" width=\"500\" class=\"attachment-thumbnail tasty-links-image-url\" data-pin-nopin=\"true\" alt=\"Image of Basalt Nonstick Pans\"/>\n      </a>\n    </p>\n    <graphic src=\"https://m.media-amazon.com/images/I/41N9IGvOHUL._SL500_.jpg\" alt=\"Image of Basalt Nonstick Pans\"/>\n    <p>\n      <a href=\"https://amzn.to/4l8IsOZ\">Buy Now →</a>\n    </p>\n    <p>\n      <a href=\"https://amzn.to/4lDWZCZ\">\n        <graphic loading=\"lazy\" decoding=\"async\" src=\"https://m.media-amazon.com/images/I/31yQtx2foWL._SL500_.jpg\" height=\"500\" width=\"500\" class=\"attachment-thumbnail tasty-links-image-url\" data-pin-nopin=\"true\" alt=\"Image of Beast Mini Blender\"/>\n      </a>\n    </p>\n    <graphic src=\"https://m.media-amazon.com/images/I/31yQtx2foWL._SL500_.jpg\" alt=\"Image of Beast Mini Blender\"/>\n    <p>\n      <a href=\"https://amzn.to/4lDWZCZ\">Buy Now →</a>\n    </p>\n    <h3>Notes</h3>\n    <p>This will be a souffle-like texture that will get real nice and fluffy in the pan, and then its fluffiness will start to deflate as it rests and as you eat it.</p>\n    <p>It can take a bit of playing around to get your stove temperature just right to get that perfect golden-browning, so don’t hesitate to adjust based on what you’re seeing. For me, the best temp is medium high, as directed.</p>\n    <ul>\n      <li>Prep Time: 3 minutes</li>\n      <li>Cook Time: 4 minutes</li>\n      <li>Category: Breakfast</li>\n      <li>Method: Stovetop</li>\n      <li>Cuisine: American</li>\n    </ul>\n    <p>Keywords: breakfast, cottage cheese, cottage cheese pancake, high protein breakfast, protein pancake</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://pinchofyum.com/single-serve-cottage-cheese-pancake\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "whistlepig-8217-s-30-year-old-single-malt-is-the-brand-8217-s-oldest-w",
    "title": "WhistlePig&#8217;s 30-Year-Old Single Malt Is the Brand&#8217;s Oldest Whiskey Yet",
    "category": "test",
    "subcategory": "16Drink",
    "category_slug": "test/16drink",
    "date": "2025-09-05",
    "excerpt": "WhistlePig is no stranger to unique whiskeys. The brand’s annual Boss Hog expressions are always coveted releases, and other bottles feature rare finishes or extra time in barrels.",
    "cover": "https://bevvy.co/articles/wp-content/uploads/2025/09/whistlepig-the-bigshebang.jpg",
    "source": "https://bevvy.co/articles/whistlepig-30-year-old-single-malt/22986",
    "source_domain": "bevvy.co",
    "source_name": "Bevvy",
    "author": "Bevvy",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>WhistlePig is no stranger to unique whiskeys. The brand’s annual Boss Hog expressions are always coveted releases, and other bottles feature rare finishes or extra time in barrels.</p>\n    <p>The BigShǝBàng is the latest extra-aged release from <a href=\"https://bevvy.co/brand/whistlepig\">WhistlePig</a>, and it’s “aged longer than any other N. American single malt,” according to the brand.</p>\n    <p>It was aged for 30 years and finished in Vin Santo barrels, a rare Italian dessert wine that’s crafted via the low-yield, labor-intensive appassimento method, in which dried grapes are fermented.</p>\n    <p>“We didn’t wait for our single malt’s 30th birthday just to play it safe. The BigShǝBàng is a flavor supernova — radiant, otherworldly, and unlike anything we’ve ever put in a bottle,” said Meghan Ireland, WhistlePig’s head blender. “We’ve been hunting down Vin Santo barrels for a few years now, and the stars finally aligned with a precious few to finish this inaugural release. As with many of our most elusive casks, they’ve proved to be a catalyst for complexity that’s well worth the quest.”</p>\n    <p>The BigShǝBàng is full-flavored, with notes of honeyed bread, wheat crust, and florals on the nose. The palate brings subtle clove, freshly kneaded dough, and honeysuckle on the palate, with a finish of toasted cedar and lingering sweetness.</p>\n    <p>The BigShǝBàng is 90.4 proof and completes a trinity of single malts, following predecessors The Béhôlden (aged 21 years, finished in WhistlePig rye barrels) and The Badönkådonk (aged 25 years, finished in Silver Oak cabernet barrels).</p>\n    <p>It’s extremely rare, with just four barrels in existence, and is priced accordingly at $4,999. It’ll be available to taste at The WhistlePig Vault in Louisville, Kentucky, later this fall, and bottles will make their way to select establishments nationwide.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://bevvy.co/articles/whistlepig-30-year-old-single-malt/22986\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "20-easy-cocktails-to-make-on-labor-day-weekend",
    "title": "20 Easy Cocktails to Make on Labor Day Weekend",
    "category": "test",
    "subcategory": "16Drink",
    "category_slug": "test/16drink",
    "date": "2025-08-27",
    "excerpt": "Skip header links Bevvy ® Cocktails Spirits Collections Articles Sign Up Sign In Cocktails Spirits Collections Articles Liquor Brands Recipes by Tag People Hubs Glassware Books Infographics Feeling Lucky? Submit Spirit About Bevvy",
    "cover": "https://bevvyco.s3.amazonaws.com/img/collections/xh/vxh/cover-40a2c4ab7bfd612c53a3a349667f03f9-lg.jpg",
    "source": "https://bevvy.co/articles/20-easy-cocktails-to-make-on-labor-day-weekend/22192",
    "source_domain": "bevvy.co",
    "source_name": "Bevvy",
    "author": "Kevin Gray",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Skip header links\nBevvy\n®\nCocktails\nSpirits\nCollections\nArticles\nSign Up\nSign In\nCocktails\nSpirits\nCollections\nArticles\nLiquor Brands\nRecipes by Tag\nPeople\nHubs\nGlassware\nBooks\nInfographics\nFeeling Lucky?\nSubmit Spirit\nAbout Bevvy</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://bevvy.co/articles/20-easy-cocktails-to-make-on-labor-day-weekend/22192\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "chocolate-chip-muffins",
    "title": "Chocolate Chip Muffins",
    "category": "test",
    "subcategory": "9Food",
    "category_slug": "test/9food",
    "date": "2025-08-26",
    "excerpt": "These chocolate chip muffins are fluffy with amazing flavor! This muffin recipe is fully loaded with chocolate chips and easy to make by hand.",
    "cover": "https://cookieandkate.com/images/2025/08/chocolate-chip-muffin-interior.jpg",
    "source": "https://cookieandkate.com/chocolate-chip-muffins/?adt_ei=*|EMAIL|*",
    "source_domain": "cookieandkate.com",
    "source_name": "Cookieandkate",
    "author": "Kathryne Taylor",
    "rights": "Unknown",
    "body": "<p>These chocolate chip muffins are fluffy with amazing flavor! This muffin recipe is fully loaded with chocolate chips and easy to make by hand.</p>\n<p>\n      <a href=\"https://cookieandkate.com/about/\">\n        <graphic data-pin-nopin=\"nopin\" alt=\"Kathryne Taylor\" src=\"https://cookieandkate.com/images/2024/10/cropped-kathryne-taylor-200-40x40.jpg\" srcset=\"https://cookieandkate.com/images/2024/10/cropped-kathryne-taylor-200-80x80.jpg 2x\" class=\"avatar avatar-40 photo\" height=\"40\" width=\"40\" decoding=\"async\"/>\n      </a>\n    </p>\n<p>Posted by <a href=\"https://cookieandkate.com/about/\">Kathryne Taylor</a> on  August 26, 2025</p>\n<p>When you buy through our links, we may earn a commission. <a href=\"https://cookieandkate.com/affiliate-discretion/\">Learn more</a></p>\n<p><strong>These chocolate chip muffins are divine—</strong>they’re fluffy, tender and studded throughout with chocolate chips. They’re our three-year-old daughter’s current favorite muffin in <a href=\"https://cookieandkate.com/category/food-recipes/breakfast/muffins/\">my muffin repertoire</a>, and I understand why! She loves dark chocolate as much as I do, so I can vouch that these muffins delight kids and adults alike.</p>\n<p>These muffins follow the same formula as my other popular “healthy” muffin recipes, but you won’t guess it upon your first (or last) bite. They’re made with whole wheat flour if you wish, and they’re sweetened with honey instead of plain sugar, which makes them extra delicious. Greek yogurt offers a subtle sour cream-like tang that makes these taste like bakery-style muffins, while providing some extra protein.</p>\n<p>If you’re a fan of my popular <a href=\"https://cookieandkate.com/healthy-banana-muffins-recipe/\">banana muffins</a> or <a href=\"https://cookieandkate.com/healthy-blueberry-muffins/\">blueberry muffins</a>, you must try this recipe!  </p>\n<h2>Chocolate Chip Muffin Tips</h2>\n<h3>Do not overmix.</h3>\n<p>Your muffins will turn out tough instead of tender if you overmix this batter once the liquid is combined with the flour. Gently stir the batter together by hand, following the cues provided within the recipe, such as “you should still see a few streaks of flour and lumps.” If you’re unsure, err on the side of caution.</p>\n<h3>Coat the chocolate chips in cinnamon to prevent them from sinking.</h3>\n<p>This is a new trick to me, and it works brilliantly. Stirring ground cinnamon into the chocolate chips before folding them into the batter makes a world of difference, and it works better than tossing them in flour. The cinnamon flavor is lovely and subtle, and produces muffins with an even dispersion of full-sized chocolate chips throughout.</p>\n<h3>These muffins taste best after they have cooled.</h3>\n<p>I know we all love a gooey chocolate chip, but this holds true for all baked goods, especially these muffins. After resting, the flavors of coconut oil, honey, Greek yogurt and cinnamon meld and mellow, producing a truly magical muffin.</p>\n<h3>Watch How to Make Chocolate Chip Muffins</h3>\n<h2>Ingredient Notes &amp; Options</h2>\n<p>You’ll find the full recipe below. Here are my notes in case you’d like to adjust this recipe to suit your pantry or preferences.</p>\n<p><strong>Flour:</strong> I prefer to use whole-grain flours whenever possible for the extra fiber and flavor. These muffins turned out beautifully with whole wheat pastry flour, which has unfortunately become challenging to find in recent months. White whole wheat flour offers all the benefits of whole wheat flour without the “wheaty” flavor. All-purpose flour will yield bakery-style muffins. It’s up to you. </p>\n<p><strong>Greek yogurt:</strong> I tested this recipe primarily with whole-milk Greek yogurt, which is thick and rich, and helps support the weight of the chocolate chips. Lighter Greek yogurts will work. I wouldn’t use regular plain yogurt because it likely will not offer enough structure. </p>\n<p><strong>Chocolate chips:</strong> I love dark chocolate, so I enjoyed these muffins with darker chocolate chips (with a 60 percent cacao content or higher). The recipe calls for 1 cup of chips, but you can get by with 3/4 cup if need be. You can also substitute other flavored chips, such as white chocolate or buttermilk, or use coated chocolate candies like M&amp;M’s for more color. </p>\n<p><strong>Honey:</strong> Use regular, runny honey for this recipe. I also tried this recipe with maple syrup, which works well enough, but I preferred the flavor and greater sweetness that honey offers.</p>\n<p><strong>Coconut oil vs. olive oil:</strong> This is a toss-up, as far as I’m concerned. Virgin coconut oil offers an almost imperceptible coconut flavor, whereas refined coconut oil is virtually flavorless. If you use olive oil and don’t want the muffins to taste like it, use a mild oil such as California Olive Ranch. Vegetable oil and avocado oil are also suitable alternatives. </p>\n<p><strong>Turbinado sugar:</strong> Sprinkling the tops of the muffins with turbinado sugar (also called raw sugar) yields a lovely little crunch, but it’s optional.</p>\n<h2>More Muffins to Make</h2>\n<p>If you enjoy these muffins, be sure to check out these <a href=\"https://cookieandkate.com/category/food-recipes/breakfast/muffins/\">muffin recipes</a>:</p>\n<ul>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-apple-muffins-recipe/\">Healthy Apple Muffins</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-blueberry-muffins/\">Healthy Blueberry Muffins</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-banana-muffins-recipe/\">Maple-Sweetened Banana Muffins</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-maple-pumpkin-muffins/\">Healthy Pumpkin Muffins</a>\n      </li>\n      <li>\n        <a href=\"https://cookieandkate.com/healthy-zucchini-muffins-recipe/\">Healthy Zucchini Muffins</a>\n      </li>\n    </ul>\n<p><strong>Please let me know how your chocolate chip muffins turn out in the comments!</strong> I love hearing from you. </p>\n<h2>Chocolate Chip Muffins</h2>\n<p>These chocolate chip muffins are fluffy with amazing flavor! This muffin recipe is fully loaded with chocolate chips and easy to make by hand. Recipe yields 1 dozen muffins.</p>\n<h3>Ingredients</h3>\n<ul>\n      <li>1 ¾ cups (215 grams) whole wheat pastry flour or <a href=\"https://www.target.com/p/king-arthur-flour-unbleached-white-whole-wheat-flour-5lbs/-/A-14776414\">white whole wheat flour</a>or regular whole wheat flour or all-purpose flour</li>\n      <li>1 teaspoon baking powder</li>\n      <li>½ teaspoon baking soda</li>\n      <li>½ teaspoon fine salt</li>\n      <li>⅓ cup melted coconut oil or extra-virgin olive oil</li>\n      <li>½ cup runny honey</li>\n      <li>2 eggs, preferably at room temperature</li>\n      <li>1 cup plain Greek yogurt*</li>\n      <li>2 teaspoons vanilla extract</li>\n      <li>1 cup chocolate chips (I love semi-sweet to dark chips)</li>\n      <li>1 teaspoon ground cinnamon</li>\n      <li>Optional: 1 tablespoon <a href=\"https://amzn.to/4lJv2sM\">turbinado sugar</a>(also called raw sugar), for sprinkling on top</li>\n    </ul>\n<h3>Instructions</h3>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cookieandkate.com/chocolate-chip-muffins/?adt_ei=*|EMAIL|*\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "double-chocolate-zucchini-bread",
    "title": "double chocolate zucchini bread",
    "category": "test",
    "subcategory": "7Food",
    "category_slug": "test/7food",
    "date": "2025-08-20",
    "excerpt": "Oh you wanted a chocolate zucchini bread recipe? Don’t you know this is a food blog? I’m contractually obligated to tell a meandering and infuriatingly irrelevant story in each headnote, keeping you from the recipe as long as possible for nefarious, possibly witchy, purposes, …",
    "cover": "https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2025/08/double-chocolate-zucchini-bre-07-scaled.jpg?fit=1200%2C800&#038;ssl=1",
    "source": "https://smittenkitchen.com/2025/08/double-chocolate-zucchini-bread/",
    "source_domain": "smittenkitchen.com",
    "source_name": "Smittenkitchen",
    "author": "deb",
    "rights": "Unknown",
    "body": "<p>Oh you wanted a chocolate zucchini bread recipe? Don’t you know this is a food blog? I’m contractually obligated to tell a meandering and infuriatingly irrelevant story in each headnote, keeping you from the recipe as long as possible for nefarious, possibly witchy, purposes, and I don’t want to disappoint. Next week, I’ll be celebrating my <a href=\"https://www.flickr.com/photos/smitten/52567411\">20th wedding anniversary</a> with a guy I met because I wrote some rambling things on a blog about, like, dating and New York City and funny things that had happened, he read it, we went for a drink, I stopped dating, needed a new subject to fill the void, and Smitten Kitchen came to be one year later. [Some people have honeymoon babies, I, uh, had you.]</p>\n<p><br/>\n<graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54733971650_221a5ef588_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-01\"/><br/>\n<graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54732776632_6f54886dce_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-02\"/></p>\n<p>“Impossible!” I expect you’ll say now, “you’re too young to have been married for 20 years!” And I couldn’t agree more! I’m pretty sure we just met. I’m pretty sure little has changed (well, except those two awesome kids and a smattering of gray hairs on him I take personal credit for and pride in). We still like to have people over, still like to go out, still love Paris and New York, and — here it comes, the actual point! — he’s still trying to convince me to put chocolate in more recipes. In 2014, he successfully lobbied for me to <a href=\"https://smittenkitchen.com/2014/03/double-chocolate-banana-bread/\">put chocolate in my banana bread</a>, and from a glance at the 899-long comment section, it sounds like you’re glad he did. And now it is time for what he insists is the perfect zucchini bread, so long overdue that AI thinks it already exists.</p>\n<p>\n      <graphic src=\"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2025/08/double-chocolate-zucchini-bre.jpg?resize=640%2C303&amp;ssl=1\"/>\n    </p>\n<p><graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54733971575_ea75947f8b_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-03\"/><br/>\n<graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54733603646_19bab83ec5_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-04\"/></p>\n<p>This is a phenomenally fudgy chocolate loaf cake with a crunchy top that has the better part of a pound of zucchini in it and while I’d never try to put zucchini in the corner — we <i>spotlight</i> <a href=\"https://smittenkitchen.substack.com/p/zillions-of-zucchini\">zucchini</a> on the Smitten Kitchen, thank you very much — the reality is that if your eyes were closed, and possibly even with them open, you’d never know that there was a vegetable inside. Is this the best news ever? An abomination? Should zucchini bread taste like a brownie? I’m going to let you sort this out for yourself, you and all of the friends you’re going to make when you bring this wherever you’re going this weekend. Cheers! And thanks for being a part of our story.</p>\n<p><graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54733971530_5e26b87325_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-05\"/><br/>\n<graphic src=\"https://i0.wp.com/live.staticflickr.com/65535/54732776337_685d53d2b8_z.jpg?resize=640%2C427&amp;ssl=1\" alt=\"double chocolate zucchini bre-09\"/></p>\n<p/>\n    <p><a href=\"https://smittenkitchen.com/the-classroom-wishlist-project/\"/> It’s here! <graphic src=\"https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2023/07/classroom-wishlist.jpg?resize=300%2C146&amp;ssl=1\"/></p>\n<p><strong>The 2025 SK Classroom Wishlist Project</strong>, in which we try to get teachers what they need to set their classrooms up for success, has kicked off. If you cannot figure out where to start, let me help! I recommend picking a school in your area, or perhaps where you grew up, or searching the descriptions for classrooms that might focus on something particularly meaningful to you. Help out if you feel you’re able. There is no purchase too small to unquestionably make a teacher’s (and their students’) day. Plus, buying crayons, pencils, and books that help kids learn and succeed feels really good. [</p>\n<p>\n      <a href=\"https://smittenkitchen.com/the-classroom-wishlist-project/\">Project information.</a>\n    </p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/1dYsreQwh7ThdDgJqo93HW4ixpn36TldwKHnjD1TA5IM/edit?usp=sharing\">Direct link to spreadsheet</a>.]</p>\n<p/>\n    <h5>Video</h5>\n    <h3>Double Chocolate Zucchini Bread</h3>\n    <p>Size note: Very key here is the size of your loaf pan because this will fill out every speck of it before it is done. Mine holds 6 liquid cups; it’s 8×4 inches on the bottom and 9×5 inches on the top. If yours is even slightly smaller or you’re nervous, go ahead and scoop out a little to make a muffin or two on the side. When making this for the first time, place a sheet pan underneath, just in case it spills over but I can promise you that in several tests, mine never has.</p>\n<ul>\n      <li>2 cups (13 ounces or 370 grams) grated, packed zucchini, not wrung out, grated on the large holes of a box grater</li>\n      <li>2 large eggs</li>\n      <li>2/3 cup (160 ml) of a neutral oil, olive oil, or melted unsalted butter</li>\n      <li>1/2 cup (95 grams) packed dark brown sugar</li>\n      <li>1/2 cup (100 grams) granulated sugar</li>\n      <li>1 teaspoon vanilla extract</li>\n      <li>1 3/4 teaspoons kosher salt (Diamond brand; use half of other brands)</li>\n      <li>1 1/4 teaspoons ground cinnamon (optional)</li>\n      <li>3/4 teaspoon baking soda</li>\n      <li>1/2 teaspoon baking powder</li>\n      <li>1 1/3 cups (180 grams) all-purpose flour</li>\n      <li>2/3 cup (55 grams) unsweetened cocoa powder</li>\n      <li>1 1/3 cup (8 ounces or 225 grams) semisweet chocolate chips, divided</li>\n      <li>2 tablespoons (25 grams) raw or turbinado sugar</li>\n    </ul>\n<p>Place grated zucchini in a large bowl and add oil, eggs, sugars, vanilla, and salt. Whisk until combined. Sprinkle cinnamon, if using, baking soda, and baking powder over the surface of the batter and mix until combined — and then, for extra security that the ingredients are well-dispersed, give it 10 extra stirs. If your cocoa is lumpy, and mine always is, sift it over the batter. Add flour and mix until combined. Set 2 tablespoons chocolate chips aside and add the remaining to the batter, stirring to combine. Pour into the prepared loaf pan and smooth the top. Sprinkle with reserved chocolate chips and the raw or turbinado sugar — don’t skimp.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://smittenkitchen.com/2025/08/double-chocolate-zucchini-bread/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]