[
  {
    "slug": "this-couple-quit-their-9-5-to-work-on-a-floating-pizzeria-in-the-carib",
    "title": "This Couple Quit Their 9-5 To Work On A Floating Pizzeria In The Caribbean",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "When you think of a dream job, you might come up with athlete, actor, or firefighter. What you’re probably not imagining is working at a floating pizza restaurant in the middle of the Caribbean. But for engaged couple Jack Coutinho and Kinsey Brown , that seemingly far-fetched…",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/photo-jul-26-2025-11-09-33-am-68c46752371ee.jpg",
    "source": "https://www.delish.com/food/a66069056/pizza-pi-floating-caribbean-restaurant/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<p>When you think of a dream job, you might come up with athlete, actor, or firefighter. What you’re probably <i>not</i> imagining is working at a floating pizza restaurant in the middle of the Caribbean. But for engaged couple <a href=\"https://www.instagram.com/alohawithus/\">Jack Coutinho and Kinsey Brown</a>, that seemingly far-fetched dream became a reality.</p>\n<p>The pair were living in Los Angeles with two kids under two when they realized they wanted to make a change. Coutinho worked in sales for a wine company while doing photography on the side. Brown was a preschool teacher, model, and home stager. “[We needed] a few jobs just to pay rent; everything over there is quite the hustle,”  Coutinho tells <i>Delish</i>.</p>\n<p>The couple was, understandably, burnt out. Their solution to breaking out of their routine? In May, they picked up and moved to the U.S. Virgin Islands. “We were looking to just get totally out of California,” Coutinho says. “Like, okay, what could be the opposite?”</p>\n<p>They quickly settled on moving to the Caribbean. Coutinho, who visited St. Thomas a few years prior, suggested the island in order to remain on U.S. soil and avoid any visa-related obstacles. The pair saved enough money to give themselves a cushion, booked flights, arranged childcare, and secured an apartment.</p>\n<p>The one thing they didn’t have was a lead for a new job. That changed a mere month before their departure when Coutinho found an open position at a pizza place. But <a href=\"https://pizza-pi.com/\">Pizza Pi</a> isn’t your average slice spot—it’s a 37-foot boat moored in St. Thomas’s Christmas Cove. </p>\n<p>“I showed my family and said, ‘Look at this cool job!’” Coutinho says. “My family was like ‘Is this real?’”</p>\n<p>It is indeed real. A little over a decade ago, a married couple in the yachting industry converted the vessel into a restaurant to fulfill their dream of running a pizza restaurant. Pizza Pi was once a limited, take-out-only operation to deliver to nearby boats. The business changed hands a few times before it was taken over in 2023 by its current owners, Wisconsin native and R.D.N. Katie Hackl, and her fiancé, Chris Cilliers.</p>\n<p>The couple expanded the business to include a floating seating area for guests to dine right on the cove’s crystal-blue waters. They built an extensive craft cocktail program and added a few items to the menu. The one thing they didn’t change was the pizza itself. “Sometimes when something’s not broken, you don’t mess with it,” Hackl explains.</p>\n<p>Pizza Pi’s unique and exciting concept has drawn employees from all corners of the world. Coutinho and Brown were no exception. “They just picked up the phone and called and said they were going to be on the island in a couple of weeks,” says Hackl. “So when [Jack] got down here, we did a trial day and [he] just knocked it out of the park from day one.”</p>\n<p>Brown had initially planned to watch the kids while hunting for a job elsewhere. A couple of weeks in, she decided to join Coutinho on the boat. “We ended up bringing her on, too,” says Hackl. “And they’re just a power couple.”</p>\n<p>“You’re in a great environment, you’re just talking to tourists all day and telling your story,” Brown says. “It almost feels like you’re not at work when you are at work.”</p>\n<p>That’s not to say that the work is easy. Each day at Pizza Pi starts at 9 a.m. when the crew loads up all the ingredients on land to bring to the restaurant on a dinghy. The rest of the morning involves preparing pizzas for guests by the time they open at 11 a.m.</p>\n<p>“The whole day is normally booked from like 11:30 to the end of the day, because there are so many charters that come in and out,” Brown says. The restaurant receives booking requests by text every morning, and the team works to fit each party into a reserved time slot. Those slots are usually fully booked within an hour of opening.</p>\n<p>Pizza Pi serves both small families and large charter boats with as many as 100 people. The team juggles orders for guests floating on the water and dozens of pizzas delivered to neighboring boats. “From when you leave the office in the morning to when you get to the boat to the end of the day, you just don’t stop moving,” Brown says.</p>\n<p>Her favorite part of the job is working behind the bar, where she can interact with guests and mix up fun frozen drinks. Her favorite is the Bushwhacker, a St. Thomas classic that tastes like a cross between a piña colada and a chocolate milkshake.</p>\n<p>Coutinho, on the other hand, loves cooking the pizzas. His favorite is the restaurant’s most popular: pepperoni. He also prepares specialty pizzas you can only find at Pizza Pi. The Peachy Goat, a crowd favorite, is a white pie with goat cheese, peaches, basil, balsamic, and honey.</p>\n<p>The work is rewarding, but not without obstacles. “We joke that owning a restaurant and owning a boat are two of the hardest things you can do,” Hackl says. The added challenge of tackling mechanical problems can make a day on the job even more difficult. But the extra effort is well worth it.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/food/a66069056/pizza-pi-floating-caribbean-restaurant/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "chicken-parmesan",
    "title": "Chicken Parmesan",
    "category": "test",
    "subcategory": "3General",
    "category_slug": "test/3general",
    "date": "2025-09-18",
    "excerpt": "Let us know how it went in the comments below!",
    "cover": "https://hips.hearstapps.com/hmg-prod/images/chicken-parmesan-index-644042afa49de.jpg",
    "source": "https://www.delish.com/cooking/recipe-ideas/a51451/easy-chicken-parmesan-recipe/",
    "source_domain": "delish.com",
    "source_name": "Delish",
    "author": "Delish",
    "rights": "Unknown",
    "body": "<h2>Made This?</h2>\n<p>Let us know how it went in the comments below!</p>\n<p>Chicken Parm is one of those rare dishes that almost everyone can agree upon. While developing this recipe, I wondered: <i>Why are we, citizens of the world, so obsessed with chicken Parmesan?</i> After discussing with the food team, testing multiple variations, and summoning various <a href=\"https://www.delish.com/cooking/menus/g2616/italian-dinner-recipes/\">Italian</a> (-American) gods, I realized the reason is simple: It’s fatty, umami-licious, and has that perfect crispy AND melt-in-your-mouth texture. Though we’ve done it many different ways here, this classic recipe is the chosen one, the holy grail. It has everything you want in <a href=\"https://www.delish.com/cooking/recipe-ideas/g2972/chicken-weeknight-dinners/\">chicken</a> Parm, full stop—fried cutlets shrieking with crispiness, a perfect blend of <a href=\"https://www.delish.com/cooking/g40048963/mozzarella-recipes/\">mozzarella</a> and Parm, and a sauce that is full of life with basil and just enough sweetness. Read on to find out just how I achieved this:</p>\n<p><strong>What People Are Saying: </strong>“So I made this for my parents for a 'romantic date night' for a surprise, and the instructions were so well-detailed it was super easy to follow (I'm 12), so thank you so much, as the other recipes online were much more confusing!!” </p>\n<p>“Phenomenal recipe and easy to follow. Made this as the first meal in my college apartment (I never have cooked before this). Man, my roommates were impressed. Everything was full of flavor, and looked amazing. Thanks for such an easy to follow, delectable recipe!” <i>- andyh735</i> </p>\n<p><strong>• Olive Oil: </strong>I prefer to use extra-virgin olive oil to cook the onion and garlic in, while I use a more neutral oil to fry the chicken. Use your favorite olive oil here, or check out our list of the <a href=\"https://www.delish.com/kitchen-tools/cookware-reviews/g46931475/best-olive-oil-brands-ranked/\"> best olive oil brands</a>.</p>\n<p><strong>• Panko Bread Crumbs: </strong>Panko is what creates the crispy coating on the chicken Parmesan. To really ensure a crispy, even coating, I recommend adding even more panko than you need to your bowl (more panko is never a bad idea).<strong>• Parmesan: </strong>I use Parmesan in two ways here: I add it to the panko to create extra flavor, and to the shredded mozzarella for a richer cheese mixture. Panko doesn’t have a super strong flavor on its own, so the addition of Parmesan amps up the flavor and richness of the coating.<strong> </strong></p>\n<p>Like all good things, this recipe starts with cooking down chopped yellow onion and garlic in olive oil. I choose to cover the pot to speed up the process, occasionally stirring the garlic and onion to prevent burning. You’re looking for a few things when cooking your garlic and onions: they should taste sweet, be soft, and appear completely translucent. Once you’ve achieved the 3 golden rules, you’re ready to continue on your journey.</p>\n<p>Once your onion and garlic are good to go, it’s time to add in the main characters of the sauce show: crushed tomatoes and basil. Add in the basil leaf AND stem (it’s where all the flavor is!). Now, this isn’t a sauce that you can just leave alone—it requires a bit of babysitting. The tomato chunks will start to fall to the bottom, which makes them susceptible to burning. Stir the sauce occasionally to prevent any burning, and cook until the sauce is nice and thick. No one (especially me) wants a watery tomato sauce falling off the chicken Parm.</p>\n<p>Now, we’re on to the star of our show: the chicken cutlets. Once your cutlets are perfectly thin, it’s time to begin the dredging process. Create three stations: a flour station, an egg and water station, and a panko, Parmesan, and garlic powder station. I add freshly grated Parmesan and garlic powder to the panko to amp up the flavor; it takes the chicken cutlet experience to the next level.</p>\n<p>My tried-and-tested rule for this step: cover every <i>inch</i> of your chicken cutlets at every dredging station. For the flour and egg: cover every inch of the surface, then shake off any excess before moving on. </p>\n<p>With the panko, you can add more than you really need to make sure your entire cutlet is covered and crisp. To avoid ending this process with hands that look just like your chicken cutlets, I highly recommend having a “dry” hand and a “wet” hand while dredging. Use one hand to cover your cutlets in the flour and panko, and another to coat them in the egg mixture. No mess here!</p>\n<p>Repeat with every piece of chicken, then set them aside on a baking sheet as we prepare to fry.</p>\n<p>Before adding your chicken, heat the neutral oil until a thermometer registers 350°. If it smokes a bit, no stress—it’s all part of the plan. Add your cutlets one at a time, and fry until perfectly golden brown before flipping to the other side. If you’re shallow frying and the oil isn’t hitting every surface, I highly recommend basting your chicken with a spoon to ensure the chicken is well-fried and extra-crispy.</p>\n<p>After your chicken is golden-brown, crispy perfection, place them on a wire rack to let all the excess oil drip off. Now, it’s time to bring all of our characters together. Spoon some of your prepared marinara on top of your chicken, then add your prepared bowl of shredded mozzarella and Parmesan on top of the sauce. Now, it’s time to get cheesy.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.delish.com/cooking/recipe-ideas/a51451/easy-chicken-parmesan-recipe/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "guava-margaritas",
    "title": "Guava Margaritas",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "While visiting family, I tasted a guava margarita and fell in love with the tropical flavors. I rushed home to create my own version! —Renee Page, Rochelle, Illinois",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg",
    "source": "https://www.tasteofhome.com/recipes/guava-margaritas/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Taste of Home Editorial Team",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>While visiting family, I tasted a guava margarita and fell in love with the tropical flavors. I rushed home to create my own version! —Renee Page, Rochelle, Illinois</p>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg\" alt=\"Guava Margaritas\"/>\n    <h1>Guava Margaritas</h1>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Guava-Margaritas_EXPS_RC25_279000_DR_04_16_07b.jpg\" alt=\"Guava Margaritas\"/>\n    <p>\n      <a href=\"https://www.tasteofhome.com/article/test-kitchen-approved/\">Test Kitchen Approved</a>\n    </p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>Ice cubes</li>\n      <li>2 cups guava nectar</li>\n      <li>1-1/2 cups tequila</li>\n      <li>1 cup fresh lime juice</li>\n      <li>1/2 cup simple syrup</li>\n      <li>1/4 cup triple sec</li>\n      <li>Lime wedges</li>\n      <li>Coarse sugar</li>\n    </ul>\n    <h3>Directions</h3>\n    <ul>\n      <li>In a pitcher filled with ice cubes, combine guava nectar, tequila, lime juice, simple syrup and triple sec. Stir until condensation forms on outside of the pitcher, 15-20 seconds.</li>\n      <li>Moisten rims of 8 margarita or cocktail glasses with lime wedges. Sprinkle sugar on a plate; dip rims in sugar. Immediately serve over ice in prepared glasses (use a spoon while pouring to hold ice cubes in pitcher).</li>\n    </ul>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Popular in the Community</p>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Reviews</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/recipes/guava-margaritas/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "muffaletta-dip",
    "title": "Muffaletta Dip",
    "category": "test",
    "subcategory": "4General",
    "category_slug": "test/4general",
    "date": "2025-09-18",
    "excerpt": "I love everything about a Muffaletta sandwich, so I just had to make it into a dip. It makes for a great party appetizer! —Courtney Stultz, Weir, Kansas",
    "cover": "https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg",
    "source": "https://www.tasteofhome.com/recipes/muffaletta-dip/",
    "source_domain": "tasteofhome.com",
    "source_name": "Tasteofhome",
    "author": "Taste of Home Editorial Team",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>I love everything about a Muffaletta sandwich, so I just had to make it into a dip. It makes for a great party appetizer! —Courtney Stultz, Weir, Kansas</p>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg\" alt=\"Muffaletta Dip\"/>\n    <h1>Muffaletta Dip</h1>\n    <graphic src=\"https://www.tasteofhome.com/wp-content/uploads/2025/09/Muffaletta-Dip_EXPS_RC25_279219_DR_04_16_03b.jpg\" alt=\"Muffaletta Dip\"/>\n    <p>\n      <a href=\"https://www.tasteofhome.com/article/test-kitchen-approved/\">Test Kitchen Approved</a>\n    </p>\n    <h3>Ingredients</h3>\n    <ul>\n      <li>8 ounces cream cheese, softened</li>\n      <li>2 teaspoons olive oil</li>\n      <li>1 teaspoon minced garlic</li>\n      <li>1 teaspoon red wine vinegar</li>\n      <li>1 teaspoon minced fresh parsley</li>\n      <li>1/2 cup chopped pitted green olives</li>\n      <li>1/4 cup chopped pitted Kalamata or Greek olives</li>\n      <li>1/4 cup chopped ripe olives</li>\n      <li>1/4 cup chopped roasted sweet red peppers</li>\n      <li>1/4 cup chopped pepperoncini</li>\n      <li>1 teaspoon capers, drained</li>\n      <li>Assorted crackers</li>\n    </ul>\n    <h3>Directions</h3>\n    <ul>\n      <li>In a small bowl, beat cream cheese, olive oil, garlic, red wine vinegar and parsley until well combined. Fold in olives, peppers, pepperoncini and capers. Serve with assorted crackers.</li>\n    </ul>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Popular in the Community</p>\n    <p>\n\t\t\t\t\t\t\n    \t\t\t\tLoading Reviews</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.tasteofhome.com/recipes/muffaletta-dip/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]