[
  {
    "slug": "elizabeth-warren-probes-justice-department-over-binance-2023-settlemen",
    "title": "Elizabeth Warren probes Justice Department over Binance 2023 settlement terms",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2024/01/elizabeth-warren-crypto.jpg",
    "source": "https://cryptoslate.com/elizabeth-warren-probes-justice-department-over-binance-2023-settlement-terms/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Gino Matos",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2024/01/elizabeth-warren-crypto.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"Elizabeth Warren probes Justice Department over Binance 2023 settlement terms\"/>\n    <h1>Elizabeth Warren probes Justice Department over Binance 2023 settlement terms</h1>\n    <p>The senators criticized the Justice Department for failing to \"meaningfully answer\" questions Warren initially raised in May about settlement compliance.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2024/01/elizabeth-warren-crypto-768x403.jpg\" alt=\"Elizabeth Warren probes Justice Department over Binance 2023 settlement terms\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p>Senator <a href=\"https://cryptoslate.com/people/elizabeth-warren/\">Elizabeth Warren</a> pressed Attorney General Pam Bondi for details on whether Binance complies with its 2023 settlement agreement, as Bloomberg News reported on Sept. 18.</p>\n    <p>Warren cited inadequate responses from federal prosecutors regarding the world’s largest cryptocurrency exchange in a letter co-authored by Democratic senators Mazie Hirono and Richard Blumenthal.</p>\n    <p>The letter demanded confirmation of Binance’s adherence to “ongoing requirements” from the $4.3 billion deal that resolved money-laundering and sanctions violations.</p>\n    <p>The senators criticized the Justice Department for failing to “meaningfully answer” questions Warren initially raised in May about settlement compliance.</p>\n    <p>Earlier this month, prosecutors confirmed Binance had paid required financial penalties but noted the company maintains continuing obligations under the agreement, including compliance program improvements.</p>\n    <p>However, the lawmakers wrote that “this response did not confirm whether or not Binance was, in fact, complying with these ongoing requirements.”</p>\n    <h2>Monitor removal under consideration</h2>\n    <p>The inquiry comes as prosecutors are weighing <a href=\"https://cryptoslate.com/binance-approaches-deal-with-doj-to-drop-outside-monitor-from-4-3-billion-settlement/\">whether to remove Binance’s court-appointed compliance monitor</a>, a key component of the 2023 settlement.</p>\n    <p>Authorities installed the monitor to oversee the exchange’s adherence to anti-money laundering and sanctions compliance requirements.</p>\n    <p>Warren’s letter also sought details on interactions between <a href=\"https://cryptoslate.com/companies/binance/\">Binance</a> and President <a href=\"https://cryptoslate.com/people/donald-trump/\">Donald Trump</a> administration officials, reflecting concerns about the exchange’s connections to <a href=\"https://cryptoslate.com/coins/world-liberty-financial/\">World Liberty Financial</a>.</p>\n    <p>Binance’s <a href=\"https://cryptoslate.com/binance-faces-historic-penalty-as-doj-settlement-talks-suggest-over-4-billion/\">late 2023 agreement with federal authorities</a> resolved criminal charges related to facilitating transactions for sanctioned entities and failing to implement adequate anti-money laundering programs.</p>\n    <p>The deal required the exchange to pay $4.3 billion in penalties and accept ongoing regulatory oversight.</p>\n    <p>The settlement marked one of the largest enforcement actions against a cryptocurrency firm, as prosecutors sought to address compliance failures that allowed illicit financial activities to flourish on the platform.</p>\n    <p>Also, as a part of the settlement, Binance founder <a href=\"https://cryptoslate.com/people/changpeng-zhao/\">Changpeng Zhao</a> served a four-month prison sentence. He was released in September 2024 and <a href=\"https://cryptoslate.com/changpeng-zhao-files-for-us-presidential-pardon-praises-trumps-business-like-leadership-style/\">sought a presidential pardon in May</a>.</p>\n    <p>The senators’ pressure campaign stressed ongoing congressional scrutiny of cryptocurrency regulation, despite the recent regulatory moves led by Trump signing the GENIUS Act into law.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/elizabeth-warren-probes-justice-department-over-binance-2023-settlement-terms/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "crypto-whale-loses-6m-to-sneaky-phishing-scheme-targeting-staked-ether",
    "title": "Crypto whale loses $6M to sneaky phishing scheme targeting staked Ethereum",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/crypto-phishing-.jpg",
    "source": "https://cryptoslate.com/crypto-whale-loses-6m-to-sneaky-phishing-scheme-targeting-staked-ethereum/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Oluwapelumi Adejumo",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/crypto-phishing-.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"Crypto whale loses $6M to sneaky phishing scheme targeting staked Ethereum\"/>\n    <h1>Crypto whale loses $6M to sneaky phishing scheme targeting staked Ethereum</h1>\n    <p>Blockchain security experts advocate increased caution as permit scams grow more sophisticated.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/crypto-phishing--768x403.jpg\" alt=\"Crypto whale loses $6M to sneaky phishing scheme targeting staked Ethereum\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p>A crypto whale lost more than $6 million in staked <a href=\"https://cryptoslate.com/coins/ethereum/\">Ethereum</a> (stETH) and <a href=\"https://cryptoslate.com/coins/aave/\">Aave</a>-wrapped <a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a> (aEthWBTC) after approving malicious signatures in a phishing scheme on Sept. 18, according to blockchain security firm Scam Sniffer.</p>\n    <p>According to the firm, the attackers disguised their move as a routine wallet confirmation through “<a href=\"https://x.com/realScamSniffer/status/1968612905940901972\">Permit</a>” signatures, which tricked the victim into authorizing fund transfers without triggering obvious red flags.</p>\n    <p>Yu Xian, founder of blockchain security company SlowMist, noted that the victim did not recognize the danger because the transaction required no gas fees. He wrote:</p>\n    <blockquote>\n      <p>“From the victim’s perspective, he just clicked a few times to confirm the wallet’s pop-up signature requests, didn’t spend a single penny of gas, and $6.28 million was gone.”</p>\n    </blockquote>\n    <h2>How Permit exploits work</h2>\n    <p>Permit approvals were originally designed to simplify token transfers. Instead of submitting an on-chain approval and paying fees, a user can sign an off-chain message authorizing a spender.</p>\n    <p>That efficiency, however, has created a new attack surface for malicious players.</p>\n    <p>Once a user signs such a permit, attackers can combine two functions—Permit and TransferFrom—to drain assets directly. Because the authorization takes place off-chain, wallet dashboards show no unusual activity until the funds move.</p>\n    <p>As a result, the assets are gone when the approval executes on-chain, and tokens are redirected to the attacker’s wallet.</p>\n    <p>This loophole has made permit exploits increasingly attractive for malicious actors, who can siphon millions without needing complex hacks or high-cost gas wars.</p>\n    <h2>Phishing losses</h2>\n    <p>The latest theft highlights a wider trend of escalating phishing campaigns.</p>\n    <p>Scam Sniffer <a href=\"https://x.com/realScamSniffer/status/1964235400593178793\">reported</a> that in August alone, attackers stole $12.17 million from more than 15,200 victims. That figure represented a 72% jump in losses compared with July.</p>\n    <p>According to the firm, the most significant share of August’s damages came from three large accounts that accounted for nearly half of the total. This included one wallet that lost $3.08 million in a single exploit.</p>\n    <p>Meanwhile, the firm attributed the surge in losses to a rise in <a href=\"https://cryptoslate.com/crypto-investor-loses-1m-in-uniswap-scam-exploiting-ethereums-eip-7702/\">EIP-7702 batch-signature scams</a> and direct transfers to malicious contracts.</p>\n    <p>Considering this, security experts have urged crypto users to be cautious when interacting with wallet requests and refuse demands that grant unlimited permissions to their wallets.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/crypto-whale-loses-6m-to-sneaky-phishing-scheme-targeting-staked-ethereum/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "sora-ventures-joins-columbia-teachers-college-initiative-to-integrate-",
    "title": "Sora Ventures joins Columbia Teachers College initiative to integrate web3 tech in education, policy",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/web3-soraVentures-columbia.jpg",
    "source": "https://cryptoslate.com/sora-ventures-joins-columbia-teachers-college-initiative-to-integrate-web3-tech-in-education-policy/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Assad Jafri",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/web3-soraVentures-columbia.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"Sora Ventures joins Columbia Teachers College initiative to integrate web3 tech in education, policy\"/>\n    <p><a href=\"https://cryptoslate.com/news/\">News</a>▸</p>\n    <p><a href=\"https://cryptoslate.com/places/asia/\">Asia</a>·</p>\n    <p><a href=\"https://cryptoslate.com/places/us/\">US</a>▸</p>\n    <p><a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>▸</p>\n    <p>\n      <a href=\"https://cryptoslate.com/crypto/\">Crypto News</a>\n    </p>\n    <h1>Sora Ventures joins Columbia Teachers College initiative to integrate web3 tech in education, policy</h1>\n    <p>Sora Ventures co-founder Jason Fang joins Columbia's CDGA to bridge digital finance and global education through blockchain.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/web3-soraVentures-columbia-768x403.jpg\" alt=\"Sora Ventures joins Columbia Teachers College initiative to integrate web3 tech in education, policy\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p><a href=\"https://cryptoslate.com/companies/sora-ventures/\">Sora Ventures</a> has joined the advisory board of the Consortium for Diplomacy and Global Action (CDGA) at Teachers College, Columbia University, backing efforts to integrate web3 and emerging technologies into global education and policy discussions.</p>\n    <p>The venture firm made a philanthropic donation to support CDGA, which was established with the International Academy for Arts and Cultural Studies and the UN Institute for Training and Research’s New York office.</p>\n    <p><a href=\"https://cryptoslate.com/people/jason-fang/\">Jason Fang</a>, co-founder and managing partner of Sora Ventures, was also appointed to the advisory board to provide guidance on digital financial systems and other transformative technologies.</p>\n    <p>The donation will fund research and educational programs exploring Web3 and digital innovation, with a focus on interdisciplinary collaboration.</p>\n    <p>The initiatives tie into broader UN priorities, including the Pact for the Future and the UN’s High-Level Advisory Body on Artificial Intelligence, both of which emphasize responsible innovation and global cooperation.</p>\n    <p>Fang said the collaboration was designed to help policymakers, students, and practitioners better understand how blockchain and decentralized systems could shape international finance.</p>\n    <p>He also presented on the role of digital assets in advancing the UN’s Sustainable Development Goals at the GloCha UN HQ NY Conference &amp; Exhibit 2025, a forum highlighting how emerging technologies can address global challenges.</p>\n    <p>Founded in 2018, Sora Ventures is an Asia-based venture capital firm specializing in blockchain and digital asset investments. It focuses on early-stage projects that combine <a href=\"https://cryptoslate.com/bitcoin-investing-consortium-including-sora-ventures-acquires-seoul-based-software-firm-sga-co/\">technological innovation and financial infrastructure</a>.</p>\n    <p>The firm has backed initiatives in DeFi, gaming, and infrastructure, and is known for supporting projects that connect digital asset development with mainstream financial adoption.</p>\n    <p>Fang has positioned Sora Ventures as both an investor and thought partner on how blockchain can reshape traditional systems. The firm is also playing a key role in expanding <a href=\"https://cryptoslate.com/?s=Bitcoin\">Bitcoin</a> adoption <a href=\"https://cryptoslate.com/sora-unveils-1-billion-bitcoin-fund-with-200-million-already-committed/\">across Asia</a>.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/sora-ventures-joins-columbia-teachers-college-initiative-to-integrate-web3-tech-in-education-policy/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "paypal-usd-expands-to-tron-network-via-layerzero",
    "title": "PayPal USD Expands to TRON Network via LayerZero",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/2025-09-19-01.00.38-e1758215457274.jpg",
    "source": "https://cryptoslate.com/paypal-usd-expands-to-tron-network-via-layerzero/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Chainwire",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/2025-09-19-01.00.38-e1758215457274.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"PayPal USD Expands to TRON Network via LayerZero\"/>\n    <p>\n      <a href=\"https://cryptoslate.com/advertising/\">▸</a>\n    </p>\n    <p><a href=\"https://cryptoslate.com/news/tron/\">TRON</a>▸</p>\n    <p>\n      <a href=\"https://cryptoslate.com/stablecoins/\">Stablecoins</a>\n    </p>\n    <h1>PayPal USD Expands to TRON Network via LayerZero</h1>\n    <p>PayPal USD's TRON debut leverages LayerZero for seamless cross-chain integration and broader market reach.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/2025-09-19-01.00.38-e1758215457274-768x403.jpg\" alt=\"PayPal USD Expands to TRON Network via LayerZero\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p><strong>Disclosure:</strong> This is a sponsored post. Readers should conduct further research prior to taking any actions. <a href=\"https://cryptoslate.com/sponsored-post-disclaimer\">Learn more ›</a></p>\n    <p><strong>September 18, 2025 – Geneva, Switzerland</strong> – <a href=\"https://trondao.org/\">TRON DAO</a>, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), announced today that PayPal USD will be available on the TRON network through Stargate Hydra as a permissionless token, PYUSD0, leveraging LayerZero’s Omnichain Fungible Token (OFT) Standard. PYUSD0 on TRON reflects PayPal and LayerZero’s work to drive greater availability of PYUSD, enabling the stablecoin to reach the markets that demand it and the users who want it through LayerZero’s distribution network.</p>\n    <blockquote>\n      <p/>\n      <i>“Stablecoins are one of the clearest examples of real-world adoption in crypto, driving everything from payments to remittances,” said Justin Sun, Founder of TRON. “The launch of PYUSD0 on TRON gives both users and institutions greater accessibility, and reflects our ongoing commitment to supporting assets that bring trust, efficiency, and broader access to the digital economy.”</i>\n    </blockquote>\n    <blockquote>\n      <p/>\n      <i>“The US dollar is the foundation of finance. Stablecoins are the killer app within the crypto ecosystem,” said Bryan Pellegrino, Co-Founder and CEO, LayerZero Labs. With PYUSD0, PayPal USD expands its reach and flexibility to work across today’s networks and tomorrow’s. Launches like this make it obvious that we are at the start of a global financial market that breaks down borders and works around the clock.”</i>\n    </blockquote>\n    <p>This integration builds on LayerZero’s acquisition of Stargate. Stargate pioneered the Hydra model for extending assets from a hub blockchain to spoke blockchains. With Stargate integrated into LayerZero, the Hydra model is now applied directly to extend PYUSD to TRON and other blockchains. No action will be required by end users and whether someone holds PYUSD or PYUSD0, it is one unified PayPal USD stablecoin: fully fungible and interoperable across blockchains.</p>\n    <p>The integration is closely aligned with TRON’s mission to deliver efficient, accessible, and secure settlement infrastructure for users and institutions worldwide. TRON has evolved into a core component of the global digital financial infrastructure, dedicated to expanding access and inclusion, with a cumulative transfer volume exceeding $21 trillion since its mainnet launch in 2018. TRON currently hosts over 332 million user accounts on the blockchain, with over $28 billion in total value locked across the ecosystem. On average, the TRON processes around 9 million transactions daily with over 2.83 million daily active accounts. Furthermore, TRON generated nearly $1 billion in protocol revenue driven by real-world activity across the network in each of the first two quarters of 2025, establishing a new all-time high.</p>\n    <p>This integration points to a future where established payment systems, advanced interoperability frameworks, and scalable blockchain networks converge to build the next generation of global financial infrastructure. By aligning PayPal’s expertise in digital payments, LayerZero’s cross-chain architecture, and the TRON blockchain’s scale and global reach, the initiative drives the development of financial systems that are secure, transparent, and inclusive for users worldwide.</p>\n    <h2>\n      <strong>\n        <i>About TRON DAO</i>\n      </strong>\n    </h2>\n    <p>\n      <i>About TRON DAO</i>\n    </p>\n    <p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p>\n    <p>Founded in September 2017 by H.E. Justin Sun, the TRON blockchain has experienced significant growth since its MainNet launch in May 2018. Until recently, TRON hosted the largest circulating supply of USD Tether (USDT) stablecoin, which currently exceeds $76 billion. As of September 2025, the TRON blockchain has recorded over 332 million in total user accounts, more than 11 billion in total transactions, and over $28 billion in total value locked (TVL), based on TRONSCAN. Recognized as the global settlement layer for stablecoin transactions and everyday purchases with proven success, TRON is “Moving Trillions, Empowering Billions.”</p>\n    <p><a href=\"https://tron.network/\">TRONNetwork</a> |<a href=\"https://trondao.org/\"> TRONDAO</a> | <a href=\"https://x.com/TRONDAO\">X</a> |<a href=\"https://www.youtube.com/channel/UC5OPOGRq02iK-0T9sKse_kA\"> YouTube</a> |<a href=\"https://t.me/tronnetworkEN\"> Telegram</a> | <a href=\"https://discord.gg/trondao\">Discord</a> |<a href=\"https://www.reddit.com/r/Tronix/\"> Reddit</a> |<a href=\"https://github.com/tronprotocol\"> GitHub</a> |<a href=\"https://trondao.medium.com/\"> Medium</a> |<a href=\"https://forum.trondao.org/\"> Forum</a></p>\n    <p><strong> Media Contact</strong>Yeweon Park</p>\n    <p>\n      <a href=\"https://cryptoslate.com/cdn-cgi/l/email-protection\">[email protected]</a>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/paypal-usd-expands-to-tron-network-via-layerzero/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "vitalik-buterin-defends-43-day-ethereum-staking-exit-queue-as-11-3b-wa",
    "title": "Vitalik Buterin defends 43 day Ethereum staking exit queue as $11.3B waits in line, what breaks next",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/vitalik-buterin-ethereum-staking.jpg",
    "source": "https://cryptoslate.com/vitalik-buterin-defends-43-day-ethereum-exit-staking-queue-as-11-3b-waits-in-line-what-breaks-next/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Oluwapelumi Adejumo",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/vitalik-buterin-ethereum-staking.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"Vitalik Buterin defends 43 day Ethereum staking exit queue as $11.3B waits in line, what breaks next\"/>\n    <h1>Vitalik Buterin defends 43 day Ethereum staking exit queue as $11.3B waits in line, what breaks next</h1>\n    <p>Despite the six-week exit queues, Ethereum's stringent timeframe is described as a bulwark against validator misconduct.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/vitalik-buterin-ethereum-staking-768x403.jpg\" alt=\"Vitalik Buterin defends 43 day Ethereum staking exit queue as $11.3B waits in line, what breaks next\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p><a href=\"https://cryptoslate.com/coins/ethereum/\">Ethereum</a> co-founder <a href=\"https://cryptoslate.com/people/vitalik-buterin/\">Vitalik Buterin</a> has weighed in on the growing concerns over the network’s staking exit queue, which has now <a href=\"https://cryptoslate.com/ethereum-staking-exit-wait-balloons-to-43-days/\">stretched to more than six weeks</a>.</p>\n    <p>In a Sept. 18 <a href=\"https://x.com/vitalikbuterin/status/1968428048086352285?s=46\">post</a> on X, Buterin framed the process as a deliberate design choice rather than a flaw, comparing it to the discipline of military service.</p>\n    <p>According to Buterin, staking is not a casual activity but a commitment to defend the network. In that light, frictions such as exit delays serve as safeguards.</p>\n    <p>“An army cannot hold together if any percent of it can suddenly leave at any time,” he wrote, stressing that Ethereum’s reliability depends on ensuring validators cannot abandon their role instantaneously.</p>\n    <p>However, Buterin conceded that the current design is not perfect. Nevertheless, he argued:</p>\n    <blockquote>\n      <p>“That’s not to say that the current staking queue design is optimal, rather that if you reduce the constants naively then that makes the chain much less trustworthy from the PoV of any node that does not go online very frequently.”</p>\n    </blockquote>\n    <p>Buterin’s remarks echoed the perspective of Sreeram Kannan, founder of restaking protocol <a href=\"https://cryptoslate.com/coins/eigenlayer/\">EigenLayer</a>.</p>\n    <p>In his own <a href=\"https://x.com/sreeramkannan/status/1968350778697142521?s=46\">post</a> on Sept. 17, Kannan described Ethereum’s prolonged exit period as “a conservative parameter” that acts as a vital security measure.</p>\n    <p>He explained that the wait time protects against worst-case scenarios, such as coordinated validator attacks where participants might attempt to exit before facing slashing penalties.</p>\n    <p>Considering this, Kannan warned:</p>\n    <blockquote>\n      <p>“Unstaking cannot be instantaneous.”</p>\n    </blockquote>\n    <p>He continued that shortening the process to a matter of days could expose Ethereum to attacks that drain its security assumptions.</p>\n    <p>By contrast, the longer window allows for detecting and punishing malicious behavior such as double-signing. This design ensures that misbehaving validators cannot easily escape accountability.</p>\n    <p>Kannan highlighted that this buffer allows inactive nodes to reconnect and periodically validate the correct fork. He argued that competing forks could each claim to be valid without such a mechanism, leaving offline nodes unable to determine the truth when rejoining.</p>\n    <p>He concluded:</p>\n    <blockquote>\n      <p>“Instead of having a fixed long unstaking period, ethereum engineered its exit queue to be instantaneous if only a small amount of stake withdrew in a given period. But if lot of stake wants to withdraw the queue builds up – worst case to several months.”</p>\n    </blockquote>\n    <p>This strong defense comes at a time when <a href=\"https://cryptoslate.com/ethereum-staking-exit-wait-balloons-to-43-days/\">Ethereum’s exit queue</a> has hit historic highs.</p>\n    <p><a href=\"https://www.validatorqueue.com/\">Data</a> from the Ethereum Validators Queue shows that the unstaking backlog now spans 43 days, with over 2.48 million ETH, valued at approximately $11.3 billion, awaiting withdrawal.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/vitalik-buterin-defends-43-day-ethereum-exit-staking-queue-as-11-3b-waits-in-line-what-breaks-next/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-reform-party-opposes-bank-of-england-s-stablecoin-limits-and-cbdc-p",
    "title": "UK Reform Party opposes Bank of England’s stablecoin limits and CBDC plans",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/uk-cbdc-stablecoin-.jpg",
    "source": "https://cryptoslate.com/uk-reform-party-argues-stablecoin-limits-stifle-innovation/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Oluwapelumi Adejumo",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/uk-cbdc-stablecoin-.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"UK Reform Party opposes Bank of England’s stablecoin limits and CBDC plans\"/>\n    <h1>UK Reform Party opposes Bank of England’s stablecoin limits and CBDC plans</h1>\n    <p>The Reform Party has dismissed CBDC as governmental overreach, while advocating for a thriving private stablecoin market.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/uk-cbdc-stablecoin--768x403.jpg\" alt=\"UK Reform Party opposes Bank of England’s stablecoin limits and CBDC plans\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p>The United Kingdom’s minority party Reform has formally rejected the Bank of England’s proposal to cap stablecoin holdings and its broader plan to introduce a <a href=\"https://cryptoslate.com/bank-of-england-advances-design-phase-of-digital-pound-cbdc/\">central bank digital currency (CBDC)</a>.</p>\n    <p>In a Sept. 18 <a href=\"https://x.com/ziayusufuk/status/1968575233784160260?s=46\">statement</a> on X, the party’s head of policy, Zia Yusuf, alongside party figurehead Nigel Farage, warned that the measures would damage Britain’s competitiveness in the global digital economy.</p>\n    <p>Last week, the Bank of England proposed restricting stablecoin exposure for individuals and businesses. Under the draft proposal, citizens would be limited to holding between £10,000 and £20,000 in systemic stablecoins, while businesses would face a maximum cap of £10 million.</p>\n    <p>The regulator argues that the plan aims to reduce financial risks as digital assets become more mainstream.</p>\n    <p>However, the Reform party leaders framed the proposal as an attack on innovation rather than a safeguard.</p>\n    <p>They argued that limiting the use of <a href=\"https://cryptoslate.com/insights/stablecoins-could-face-yield-compression-after-feds-rate-cut/\">stablecoins</a> risks choking off demand for British government debt while strengthening the position of global rivals.</p>\n    <p>According to the statement, dollar–pegged stablecoins like <a href=\"https://cryptoslate.com/coins/usd-coin/\">USDC</a> and <a href=\"https://cryptoslate.com/coins/tether/\">USDT</a> funnel significant liquidity into US Treasuries, reinforcing the dollar’s dominance in digital finance. By contrast, the UK lacks any mechanism equivalent to a backstop demand for gilts.</p>\n    <p>Yusuf wrote:</p>\n    <blockquote>\n      <p>“Now ask yourself: where is the British equivalent? Where is the pound-backed stablecoin with deep liquidity, one that global markets can trust, one that channels fresh demand into UK gilts? It doesn’t exist, because policymakers here have been openly hostile to innovators. Instead of building the future, Britain’s regulators have smothered it.”</p>\n    </blockquote>\n    <p>Considering this, Yusuf argued that “stablecoins are not a danger to financial stability.” Instead, he described the assets as:</p>\n    <blockquote>\n      <p>“[A] bridge between the digital world and the traditional banking system. A bridge between entrepreneurs and customers, between investors and opportunity. They are simply new wrappers around money – safer, faster, programmable money that can settle instantly across borders without costly intermediaries.”</p>\n    </blockquote>\n    <h2>No to CBDC</h2>\n    <p>The Reform Party has also fought hard against the creation of a digital pound.</p>\n    <p>According to the party, a state-backed CBDC would hand the Bank of England “unprecedented control” over financial activity, stifling competition and discouraging private-sector innovation.</p>\n    <p>Instead, they advocate for regulated, privately issued stablecoins that could drive growth without giving government entities direct control over citizens’ wallets.</p>\n    <p>To support that approach, the party said it would advance its proposed Cryptoassets and Digital Finance Bill to establish a transparent and proportionate regulatory framework.</p>\n    <p>By creating rules that balance consumer protection with market freedom, Reform argues the UK could emerge as a leader in the global stablecoin race and generate new employment opportunities in fintech and digital finance.</p>\n    <p>The stance marks another step in the party’s embrace of crypto. Earlier this year, it became one of the first political groups in the UK to accept donations in <a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a> and other digital assets.</p>\n    <p>\n      <i>[Editor’s Note: Context on UK politics. </i>\n    </p>\n    <p>\n      <i>Reform holds five parliamentary seats within the current government behind Labour, Conservatives, Liberal Democrats, SNP, and Sinn Féin. It has minimal sway in current UK legislation.</i>\n    </p>\n    <p>\n      <i>However, a collapse in support for Labour has placed Reform at the top of  YouGov polling for the over-50s around a hypothetical snap election. The next election is scheduled for 2029.]</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/uk-reform-party-argues-stablecoin-limits-stifle-innovation/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "after-usdt-s-global-victory-circle-s-usdc-battles-tether-s-usat-in-650",
    "title": "After USDT’s global victory Circle’s USDC battles Tether’s USAT in $650B USA showdown",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/usdc-tether-usat.jpg",
    "source": "https://cryptoslate.com/after-usdts-global-victory-circles-usdc-battles-tethers-usat-in-650b-usa-showdown/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Liam 'Akiba' Wright",
    "rights": "Unknown",
    "body": "<p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n<p><a href=\"https://cryptoslate.com/news/\">News</a>▸</p>\n<p><a href=\"https://cryptoslate.com/places/us/\">US</a>▸</p>\n<p><a href=\"https://cryptoslate.com/news/tether/\">Tether</a>·</p>\n<p><a href=\"https://cryptoslate.com/news/usdc/\">USDC</a>▸</p>\n<p>\n      <a href=\"https://cryptoslate.com/stablecoins/\">Stablecoins</a>\n    </p>\n<p>A trillion-dollar stablecoin fight is about to play out under new American rules.</p>\n<p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n<p>There’s little doubt that Tether has conquered the world with <a href=\"https://cryptoslate.com/coins/tether\">USDT</a>. With a market cap of $171 billion, it outpaces <a href=\"https://cryptoslate.com/cryptos/stablecoin/\">all other stablecoins combined.</a></p>\n<p>Earlier this month, Tether <a href=\"https://cryptoslate.com/tether-launches-compliant-usat-stablecoin-under-new-leadership/\">introduced</a> a new U.S. dollar stablecoin, USA₮, to compete with <a href=\"https://cryptoslate.com/coins/usd-coin\">USDC</a> in the domestic market under U.S. law.</p>\n<p>The company named Bo Hines to lead its U.S. unit and build issuance and custody around Anchorage Digital and Cantor Fitzgerald, a move disclosed after Congress enacted a federal framework for fiat-referenced tokens.</p>\n<p>USA₮, or USAT, is designed to meet the new regime’s reserve and disclosure requirements. The legislative backdrop arrived on July 18 when the GENIUS Act was <a href=\"https://cryptoslate.com/trump-signs-genius-act-into-law-activating-americas-first-regulatory-framework-for-stablecoins/\">signed</a>, setting monthly reserve attestations, high-quality liquid asset backing, and clear supervisory lanes for both bank and qualified non-bank issuers.</p>\n<p>The competitive field tightened further after Circle completed an initial public offering that raised about <a href=\"https://finance.yahoo.com/news/circle-raises-1-05-billion-230325081.html\">$1.05 billion</a>, with shares priced at $31.</p>\n<h2>The near-term contest now centers on onshore distribution and reserve income</h2>\n<p>U.S. merchants and payment processors want tokens that fit cleanly within money-movement and treasury policies. This means monthly reserve certifications, bankruptcy-remote structures, and straightforward redemption mechanics.</p>\n<p>The GENIUS Act bans issuer-paid yield, which puts the commercial model on a float scale and operating efficiency.</p>\n<p>Circle’s structure routes most reserves into BlackRock’s Circle Reserve Fund, a money-market-style vehicle invested in short-dated Treasuries and repurchase agreements, while Tether has reported a <a href=\"https://cryptoslate.com/tether-reports-5-7-billion-profit-amid-record-127-billion-us-treasury-investments/\">large U.S. Treasury footprint</a> that has grown with stablecoin demand.</p>\n<p>Stablecoin transfer <a href=\"https://cryptoslate.com/stablecoin-volume-outpaced-mastercard-paypal-in-2022-as-digital-payments-wars-loom/\">volumes</a> reached multi-trillion levels this year, reminding treasurers that liquidity and chain coverage now matter as much as brand.</p>\n<p>Policy harmonization outside the U.S. will shape merchant access. The UK’s Financial Conduct Authority closed its consultation on issuance and custody in July, with the Bank of England considering caps on systemic holdings. Per the FCA consultation <a href=\"https://www.fca.org.uk/publications/consultation-papers/cp25-14-stablecoin-issuance-cryptoasset-custody\">CP25/14</a>, authorization, safeguarding, and disclosure are set to tighten in parallel with central bank oversight.</p>\n<p>Hong Kong’s licensing regime took effect on August 1 under the HKMA, and Singapore’s MAS framework for single-currency stablecoins already prescribes reserve composition, capital, and five-day par redemptions.</p>\n<p>A U.S. coin that fits GENIUS rules, a UK coin that meets FCA and BoE requirements, and an MAS-labeled instrument create a pathway for issuers to distribute across major financial hubs without bespoke workarounds.</p>\n<h2>Payments rails will be the practical governor of share capture through 2027</h2>\n<p>Visa has expanded stablecoin settlement to additional networks and to EURC, a step that helps issuers reach acquirers and cross-border payouts with less friction. PayPal extended PYUSD to Arbitrum and outlined Stellar plans, which shows how processors can pull settlement off congested chains when throughput and fees matter for merchant experience.</p>\n<p>Distribution through wallets, acquirers, and card networks puts a premium on integration speed, reporting, fraud tooling, and fiat off-ramps, not only on the unit economics of reserve yields.</p>\n<p>Monthly volumes in USDT and USDC already rival major electronic payment corridors, so small checkout routing or payment settlement improvements can shift token preference in merchant flows.</p>\n<p>The onshore float that fits the U.S. framework will set the scoreboard for the next two years, and the numbers drive clear ranges.</p>\n<p>A base case assumes $400 billion of U.S. onshore stablecoins by late 2026 and $650 billion by late 2027.</p>\n<p>In that path, USDC holds 60 to 65 percent of the onshore pool as a public issuer with established bank and fintech integrations, while USAT reaches 20 to 25 percent as U.S. listings, custody, and settlement partners come online.</p>\n<p>An upside path for Tether lifts the onshore pool to $450 billion by 2026 and $750 billion by 2027, with USAT rising to 30 to 35 percent if Anchorage and Cantor-linked plumbing accelerates adoption in U.S. venues.</p>\n<p>A more conservative path for Tether and faster bank adoption of USDC will push USDC to a 70 to 75% share of a smaller $550 billion pool by 2027.</p>\n<p>These are merchant and policy outcomes, not marketing narratives, and the driver is partner coverage across issuers, acquirers, and custodians.</p>\n<h2>Reserves tell the macro story that sits underneath market share</h2>\n<p>If U.S. onshore stablecoins reach one trillion dollars of float by 2027, the implied Treasury bill bid ranges from $600 billion to $900 billion, depending on whether issuers run 60 to 90 percent in bills.</p>\n<p>The composition matters because front-end yields respond to large, persistent buyers. According to the Bank for International Settlements, strong net inflows to stablecoins have been associated with a modest fall in three-month bill yields over short windows, while outflows show larger adverse effects.</p>\n<p>The Federal Reserve Bank of Kansas City has warned that an asset shift into bills can lower credit supply elsewhere, which introduces questions for bank funding models if stablecoins absorb deposits at scale.</p>\n<p>The U.S. law reframes how merchants and banks treat tokenized dollars. Monthly reserve disclosures and asset quality rules move these instruments near regulated cash equivalents in many treasurer policies, even as the law bans issuer yield.</p>\n<p>That policy architecture favors issuers that already speak the language of attestation and custody segregation. It also gives U.S. banks and broker-dealers a clearer footing for custody and settlement services, which matters for U.S. exchanges, money transmitters, and fintech lenders that handle customer funds.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/after-usdts-global-victory-circles-usdc-battles-tethers-usat-in-650b-usa-showdown/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "dbs-bank-to-accept-tokenized-736m-fund-for-repo-collateral-as-rlusd-go",
    "title": "DBS Bank to accept tokenized $736M fund for repo collateral as RLUSD goes live on DDEx",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/dbs-ripple-franklink.jpg",
    "source": "https://cryptoslate.com/dbs-bank-to-accept-tokenized-736m-fund-for-repo-collateral-as-rlusd-goes-live-on-ddex/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Oluwapelumi Adejumo",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n    <graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/dbs-ripple-franklink.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"DBS Bank to accept tokenized $736M fund for repo collateral as RLUSD goes live on DDEx\"/>\n    <h1>DBS Bank to accept tokenized $736M fund for repo collateral as RLUSD goes live on DDEx</h1>\n    <p>With sgBENJI's launch on the XRP Ledger, Franklin Templeton aims to revolutionize securities trading alongside Ripple's stablecoin initiatives.</p>\n    <graphic src=\"https://cryptoslate.com/wp-content/uploads/2025/09/dbs-ripple-franklink-768x403.jpg\" alt=\"DBS Bank to accept tokenized $736M fund for repo collateral as RLUSD goes live on DDEx\"/>\n    <p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n    <p><a href=\"https://cryptoslate.com/companies/ripple/\">Ripple</a> is expanding its role in digital asset infrastructure through a new partnership with <a href=\"https://cryptoslate.com/ethereum-lands-dbs-tokenized-notes-as-1000-units-rewrite-private-banking/\">DBS Bank</a> and <a href=\"https://cryptoslate.com/companies/franklin-templeton/\">Franklin Templeton</a>, according to a Sept. 18 <a href=\"https://ripple.com/ripple-press/dbs-franklin-templeton-to-launch-trading-and-lending-solutions-tokenised-mmf-ripple-stablecoin-rlusd/\">announcement</a>.</p>\n    <p>According to the firm, the collaboration introduces trading and lending tools built around tokenized collateral and stablecoins, marking a push to bridge traditional markets with blockchain-based liquidity.</p>\n    <p>The initiative is anchored on DBS Digital Exchange (DDEx), which will now list Ripple’s US dollar stablecoin (RLUSD) alongside sgBENJI, the tokenized version of Franklin Templeton’s OnChain US Dollar Short-Term Money Market Fund.</p>\n    <p>This pairing allows institutional clients to exchange stable assets directly, providing both portfolio flexibility and yield opportunities not typically available in volatile crypto markets.</p>\n    <p>Instead of allocating funds to <a href=\"https://cryptoslate.com/coins/bitcoin/\">Bitcoin</a>, <a href=\"https://cryptoslate.com/coins/ethereum/\">Ethereum</a>, or <a href=\"https://cryptoslate.com/coins/xrp/\">XRP</a>, where sharp price movements arguably erode value, clients can rotate into sgBENJI and maintain round-the-clock liquidity.</p>\n    <p>These firms’ executives have framed this development as a step forward in institutionalizing tokenized securities.</p>\n    <p>Ripple President Monica Long <a href=\"https://x.com/MonicaLongSF/status/1968492683569283284\">noted</a> that tokenized assets must offer utility and liquid secondary markets to achieve their potential. She pointed to this collaboration as an example of how stablecoins and tokenized funds can work together to provide practical financial infrastructure.</p>\n    <h2>Franklin Templeton to expand to XRP Ledger</h2>\n    <p>Franklin Templeton is preparing to expand its token interoperability by launching sgBENJI on the XRP Ledger.</p>\n    <p>Roger Bayston, Head of Digital Assets at Franklin Templeton, emphasized that tokenization can “reshape the global financial ecosystem” and highlighted the role of the blockchain network in unlocking new use cases for securities trading.</p>\n    <p>According to RWA.xyz <a href=\"https://app.rwa.xyz/assets/BENJI\">data</a>, the fund is already live on seven other blockchains, including <a href=\"https://cryptoslate.com/coins/stellar/\">Stellar</a>, <a href=\"https://cryptoslate.com/coins/arbitrum/\">Arbitrum</a>, and Base, and currently manages more than $736 million in tokenized assets.</p>\n    <p>The <a href=\"https://cryptoslate.com/xrp-ledger-payment-usage-surges-430-in-2-years-gains-ground-in-defi-and-tokenization/\">integration with the XRP Ledger</a> is expected to push adoption further and strengthen cross-chain functionality.</p>\n    <p>At the same time, DBS is preparing to allow clients to post sgBENJI tokens as collateral for repurchase agreements with banks or as security on third-party lending platforms.</p>\n    <p>The firm argued that this would extend liquidity channels for institutional investors while assuring lenders of tokenized, regulated fund exposure.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/dbs-bank-to-accept-tokenized-736m-fund-for-repo-collateral-as-rlusd-goes-live-on-ddex/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "bitcoin-s-cycle-clock-points-to-a-final-high-by-late-october-will-etfs",
    "title": "Bitcoin’s cycle clock points to a final high by late October, will ETFs rewrite history?",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/fed-ratecut-bitcoin-.jpg",
    "source": "https://cryptoslate.com/bitcoins-cycle-clock-points-to-a-final-high-by-late-october-will-etfs-rewrite-history/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Liam 'Akiba' Wright",
    "rights": "Unknown",
    "body": "<p>\n      <a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a>\n    </p>\n<p>Investors face a rare window where policy and ETF flows decide the Bitcoin cycle fate.</p>\n<p>Cover art/illustration via CryptoSlate. Image includes combined content which may include AI-generated content.</p>\n<p><a href=\"https://cryptoslate.com/coins/bitcoin\">Bitcoin price</a> trades near $117,000 after the Federal Reserve decision on interest rates, as the 1,065-day post-halving window approaches.</p>\n<p>The Fed cut rates by 25bps yesterday, placing Bitcoin’s near-term path at the intersection of policy and a cycle marker <a href=\"https://www.axios.com/2025/09/16/bitcoin-price-pattern-halving\">Axios</a> says has historically captured a “final high” roughly 1,065 days after a prior cycle low.</p>\n<p>The test window runs through late September and early October, then the market will trade into Thanksgiving on flow, dollar, and rate dynamics that can either extend the advance or start the topping process that prior cycles paired with drawdowns of 40 to 60 percent, according to Axios.</p>\n<p>Spot ETF demand is the first lever to watch because it turns the cycle into a flow problem. According to CoinShares’ <a href=\"https://cryptoslate.com/bitcoin-etfs-attract-2-9-billion-in-fresh-capital/\">latest weekly fund-flow update,</a> U.S. spot Bitcoin ETFs saw renewed net inflows in late August and early September, measured in billions of dollars, while SoSoValue tracked a mid-September multi-session inflow streak with a single-day print of around $260 million on September 15.</p>\n<p>Those figures contrast with the post-halving issuance of about 452 Bitcoin per day, calculated as 3.125 Bitcoin per block times roughly 144 blocks per day. When multi-day ETF demand absorbs several thousand Bitcoin per week, the market’s ability to distribute inventory at the highs narrows, and topping processes can lengthen into a plateau rather than a single peak.</p>\n<h2>Macro conditions set the second lever.</h2>\n<p>This month, the euro touched a four-year high against the dollar as cut expectations increased, while front-end Treasury yields eased into the meeting.</p>\n<p>A softer dollar lowers global financial conditions and often correlates with higher beta across risk assets. At the same time, domestic inflation has cooled from last year’s pace, with August headline CPI at 2.5 percent year over year and core at 3.0 percent, according to the Bureau of Labor Statistics.</p>\n<p>The policy outcome will shape whether those tailwinds persist or fade. Throughout the rest of 2025, cuts with dovish language that emphasizes progress on inflation and downplays the need for quick reversals would support the dollar’s drift lower and extend the risk window.</p>\n<p>Cuts that emphasizes vigilance on inflation and a limited runway for further easing would keep rates sticky and reduce the impulse. A no-cut outcome was a low-probability branch, yet it would have tightened financial conditions into quarter-end and left ETF demand to carry more of the load.</p>\n<p>Mining economics frame how deeply price moves are transmitted to the supply side. Hashrate has hovered around 1.0 to 1.12 zettahash per second in recent weeks, with network difficulty near a record around 136 trillion, according to Hashrate Index tracking.</p>\n<p>That backdrop keeps <a href=\"https://cryptoslate.com/bitcoin-hashrate-at-record-margins-pinched-will-miners-sell-or-pivot-amid-ai-power-land%e2%80%91grab/\">hashprice</a> near 53 to 55 dollars per petahash per day, levels broadly consistent with Luxor’s spot readings this month. Because hashprice scales roughly with Bitcoin price and inversely with hashrate, bands for Q4 can be approximated by combining price paths with modest hashrate creep as new rigs energize. Fees remain a smaller component in the current lull, so price carries most of the signal into miner cash flow.</p>\n<p>A simple baseline clarifies the inputs that feed scenario bands through Thanksgiving, November 27.</p>\n<p>With those inputs, the grid below lays out price and miner hashprice ranges into late November across policy tone and ETF flow states. These are bands, not point targets, designed to reflect how cut tone and net flows propagate into price and miner revenue under low-fee conditions and modest hashrate growth.</p>\n<h2>The placement of the cycle clock matters for how those bands are interpreted</h2>\n<p>Axios frames prior “final highs” occurring near the 1,065-day mark, then transitioning to drawdowns that were less severe in the ETF era than in earlier cycles. That adds a second read-through for investors watching the tape into early October.</p>\n<p>My own analysis flagged Nov. 1 as a potential date for the cycle peak based on previous cycle peaks extending from the last halving by roughly 100 days.</p>\n<p>However, if the window delivers a high and ETF demand remains strong, the outcome can be a rounded top with shallower retracements.</p>\n<p>If the window passes without a new high and flows turn mixed, the market can migrate toward the middle cells of the grid where price oscillates under the prior peak while hashprice is constrained by gradual hashrate increases.</p>\n<p>Policy tone will color the flow of data almost immediately. Per Business Insider’s breakdown of <a href=\"https://www.businessinsider.com/fed-rate-cut-this-week-fomc-powell-stock-market-outlook-2025-9\">meeting paths</a>, a dovish cut converts to an easier dollar backdrop and a steeper risk appetite curve, which historically pulls incremental demand into equities and crypto, while a hawkish cut narrows that curve and puts more weight on idiosyncratic flows.</p>\n<p>A no-cut outcome would have tested the lower bands in the table since it removes the near-term easing impulse and tends to firm the dollar. The CPI profile reduces the need for restrictive surprises, according to the BLS figures, yet the chair’s emphasis on data dependence can keep rate-path uncertainty in the foreground even if a first cut arrives.</p>\n<p>ETF flow streaks are the cleanest high-frequency metric to monitor against this policy backdrop. CoinShares’ weekly data provide size and regional composition, and SoSoValue’s daily tallies map whether the post-announcement sessions extend or fade the bid.</p>\n<h2>Translating those numbers into supply absorption is straightforward</h2>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/bitcoins-cycle-clock-points-to-a-final-high-by-late-october-will-etfs-rewrite-history/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "stablecoins-could-face-yield-compression-after-fed-s-rate-cut",
    "title": "Stablecoins could face yield compression after Fed’s rate cut",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin",
    "cover": "https://cryptoslate.com/wp-content/uploads/2025/09/stablecoin-yield.jpg",
    "source": "https://cryptoslate.com/insights/stablecoins-could-face-yield-compression-after-feds-rate-cut/",
    "source_domain": "cryptoslate.com",
    "source_name": "Cryptoslate",
    "author": "Andjela Radmilac",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><a href=\"https://cryptoslate.com/news/bitcoin/\">Bitcoin</a></p><graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2025/09/stablecoin-yield.jpg&amp;w=70&amp;h=37&amp;q=75\" alt=\"Stablecoins could face yield compression after Fed’s rate cut\"/><p><a href=\"https://cryptoslate.com/alpha/\">Alpha</a></p><p><a href=\"https://cryptoslate.com/insights/\">Insights</a></p><p><a href=\"https://cryptoslate.com/insights/category/macro/\">Macro</a></p><p><a href=\"https://cryptoslate.com/insights/category/stablecoins/\">Stablecoins</a></p><h1>Stablecoins could face yield compression after Fed’s rate cut</h1><p>Stablecoins could lose their yield advantage as Fed easing begins.</p><h2>In this insight</h2><p>Launched in 2014, Tether is a blockchain-enabled platform designed to facilitate the use of fiat currencies in a digital manner.</p><p><a href=\"https://cryptoslate.com/coins/usd-coin/\"> <graphic class=\"lazyload logo\" alt=\"USDC\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" data-src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/10/usdc-logo-1.jpg&amp;w=40&amp;h=40&amp;q=75\" data-srcset=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/10/usdc-logo-1.jpg&amp;w=60&amp;h=60&amp;q=75 1.5x, https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/10/usdc-logo-1.jpg&amp;w=80&amp;h=80&amp;q=75 2x\"/> USDC USDC (24h) $0.99974  -0.01% </a></p><graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/10/usdc-logo-1.jpg&amp;w=40&amp;h=40&amp;q=75\" alt=\"USDC\"/><p>USDC is a fully reserved stablecoin pegged 1:1 to the US dollar, issued by Circle Internet Financial Ltd.</p><p><a href=\"https://cryptoslate.com/coins/bitcoin/\"> <graphic class=\"lazyload logo\" alt=\"Bitcoin\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" data-src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2019/09/bitcoin-logo.jpg&amp;w=40&amp;h=40&amp;q=75\" data-srcset=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2019/09/bitcoin-logo.jpg&amp;w=60&amp;h=60&amp;q=75 1.5x, https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2019/09/bitcoin-logo.jpg&amp;w=80&amp;h=80&amp;q=75 2x\"/> Bitcoin BTC (24h) $117,878.60  +2.4% </a></p><graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2019/09/bitcoin-logo.jpg&amp;w=40&amp;h=40&amp;q=75\" alt=\"Bitcoin\"/><p>Bitcoin, a decentralized currency that defies the sway of central banks or administrators, transacts electronically, circumventing intermediaries via a peer-to-peer network.</p><p>Jerome Powell first took office as Chair of the Board of Governors of the Federal Reserve System on February 5, 2018, for a four-year term.</p><p><a href=\"https://cryptoslate.com/companies/tether/\"><graphic class=\"lazyload logo\" alt=\"Tether Limited\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" data-src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2023/01/Tether-EURt-logo.png&amp;w=100&amp;h=100&amp;q=75\" data-srcset=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2023/01/Tether-EURt-logo.png&amp;w=150&amp;h=150&amp;q=75 1.5x, https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2023/01/Tether-EURt-logo.png&amp;w=200&amp;h=200&amp;q=75 2x\"/> </a></p><graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2023/01/Tether-EURt-logo.png&amp;w=100&amp;h=100&amp;q=75\" alt=\"Tether Limited\"/><h4>Tether Limited</h4>Stablecoin Issuer in Asia<p>Tether Limited is the company that introduced Tether (USD₮ or USDT), an asset-backed cryptocurrency stablecoin, in 2014.</p><p><a href=\"https://cryptoslate.com/companies/circle/\"><graphic class=\"lazyload logo\" alt=\"Circle\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" data-src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/09/circle-logo-1.jpg&amp;w=100&amp;h=100&amp;q=75\" data-srcset=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/09/circle-logo-1.jpg&amp;w=150&amp;h=150&amp;q=75 1.5x, https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/09/circle-logo-1.jpg&amp;w=200&amp;h=200&amp;q=75 2x\"/> </a></p><graphic src=\"https://cryptoslate.com/wp-content/themes/cryptoslate-2020/imgresize/timthumb.php?src=https://cryptoslate.com/wp-content/uploads/2018/09/circle-logo-1.jpg&amp;w=100&amp;h=100&amp;q=75\" alt=\"Circle\"/><h4>Circle</h4>Stablecoin Issuer in North America<p>Circle is a global financial technology firm specializing in digital currency innovation and open financial infrastructure.</p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptoslate.com/insights/stablecoins-could-face-yield-compression-after-feds-rate-cut/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "pengu-resumes-rally-after-bullish-retest-0-90-ahead",
    "title": "PENGU Resumes Rally After Bullish Retest—$0.90 Ahead?",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "TL;DR",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/08/PENGU_CB-1.jpg",
    "source": "https://cryptopotato.com/pengu-resumes-rally-after-bullish-retest-0-90-ahead/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Olivia Stephanie",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>TL;DR</strong></p><ul><li>PENGU held support at $0.0316, confirming breakout with Fibonacci targets now at $0.0466 and $0.0761.</li><li>The chart shows a bullish flag pattern; a breakout could push PENGU toward $0.074, more than doubling its current value.</li><li>MACD and Stochastic RSI point to strong momentum, though near-term pullbacks remain a possibility.</li></ul><h2>Price Pushes Higher After Retest</h2><p>Pudgy Penguins (PENGU) was trading at $0.037 at press time, showing a 10% gain in the past 24 hours with a trading volume of $528 million. Over the last week, the token has risen by 9%, signaling stronger interest from traders.</p><p>On the 12-hour chart, PENGU had broken out above a descending channel that had kept prices moving lower since late July. The breakout was confirmed as $0.032 held as support during the retest. Fibonacci levels suggest next targets around $0.047, $0.064, and $0.076, with extended projections pointing toward $0.096 if <a href=\"https://cryptopotato.com/pengu-primed-for-liftoff-bullish-retest-signals-180-move-ahead/\">momentum continues</a>. Analyst Ali Martinez said,</p><blockquote><p>Successful bullish retest! Now</p><a href=\"\">$PENGU</a>has resumed the rally to $0.090!<a href=\"\">https://t.co/SMQle9bmiF</a><a href=\"\">pic.twitter.com/5JEfahtkJb</a><p>— Ali (@ali_charts)</p><a href=\"\">September 18, 2025</a></blockquote><h2>Bullish Flag Signals Higher Target</h2><p>Analyst Bitcoinsensus highlighted a bullish flag pattern forming after months of sideways trading earlier this year. The breakout from accumulation created a steep flagpole, followed by a pullback inside a downward channel.</p><p>This structure is often read as a continuation setup, where consolidation is followed by another push higher. Bitcoinsensus noted,</p><blockquote><p/><a href=\"\">$PENGU</a>Bullish Flag in Play!<p>After strong accumulation, price formed a massive flagpole</p><p>Now consolidating inside a bullish flag channel</p><p>Breakout target sits around $0.074 — momentum could send it flying</p><a href=\"\">#PENGU</a><a href=\"\">#Crypto</a><a href=\"\">pic.twitter.com/WhLBjh1C3W</a><p>— Bitcoinsensus (@Bitcoinsensus)</p><a href=\"\">September 17, 2025</a></blockquote><p>At current levels near $0.037, that would mean more than doubling in price if the breakout confirms.</p><p>In addition, Momentum readings align with the bullish setup. The MACD line has moved above the signal line, and the histogram has flipped positive, pointing to building strength on the upside.</p><p>The Stochastic RSI is trending higher at 78 and 66, close to the overbought range. This suggests intense <a href=\"https://cryptopotato.com/pengu-rockets-higher-as-buy-signal-ignites-rally-buzz/\">buying pressure </a>but also leaves room for short-term pullbacks before further moves higher.</p><p><a href=\"https://cryptopotato.com/wp-content/uploads/2025/09/PENGUUSDT_2025-09-18_12-02-58.png\"><graphic class=\"size-full wp-image-412957\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAyMzkwIDExODQiIHdpZHRoPSIyMzkwIiBoZWlnaHQ9IjExODQiIGRhdGEtdT0iaHR0cHMlM0ElMkYlMkZjcnlwdG9wb3RhdG8uY29tJTJGd3AtY29udGVudCUyRnVwbG9hZHMlMkYyMDI1JTJGMDklMkZQRU5HVVVTRFRfMjAyNS0wOS0xOF8xMi0wMi01OC5wbmciIGRhdGEtdz0iMjM5MCIgZGF0YS1oPSIxMTg0IiBkYXRhLWJpcD0iIj48L3N2Zz4=\" data-spai=\"1\" alt=\"PENGU price chart\" width=\"2390\" height=\"1184\"/></a></p><h2>Growing Presence in Traditional Markets</h2><p>Beyond trading charts, PENGU is establishing itself in traditional finance. The founding team of Pudgy Penguins <a href=\"https://x.com/pudgypenguins/status/1968450489835544791\">reported</a> that both the project and the token made an appearance in Bullish (BLSH) Q2 earnings report on the NYSE. The mention introduced the project to a broader financial audience.</p><p>Structurally, the charts point higher with indicators assuring momentum. Outside attention is coming in as well. PENGU remains under active scrutiny as traders ponder whether the rally can extend toward the projected levels.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/pengu-resumes-rally-after-bullish-retest-0-90-ahead/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "origin-summit-announces-wave-3-animation-powerhouse-maggie-kang-to-joi",
    "title": "Origin Summit Announces Wave 3: Animation Powerhouse Maggie Kang to Join Programming Lineup",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "[PRESS RELEASE – Palo Alto, United States, September 18th, 2025]",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/09/maggie_kang_1758205516ELwxnd1pxx.jpg",
    "source": "https://cryptopotato.com/origin-summit-announces-wave-3-animation-powerhouse-maggie-kang-to-join-programming-lineup/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Chainwire",
    "rights": "Unknown",
    "body": "<p><strong>[PRESS RELEASE – Palo Alto, United States, September 18th, 2025]</strong></p>\n<p><strong>Maggie Kang, the visionary director behind Netflix’s record-breaking K-POP DEMON HUNTERS, will join Origin Summit for an exclusive fireside on global storytelling, fandom, and the rise of culturally-driven IP.</strong></p>\n<p><a href=\"http://story/\">Story</a>, the world’s IP blockchain, in collaboration with Blockworks, today announced that acclaimed animation director Maggie Kang will join the official Origin Summit programming during Korea Blockchain Week in Seoul.</p>\n<p>Kang will appear in an exclusive fireside conversation exploring the future of storytelling through the lens of her personal journey, from breaking into Hollywood to engaging global fandoms and rewriting the rules of how Korean stories are told and celebrated around the world.</p>\n<blockquote><p>“Maggie’s work transcends mediums, genres, and borders. She embodies what Origin Summit is about: visionary IP with global reach, creative integrity, and cultural relevance,” said SY Lee, co-founder and CEO of Story. “We’re beyond excited to have her as part of the event, because K-POP DEMON HUNTERS showcases the full spectrum of what IP can be. It’s a global cultural movement. It drives music charts, sparks fandoms, inspires merchandise, and reshapes how stories move through the world. That’s the kind of programmable, participatory IP future we’re building toward.”</p></blockquote>\n<p><strong>Origin Summit </strong>is the premier institutional event at the intersection of AI, blockchain, finance, and intellectual property. Hosted by Story, in collaboration with Blockworks and Hankyung Media Group, the Summit convenes global leaders to define the infrastructure powering the programmable IP economy.</p>\n<p>Known for redefining female heroes and reshaping the global animation landscape, Maggie’s appearance continues the Summit’s mission to unite the builders, creators, and visionaries transforming how culture becomes capital.</p>\n<p><strong>About Maggie Kang</strong></p>\n<p>Maggie Kang is an animation director, writer, producer, and story artist based in Los Angeles. She is best known for originating, writing, and directing the global phenomenon K-POP DEMON HUNTERS for Netflix and Sony Pictures Animation. The film is Netflix’s most-popular film of all time with 236 million views in the first nine weeks. It had a $19 million theatrical debut, the largest in Netflix history, after already being on the service for 2 months.</p>\n<p>Its soundtrack produced eight Billboard Hot 100 hits, including the #1 single “Golden,” and earned acclaim as the first soundtrack in the last three decades to land three Billboard Top 10 Singles. Critics embraced the film as well, awarding K-POP DEMON HUNTERS a 97% Rotten Tomatoes score, making it the top-performing Netflix original film to date.</p>\n<p>Kang’s K-POP DEMON HUNTERS broke from convention by focusing on distinctly Korean influences while simultaneously rejecting a typical “female superhero” mold seen throughout media. Instead, Kang created funny, flawed, and relatable heroines that not only attracted viewers but also led to an immediate and enormous globally dedicated fandom.</p>\n<p>A veteran of the animation industry, Kang previously served as Head of Story on THE LEGO NINJAGO MOVIE and began her career at DreamWorks, where she contributed as a story artist to the SHREK, KUNG FU PANDA, TROLLS, MADAGASCAR, and CROODS franchises. From Toronto and a graduate of Sheridan College’s classical animation program, she continues to redefine the landscape of animation through cultural authenticity, musical innovation, and groundbreaking global storytelling.</p>\n<p><strong>Previously Announced Speakers</strong></p>\n<p>Maggie Kang joins an already impressive lineup of global heavy-hitters announced in Wave 1 and 2, including creators and executives behind BLACKPINK, Baby Shark, Lineage, and leading institutions across finance, blockchain, and entertainment:</p>\n<ul><li><strong>Kyoung In Jung (CEO, The Black Label)</strong></li><li><strong>Ryan Seungkyu Lee (Co-founder, The Pinkfong Company)</strong></li><li><strong>Arthur Hayes (Founder, Maelstrom)</strong></li><li><strong>Justin Sun (Founder, TRON; Advisor, HTX)</strong></li><li><strong>Amy Oldenburg (Head of Emerging Markets Equity, Morgan Stanley Investment Management)</strong></li><li><strong>Lee Sung-soo (CAO, SM Entertainment)</strong></li><li><strong>Jake Jaekyung Song (Co-founder, Nexon)</strong></li><li><strong>Rayhaneh Sharif-Askary (MD, Grayscale)</strong></li><li><strong>Brandon Yu (President, HYBE APAC)</strong></li><li><strong>Luca Netz (CEO, Pudgy Penguins &amp; Igloo, Inc.)</strong></li><li><strong>Yat Siu (Co-founder &amp; Executive Chairman, Animoca Brands)</strong></li><li><strong>Sandeep Nailwal (Founder &amp; CEO Polygon Foundation and Co-Founder Sentient)</strong></li><li><strong>Jangwon Lee (CEO, Contents Technologies)</strong></li></ul>\n<p><strong>Event Logistics</strong></p>\n<ul><li><strong>Date:</strong>September 23, 2025</li><li><strong>Location:</strong>Seoul, South Korea (during Korea Blockchain Week)</li><li><strong>Format:</strong>Curated for institutional investors, IP holders, AI builders, and cultural leaders</li><li><strong>Website:</strong><a href=\"https://www.originsummit.xyz\">www.originsummit.xyz</a></li><li><strong>Registration:</strong>Limited capacity. Interested parties can request access via the event website.</li><li><strong>Produced by:</strong>Story Protocol, in collaboration with Blockworks and Korea Economic Daily</li></ul>\n<p><strong>About Origin Summit</strong></p>\n<p><a href=\"http://www.originsummit.xyz\">Origin Summit</a> is the premier institutional event at the intersection of AI, blockchain, finance and intellectual property. Hosted by Story, in collaboration with Blockworks and Hankyung Media Group, the Summit convenes global leaders to define the infrastructure powering the programmable IP economy. Taking place during Korea Blockchain Week 2025 in Seoul, Origin Summit will explore how AI, crypto, and capital are converging to unlock the world’s most valuable untapped asset class.</p>\n<p><strong>About Story</strong></p>\n<p>Backed with $136 million from a16z, Polychain, and Samsung Ventures, <a href=\"http://Story\">Story</a> launched its mainnet in February 2025 and has rapidly become the leading blockchain infrastructure for tokenized intellectual property. Story is a blockchain purpose-built to make intellectual property a programmable digital asset with embedded rights. It enables creators, developers, enterprises, and AI labs to turn media, data, and AI-generated content into programmable, legally enforceable digital assets, fueling use cases across AI, entertainment, robotics, and more. Designed for scale, Story bridges the gap between outdated legal frameworks and the realities of AI-era creation, making it possible to track provenance, automate licensing, and unlock new markets for ideas. As the foundation for $IP’s evolution into an internet-native asset class, Story powers a more open, equitable, and composable creative economy.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/origin-summit-announces-wave-3-animation-powerhouse-maggie-kang-to-join-programming-lineup/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "paypal-usd-expands-to-tron-network-via-layerzero",
    "title": "PayPal USD Expands to TRON Network via LayerZero",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "[PRESS RELEASE – Geneva, Switzerland, September 18th, 2025]",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/09/tron_layerzero_resized_1758216114m4YpLKTAWE.jpg",
    "source": "https://cryptopotato.com/paypal-usd-expands-to-tron-network-via-layerzero/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Chainwire",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>[PRESS RELEASE – Geneva, Switzerland, September 18th, 2025]</strong></p><p><a href=\"https://trondao.org/\">TRON DAO</a>, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), announced today that PayPal USD will be available on the TRON network through Stargate Hydra as a permissionless token, PYUSD0, leveraging LayerZero’s Omnichain Fungible Token (OFT) Standard. PYUSD0 on TRON reflects PayPal and LayerZero’s work to drive greater availability of PYUSD, enabling the stablecoin to reach the markets that demand it and the users who want it through LayerZero’s distribution network.</p><blockquote><p>“Stablecoins are one of the clearest examples of real-world adoption in crypto, driving everything from payments to remittances,” said Justin Sun, Founder of TRON. “The launch of PYUSD0 on TRON gives both users and institutions greater accessibility, and reflects our ongoing commitment to supporting assets that bring trust, efficiency, and broader access to the digital economy.”</p></blockquote><blockquote><p>“The US dollar is the foundation of finance. Stablecoins are the killer app within the crypto ecosystem,” said Bryan Pellegrino, Co-Founder and CEO, LayerZero Labs. With PYUSD0, PayPal USD expands its reach and flexibility to work across today’s networks and tomorrow’s. Launches like this make it obvious that we are at the start of a global financial market that breaks down borders and works around the clock.”</p></blockquote><p>This integration builds on LayerZero’s acquisition of Stargate. Stargate pioneered the Hydra model for extending assets from a hub blockchain to spoke blockchains. With Stargate integrated into LayerZero, the Hydra model is now applied directly to extend PYUSD to TRON and other blockchains. No action will be required by end users and whether someone holds PYUSD or PYUSD0, it is one unified PayPal USD stablecoin: fully fungible and interoperable across blockchains.</p><p>The integration is closely aligned with TRON’s mission to deliver efficient, accessible, and secure settlement infrastructure for users and institutions worldwide. TRON has evolved into a core component of the global digital financial infrastructure, dedicated to expanding access and inclusion, with a cumulative transfer volume exceeding $21 trillion since its mainnet launch in 2018. TRON currently hosts over 332 million user accounts on the blockchain, with over $28 billion in total value locked across the ecosystem. On average, the TRON processes around 9 million transactions daily with over 2.83 million daily active accounts. Furthermore, TRON generated nearly $1 billion in protocol revenue driven by real-world activity across the network in each of the first two quarters of 2025, establishing a new all-time high.</p><p>This integration points to a future where established payment systems, advanced interoperability frameworks, and scalable blockchain networks converge to build the next generation of global financial infrastructure. By aligning PayPal’s expertise in digital payments, LayerZero’s cross-chain architecture, and the TRON blockchain’s scale and global reach, the initiative drives the development of financial systems that are secure, transparent, and inclusive for users worldwide</p><p><strong>About TRON DAO</strong></p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON blockchain has experienced significant growth since its MainNet launch in May 2018. Until recently, TRON hosted the largest circulating supply of USD Tether (USDT) stablecoin, which currently exceeds $76 billion. As of September 2025, the TRON blockchain has recorded over 332 million in total user accounts, more than 11 billion in total transactions, and over $28 billion in total value locked (TVL), based on TRONSCAN. Recognized as the global settlement layer for stablecoin transactions and everyday purchases with proven success, TRON is “Moving Trillions, Empowering Billions.”</p><p><a href=\"https://tron.network/\">TRONNetwork</a> |<a href=\"https://trondao.org/\"> TRONDAO</a> | <a href=\"https://x.com/TRONDAO\">X</a> |<a href=\"https://www.youtube.com/channel/UC5OPOGRq02iK-0T9sKse_kA\"> YouTube</a> |<a href=\"https://t.me/tronnetworkEN\"> Telegram</a> | <a href=\"https://discord.gg/trondao\">Discord</a> |<a href=\"https://www.reddit.com/r/Tronix/\"> Reddit</a> |<a href=\"https://github.com/tronprotocol\"> GitHub</a> |<a href=\"https://trondao.medium.com/\"> Medium</a> |<a href=\"https://forum.trondao.org/\"> Forum</a></p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/paypal-usd-expands-to-tron-network-via-layerzero/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "retail-traders-keep-bitcoin-floating-above-117k-but-one-whale-move-cou",
    "title": "Retail Traders Keep Bitcoin Floating Above $117K, But One Whale Move Could Change Everything",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin’s current stability near $117,500 is being shaped almost entirely by retail investors, according to Binance’s latest trading data.",
    "cover": "https://cryptopotato.com/wp-content/uploads/2023/11/Bitcoin_Whale.jpg",
    "source": "https://cryptopotato.com/retail-traders-keep-bitcoin-floating-above-117k-but-one-whale-move-could-change-everything/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Chayanika Deka",
    "rights": "Unknown",
    "body": "<html>\n  <body><p>Bitcoin’s current stability near $117,500 is being shaped almost entirely by retail investors, according to Binance’s latest trading data.</p><p>Inflows show that smaller transactions dominate.</p><h2>Retail Traders Dominate BTC</h2><p>In its latest report, CryptoQuant <a href=\"https://cryptoquant.com/insights/quicktake/68cb7efd6e8c203d2e216927-Binance-Data-Bitcoin-Steadies-Near-117500-as-Retail-Inflows-Dominate-and-Whales-\">revealed</a> that inflows of 0-0.001 BTC recorded nearly 97,000 BTC, and those in the 0.001-0.01 BTC range amounted to about 719,000 BTC. This breakdown highlighted the retail-driven nature of the market, where numerous small contributions are providing liquidity and balance.</p><p>Despite the relatively modest size of these inflows, their collective weight has been sufficient to keep Bitcoin steady at the current levels. At the same time, the absence of large whale inflows, specifically transactions of 100 BTC or more, is notable. This lack of large-wallet activity indicates that the market is not being swayed by concentrated buying power but instead by broader retail participation.</p><p>On the positive side, such a pattern reduces the immediate risk of a sharp downturn often associated with whale selling, and gives Bitcoin a firmer footing in the short term. However, the dependence on retail activity also highlights a structural fragility since, if enthusiasm among smaller investors wanes or if whales suddenly re-enter with significant inflows, the market could face abrupt volatility.</p><p>For now, the balance between consistent retail inflows and muted whale activity has created a period of relative calm, which has allowed Bitcoin to consolidate near its highs. If this trend continues, the market could gradually build momentum toward testing the $120,000 level.</p><p>Despite this, there is still the looming possibility of whale intervention, which is capable of either accelerating upward momentum or triggering a rapid correction.</p><h2>Supportive Setup</h2><p>The retail flows come in the backdrop of the US Federal Reserve making the first interest rate cut for 2025.</p><p>Kushal Manupati of Binance said the 25 bp cut creates a supportive setup for crypto, which would <a href=\"https://cryptopotato.com/us-fed-slashes-interest-rates-by-25-bps-how-will-bitcoins-price-react/\">boost</a> BTC, ETH, and potentially large-cap alts if funding and ETF inflows remain stable. In a statement to <i>CryptoPotato</i>, the exec said</p><blockquote><p>“In crypto, that setup typically sustains demand for BTC and ETH and can expand to high-quality large-cap alts if funding and futures basis remain stable. Watch ETF inflows and on-exchange depth; if those stay firm, market breadth should improve rather than fade.</p><p>From here, labor and inflation data will determine whether another cut is likely this year or whether the Fed pauses. If Fed communication stays consistent, cross-border participation should increase across trading sessions.”</p></blockquote><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/retail-traders-keep-bitcoin-floating-above-117k-but-one-whale-move-could-change-everything/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "ripple-s-xrp-breaks-key-resistance-how-high-can-it-fly",
    "title": "Ripple’s XRP Breaks Key Resistance: How High Can It Fly?",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "TL;DR",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/03/XRP_CB-3.jpg",
    "source": "https://cryptopotato.com/ripples-xrp-breaks-key-resistance-how-high-can-it-fly/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Olivia Stephanie",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>TL;DR</strong></p><ul><li>XRP breaks resistance at $3.10 while RSI and price action show continued bullish momentum.</li><li>Support at $3.03 held firm on September 15; upside targets now extend toward $3.30 and beyond.</li><li>XRP futures open interest hits $9.16B, reflecting strong market participation and growing price confidence.</li></ul><h2>XRP Moves Above Key Resistance Level</h2><p>XRP has moved above the $3.10 level, trading at $3.13 with a 24-hour volume of over $7.5 billion. The asset is now testing the $3.11 mark, which lines up with a descending trendline that has capped price action for months. Analyst DefendDark noted,</p><blockquote><p>Breaking 3.1097?</p><a href=\"\">#XRP</a>on the daily RSI is strong, and the yellow resistance at $3.10 is getting weaker.<p>Believe</p><a href=\"\">#XRPArmy</a>.<a href=\"\">pic.twitter.com/q54guxL90z</a><p>— Dark Defender (@DefendDark)</p><a href=\"\">September 18, 2025</a></blockquote><p>The daily RSI is pushing higher and remains below the overbought level, showing continued strength. The metric has also crossed above its moving average, which often points to building momentum. The price is also holding above the Ichimoku Cloud on the daily chart, a signal that often appears during trend shifts.</p><h2>Support Holds as Price Climbs</h2><p>XRP retested support near $3.03 on September 15 and bounced, indicating that buyers may have defended the level. Analyst EGRAG CRYPTO stated,</p><blockquote><p/><a href=\"\">#XRP</a>Upper and Lower Targets :<p>▫️Lower Targets:</p><br/>Retesting and bouncing from $3.03 is still in the cards, but I believe the retest was completed on September 15th. If we break below this level, we could see a drop to $2.85, which is a strong support on the daily chart. ⚠️…<a href=\"\">pic.twitter.com/wx4VD7yxUF</a><p>— EGRAG CRYPTO (@egragcrypto)</p><a href=\"\">September 18, 2025</a></blockquote><p>If $3.03 fails in the future, $2.85 remains the next support level based on past price reactions.</p><p>On the upside, XRP is now close to the $3.20 level. A close above this area would mark a key step in confirming further strength. From there, the next levels to watch are $3.30 and $3.40. The asset has also <a href=\"https://cryptopotato.com/ripples-xrp-set-to-smash-records-as-fed-cut-and-etf-excitement-build/\">broken out</a> of a falling wedge pattern, which tends to support upward movement.</p><h2>Larger Structure Points to Breakout Potential</h2><p>On the monthly chart, XRP continues to form a bullish flag, similar to the <a href=\"https://cryptopotato.com/xrp-mega-cycle-signals-repeat-of-2017-face-melting-rally/\">setup</a> that led to the 2017 rally. In that cycle, Ripple’s token rose more than 1,100%. If a similar move plays out, the projected target stands near $24.</p><p><a href=\"https://cryptopotato.com/wp-content/uploads/2025/09/G1HyB_hWYAAxbfO.jpeg\"><graphic class=\"size-full wp-image-413011\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxMjAwIDU0NSIgd2lkdGg9IjEyMDAiIGhlaWdodD0iNTQ1IiBkYXRhLXU9Imh0dHBzJTNBJTJGJTJGY3J5cHRvcG90YXRvLmNvbSUyRndwLWNvbnRlbnQlMkZ1cGxvYWRzJTJGMjAyNSUyRjA5JTJGRzFIeUJfaFdZQUF4YmZPLmpwZWciIGRhdGEtdz0iMTIwMCIgZGF0YS1oPSI1NDUiIGRhdGEtYmlwPSIiPjwvc3ZnPg==\" data-spai=\"1\" alt=\"XRP price chart\" width=\"1200\" height=\"545\"/></a></p><p>Fibonacci levels above the current price include $8, $13, and $26. These levels represent possible zones if the current structure expands. Analysts are watching for a strong monthly close to confirm any continuation.</p><p>In addition, XRP futures are now $9.16 billion, followed by open interest. This reflects sustained activity in the derivatives market as XRP went to $3. The trend denotes that traders are holding exposure. An increase in price and open interest shows that people are opening positions expecting market movement.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/ripples-xrp-breaks-key-resistance-how-high-can-it-fly/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "bitcoin-stochastic-rsi-crosses-up-history-says-rally-is-next",
    "title": "Bitcoin Stochastic RSI Crosses Up, History Says Rally Is Next",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "TL;DR",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/05/BTC_CB-9.jpg",
    "source": "https://cryptopotato.com/bitcoin-stochastic-rsi-crosses-up-history-says-rally-is-next/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Olivia Stephanie",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>TL;DR</strong></p><ul><li>Bitcoin’s Stochastic RSI crossover historically preceded rallies; the current signal appeared on September 8 near $117,600.</li><li>Analysts watch $119K–$119.5K resistance; breakout could send BTC to $123K, rejection risks $111.9K retest.</li><li>BTC cycle timing suggests an extended peak into January–February 2026, driven by institutional participation.</li></ul><h2>Stochastic RSI Flashes Bullish Signal</h2><p>Bitcoin’s weekly chart has printed a fresh crossover on the Stochastic RSI, a move that in the past has come ahead of rallies. The signal occurs when the blue %K line moves above the orange %D line from the oversold zone.</p><p>Analyst Ash Crypto commented,</p><blockquote><p>BTC WEEKLY STOCHASTIC RSI HAS CROSSED UP, CONFIRMING A STRONG BULLISH SIGNAL</p><p>EVERY TIME THIS SIGNAL CAME IN THE PAST, BTC WAS OVERSOLD AND THEN PUMPED UP.</p><a href=\"\">pic.twitter.com/4nRSG2c0AX</a><p>— Ash Crypto (@Ashcryptoreal)</p><a href=\"\">September 18, 2025</a></blockquote><p>Similar crossovers were recorded in September 2023, January 2024, September 2024, and March 2025. Each time, Bitcoin followed with a sustained rise. The latest crossover appeared on September 8, 2025, with BTC trading near $117,600.</p><h2>Resistance Levels to Watch</h2><p>Bitcoin is now testing resistance around $119,000–$119,500, an area that has capped price advances in recent months. Analyst Michaël van de Poppe <a href=\"https://x.com/CryptoMichNL/status/1968594485593489492\">remarked</a>,</p><blockquote><p>“The more important part; will $BTC break through this crucial resistance zone?”</p></blockquote><p>Failure to push higher could bring BTC back toward $114,700, or even $111,900, which traders see as a possible entry zone. A clean break above $119,500 would open the way to $123,288, the most recent high where liquidity was taken.</p><p><a href=\"https://cryptopotato.com/wp-content/uploads/2025/09/G1HaPtuXcAEM3N0.jpg\"><graphic class=\"wp-image-413029 size-full\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxMjAwIDkyNyIgd2lkdGg9IjEyMDAiIGhlaWdodD0iOTI3IiBkYXRhLXU9Imh0dHBzJTNBJTJGJTJGY3J5cHRvcG90YXRvLmNvbSUyRndwLWNvbnRlbnQlMkZ1cGxvYWRzJTJGMjAyNSUyRjA5JTJGRzFIYVB0dVhjQUVNM04wLmpwZyIgZGF0YS13PSIxMjAwIiBkYXRhLWg9IjkyNyIgZGF0YS1iaXA9IiI+PC9zdmc+\" data-spai=\"1\" alt=\"Bitcoin (BTC) price chart\" width=\"1200\" height=\"927\"/></a></p><h2>The $117,200 Pivot</h2><p>Analyst Ted pointed to $117,200 as a level to watch. Bitcoin was rejected here earlier, sending it below $115,000. He noted,</p><blockquote><p/><a href=\"\">$BTC</a>is trying to reclaim the $117,200 level.<p>It got rejected the other day, which led to a correction below $115,000.</p><p>If BTC is able to reclaim this level, a move towards $120,000 will happen.</p><p>If Bitcoin fails to reclaim this, a dump towards $113,000 could happen.</p><a href=\"\">pic.twitter.com/y2aTrWojIw</a><p>— Ted (@TedPillows)</p><a href=\"\">September 18, 2025</a></blockquote><p>In the chart, a breakout beyond $117,200 could move prices toward $120,000–$123,300. Conversely, a decrease in <a href=\"https://cryptopotato.com/bitcoin-btc-bulls-eye-137k-but-only-if-this-support-holds-strong/\">momentum</a> would expose the support areas around $113,600–$114,000 with further downside toward $107,400–$108,600 and $101,000–$102,000.</p><p>In addition, Ted also <a href=\"https://x.com/TedPillows/status/1968646687121113517\">commented</a> on the broader cycle, saying, “BTC has historically peaked 1,070–1,080 days after bottom. This time, I’m expecting a longer cycle due to institutional arrival.” He suggested a possible peak in January or February 2026.</p><p>Analysts feel Bitcoin is at a crucial juncture: either confirming a breakout over resistance zones or <a href=\"https://cryptopotato.com/2-worrying-signs-for-bitcoin-btc-despite-the-expected-rate-cuts/\">retreating</a> to test lower levels once more. A steady move upward shall put altcoins on the map for stronger breakouts once Bitcoin consolidates.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/bitcoin-stochastic-rsi-crosses-up-history-says-rally-is-next/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "ethereum-mid-sized-whales-see-unrealized-profits-soar-to-2021-ath-leve",
    "title": "Ethereum Mid-Sized Whales See Unrealized Profits Soar to 2021 ATH Levels",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Ethereum’s mid-sized whale cohort is sitting on massive paper gains, reaching levels not seen since the network’s last market peak almost four years ago.",
    "cover": "https://cryptopotato.com/wp-content/uploads/2024/02/Ethereum_Whale.jpg",
    "source": "https://cryptopotato.com/ethereum-mid-sized-whales-see-unrealized-profits-soar-to-2021-ath-levels/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Wayne Jones",
    "rights": "Unknown",
    "body": "<html>\n  <body><p>Ethereum’s mid-sized whale cohort is sitting on massive paper gains, reaching levels not seen since the network’s last market peak almost four years ago.</p><p>Analyst CryptoOnchain has shared data showing wallets with between 10,000 and 100,000 ETH seeing unrealized profits rise to cycle highs, a sign that historically came right before selling pressure increased.</p><h2>Whale Wallet Profits Mirror Previous Market Top</h2><p>According to the <a href=\"https://cryptoquant.com/insights/quicktake/68cb10c16e8c203d2e2168c4-ETH-Unrealized-Profits-of-Mid-Sized-Whales-Hit-Levels-Last-Seen-at-ATH-in-Nov-20\">analysis</a>, this uptick in unrealized profits among average-sized whales highlights a stage in the cycle where investor psychology can significantly shape price action.</p><p>In previous instances, including the 2021 peak, such levels coincided with either large-scale profit-taking or, at a minimum, heightened selling pressure. While the data does not guarantee an imminent correction, it suggests that the market has entered a zone where whale decisions could dictate Ethereum’s near-term trajectory.</p><blockquote><p>“This does not necessarily mean an immediate correction,” wrote CryptoOnchain. “It highlights a critical stage in the cycle where investor psychology and whale behavior could heavily influence price action.”</p></blockquote><p>The timing of these gains is also notable. Ethereum has rallied more than 95% in the last year and 8.7% over the past month, and was trading at $4,591 at the time of this writing, just 6.9% below its record high of $4,946.</p><p>Furthermore, in the last week, ETH has oscillated between $4,404 and $4,762, with intraday swings between $4,440 and $4,637 in the past 24 hours. This ideally puts whales in a position of strength, as many of them accumulated at significantly lower levels during Ethereum’s consolidation phase.</p><p>Still, the market backdrop is complicating the whale picture. For example, as chartist Ali Martinez reported previously, big investors <a href=\"https://cryptopotato.com/90000-eth-in-just-2-days-is-ethereum-headed-for-a-big-correction/\">sold</a> 90,000 ETH worth more than $400 million in just 48 hours, leaving them with only 15.4 million tokens. Those moves may have been opportunistic profit-taking before yesterday’s Federal Reserve <a href=\"https://cryptopotato.com/us-fed-slashes-interest-rates-by-25-bps-how-will-bitcoins-price-react/\">meeting</a>, but they also showed how quickly whale actions can change the market if sentiment turns.</p><h2>Institutional Signals and Price Trajectory</h2><p>Renewed institutional participation is also helping offset the risk of whale-driven sell-offs. Evidence of this was provided by CQ analyst PelinayPA on September 17, who highlighted that Ethereum’s Fund Market Premium (FMP), which compares futures prices to spot prices, has been steadily <a href=\"https://cryptoquant.com/insights/quicktake/68caaaef756c0b23f07c4e61-Ethereum-Fund-Market-Premium-Signals-Strong-Institutional-Support-Above-68K\">rising</a> since July. That trend shows that institutional buyers are willing to pay more than the current price for exposure, which is often seen as a sign of long-term rallies.</p><p>Meanwhile, on the charts, ETH remains pinned below the $4,850 resistance level after months of climbing within a steep ascending channel, as <a href=\"https://cryptopotato.com/ethereum-price-analysis-can-eth-push-toward-5k-as-bullish-momentum-returns/\">noted</a> in <i>CryptoPotato’s </i>latest pulse check. The asset continues to print higher highs and higher lows, supported by a bullish moving-average crossover, yet momentum is fading as traders await a breakout.</p><p>If whales decide to lock in profits, ETH could revisit the $4,000 zone. But if they hold, or if institutions absorb the selling, analysts see a realistic chance of the altcoin breaking above $5,000 before the month’s end.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/ethereum-mid-sized-whales-see-unrealized-profits-soar-to-2021-ath-levels/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "big-day-for-ripple-and-xrp-etfs-everything-you-need-to-know",
    "title": "Big Day for Ripple and XRP ETFs: Everything You Need to Know",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "TL;DR",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/09/XRP_CB-1.jpg",
    "source": "https://cryptopotato.com/big-day-for-ripple-and-xrp-etfs-everything-you-need-to-know/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Dimitar Dzhondzhorov",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>TL;DR</strong></p><ul><li>The launch of the REX-Osprey XRP ETF (XRPR), described as a “spot ETF with extras,” has been among the most talked-about topics in the crypto community recently.</li><li>Ripple also teamed up with Franklin Templeton and DBS Bank, enabling trading between its RLUSD stablecoin and Franklin’s tokenized money market fund sgBENJI.</li></ul><h2>Breaking News Today</h2><p>Ripple has taken center stage lately, mainly due to the developments on the ETF front. As <i>CryptoPotato</i> <a href=\"https://cryptopotato.com/xrp-etf-launch-imminent-latest-updates-revealed/\">reported</a>, the REX-Osprey XRP exchange-traded fund (under the ticker XRPR) is scheduled for launch today (September 18).</p><p>While the issuer described the investment vehicle as a spot ETF, some industry participants identified features that distinguish it from other such products. The popular Fox Business journalist Eleanor Terrett claimed it will operate as a “spot ETF with extras.”</p><blockquote><p>“To my understanding, it’s a spot product in a ’40 Act wrapper that holds real XRP plus cash, Treasuries, and some derivatives. Basically a spot ETF with extras, and is more regulated than traditional spot products,” she said.</p></blockquote><p>Contrary to the upcoming product, spot crypto ETFs that have already been approved in the United States are registered under the Securities Act of 1933, which governs commodity-based trusts. For a detailed breakdown of how REX-Osprey’s ETF compares to standard spot ETFs, please read our article <a href=\"https://cryptopotato.com/sec-stalls-xrp-and-doge-etf-rollout-how-they-differ-from-btc-and-eth-counterparts/\">here</a>.</p><p>Grayscale has also displayed its intentions to introduce a product that tracks the performance of numerous cryptocurrencies, including XRP.</p><p>Earlier today, CEO Peter Mintzberg <a href=\"https://cryptopotato.com/sec-approves-grayscales-digital-large-cap-fund-for-trading/\">said</a> the US Securities and Exchange Commission (SEC) has approved the Grayscale Digital Large Cap Fund (GDLC) for trading along with the Generic Listing Standards. He also added that the team is working “expeditiously” to launch the first multi-crypto asset ETP with BTC, ETH, XRP, SOL, and ADA as underlying assets. </p><p>The GDLC is specifically designed to give investors exposure to some of the biggest cryptocurrencies, without requiring them to buy and store the coins themselves directly. It will track the CoinDesk Large Cap Select Index and will operate with daily cash creation and redemption of 10,000-share baskets.</p><h2>Ripple’s Prestigious Partnership</h2><p>In addition to the breaking ETF news, the company <a href=\"https://cryptopotato.com/ripple-dbs-bank-franklin-templeton-tap-xrp-ledger-to-launch-tokenized-repo-markets/\">shook hands</a> with the global investment company Franklin Templeton (which has over $1.6 trillion in assets under management) and the leading bank in Singapore, DBS Bank. </p><p>According to the signed memorandum of understanding (MoU), the financial institution will list sgBENJ and RLUSD. The former is a tokenized version of Franklin Templeton’s US dollar money market fund, while the latter is Ripple’s stablecoin, which is pegged to the greenback.</p><blockquote><p>“With this setup, eligible DBS clients can trade RLUSD for sgBENJI tokens, enabling them to rebalance their portfolios into a relatively stable asset 24/7 and within minutes, while earning yield during periods of volatility,” the official announcement reads.</p></blockquote><p>In the next phase of the collaboration, the Singaporean bank plans to explore helping clients unlock liquidity by using their sgBENJI tokens as collateral.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/big-day-for-ripple-and-xrp-etfs-everything-you-need-to-know/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "sui-eyes-old-ath-after-7-daily-jump-is-a-big-rally-coming",
    "title": "SUI Eyes Old ATH After 7% Daily Jump, Is a Big Rally Coming?",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "TL;DR",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/09/SUI_CB.jpg",
    "source": "https://cryptopotato.com/sui-eyes-old-ath-after-7-daily-jump-is-a-big-rally-coming/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "Olivia Stephanie",
    "rights": "Unknown",
    "body": "<html>\n  <body><p><strong>TL;DR</strong></p><ul><li>SUI trades near $3.83 after a 7% gain, testing the top of the downtrend channel resistance.</li><li>The Google-backed protocol by Mysten Labs adds attention as consolidation continues above key support zones.</li><li>SUI’s TVL holds above $2.1B, with consistent capital inflow and renewed bullish interest from analysts.</li></ul><h2>Price Moves Toward Key Resistance</h2><p>SUI gained 7% in the last 24 hours, reaching $3.83. The trading volume for the same period was over $1.7 billion. Over the past week, the token is up 5%. The price is now testing the top of a downtrend channel that has held since earlier this year.</p><p>Chart analysis shows that SUI is approaching the upper boundary of the structure. Crypto analyst Rekt Capital <a href=\"https://x.com/rektcapital/status/1968463920328323344\">said</a>,</p><blockquote><p>“SUI is on the cusp of breaking out from this Downtrending Channel (light blue). A breakout would see SUI revisit the old All Time High area.”</p></blockquote><p>Notably, the previous high sits near $5.35. SUI has formed a series of higher lows in recent weeks. These moves suggest growing interest from buyers. The top of the channel, near $3.80, is a key area. If the price moves above this level and holds, it may open the way toward higher levels.</p><p><a href=\"https://cryptopotato.com/wp-content/uploads/2025/09/G1FjgHyW4AAyJ_2.jpeg\"><graphic class=\"size-full wp-image-412931\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxMjAwIDg2OSIgd2lkdGg9IjEyMDAiIGhlaWdodD0iODY5IiBkYXRhLXU9Imh0dHBzJTNBJTJGJTJGY3J5cHRvcG90YXRvLmNvbSUyRndwLWNvbnRlbnQlMkZ1cGxvYWRzJTJGMjAyNSUyRjA5JTJGRzFGamdIeVc0QUF5Sl8yLmpwZWciIGRhdGEtdz0iMTIwMCIgZGF0YS1oPSI4NjkiIGRhdGEtYmlwPSIiPjwvc3ZnPg==\" data-spai=\"1\" alt=\"SUI price chart\" width=\"1200\" height=\"869\"/></a></p><p>If the <a href=\"https://cryptopotato.com/sui-eyes-3-90-as-supply-shrinks-and-bulls-defend-crucial-support/\">breakout</a> fails, SUI could move back to support near $3.40. Below that, the next range sits between $2.33 and $2.00. This zone acted as a strong base earlier in the year and may do so again if tested.</p><h2>Google Partnership Adds Fuel</h2><p>Recent developments around the SUI network have drawn attention to the project. Google announced its Agents Payments Protocol, built by Mysten Labs, which is the team behind SUI. Analyst Michaël van de Poppe commented,</p><blockquote><p>A massive partnership announcement from</p><a href=\"\">$SUI</a>as Google has announced the Agents Payments Protocol.<p>This has been built by the Mysten Labs team, the founders of</p><a href=\"\">$SUI</a>.<a href=\"\">$SUI</a>&amp;<a href=\"\">$WAL</a>are both partners with Google and I think that the ecosystem is ready to do well.<p>Great…</p><a href=\"\">pic.twitter.com/BhzMagMudf</a><p>— Michaël van de Poppe (@CryptoMichNL)</p><a href=\"\">September 17, 2025</a></blockquote><p>He also noted the current trend, saying there is “great consolidation before a big breakout.” The price has moved within a <a href=\"https://cryptopotato.com/sui-bounce-imminent-chart-hints-at-major-rally/\">tight range</a> for several weeks while forming a clear support structure.</p><h2>Platform Usage Remains Strong</h2><p>SUI’s Total Value Locked (TVL) is $2.116 billion as of September 18, 2025, according to DeFiLlama. TVL reached new highs earlier in the summer and has stayed above $2 billion since then.</p><p><a href=\"https://cryptopotato.com/wp-content/uploads/2025/09/Screenshot-2025-09-18-at-09.32.18.png\"><graphic class=\"size-full wp-image-412930\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZpZXdCb3g9IjAgMCAxMzM4IDgxMCIgd2lkdGg9IjEzMzgiIGhlaWdodD0iODEwIiBkYXRhLXU9Imh0dHBzJTNBJTJGJTJGY3J5cHRvcG90YXRvLmNvbSUyRndwLWNvbnRlbnQlMkZ1cGxvYWRzJTJGMjAyNSUyRjA5JTJGU2NyZWVuc2hvdC0yMDI1LTA5LTE4LWF0LTA5LjMyLjE4LnBuZyIgZGF0YS13PSIxMzM4IiBkYXRhLWg9IjgxMCIgZGF0YS1iaXA9IiI+PC9zdmc+\" data-spai=\"1\" alt=\"SUI TVL\" width=\"1338\" height=\"810\"/></a></p><p>Net inflows on the most recent day came in at $3,852. While this is a small figure, overall capital in the ecosystem has remained steady. Analyst Kaleo <a href=\"https://x.com/CryptoKaleo/status/1968409495211585824\">said</a>,</p><blockquote><p>“Still believe it’s only a matter of time before we see SUI break out of the range it’s been accumulating in… and make a run for all time highs vs. BTC.”</p></blockquote><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/sui-eyes-old-ath-after-7-daily-jump-is-a-big-rally-coming/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "bitcoin-price-analysis-btc-targets-new-highs-as-fed-rate-uncertainty-d",
    "title": "Bitcoin Price Analysis: BTC Targets New Highs as Fed Rate Uncertainty Disappears",
    "category": "test",
    "subcategory": "General",
    "category_slug": "test/general",
    "date": "2025-09-18",
    "excerpt": "Bitcoin’s price is quickly recovering and paving its way toward a new all-time high after the Federal Reserve cuts interest rates by a quarter point and signals there are still more to come in the upcoming year. Therefore, investors’ fears are alleviated, and the market is lik…",
    "cover": "https://cryptopotato.com/wp-content/uploads/2025/09/BTC-Daily-4-scaled.jpg",
    "source": "https://cryptopotato.com/bitcoin-price-analysis-btc-targets-new-highs-as-fed-rate-uncertainty-disappears/",
    "source_domain": "cryptopotato.com",
    "source_name": "Cryptopotato",
    "author": "CryptoVizArt",
    "rights": "Unknown",
    "body": "<html>\n  <body><p>Bitcoin’s price is quickly recovering and paving its way toward a new all-time high after the Federal Reserve cuts interest rates by a quarter point and signals there are still more to come in the upcoming year. Therefore, investors’ fears are alleviated, and the market is likely to rally further in the coming weeks.</p><p>By Shayan</p><h2>The Daily Chart</h2><p>Bitcoin’s daily chart demonstrates a clear bounce from the $107K demand zone and a rise back above the 100-day moving average, located around the $113K mark. After yesterday’s Fed rate cut, the asset is continuing its path toward the $124K supply zone, which aligns with the current BTC all-time high.</p><p>The RSI is also trending above the 50% level, indicating that the momentum has now shifted bullish once again. All these signals point to a potential continuation toward the $124K ATH and likely a further rally toward $130K and even higher.</p><h2>The 4-Hour Chart</h2><p>As the 4-hour chart demonstrates, Bitcoin’s recent rally has occurred after the price successfully broke out of a descending channel, following a swift double bottom rebound at the $108K supply zone.</p><p>The asset has now swept the liquidity pool above the previous $107K high, which can lead to two possible scenarios. The market can either carry on with the uptrend and attack the $124K area once again, or it can pull back at least to the $112K order block, which is the most notable demand zone nearby. Yet, with the RSI still below the overbought region, the price seemingly has more room to grow before a correction occurs.</p><h2>Sentiment Analysis</h2><h3>Open Interest</h3><p>This chart displays the Bitcoin aggregate open interest, which shows the number of open perpetual futures positions. Typically, during bullish market conditions, this metric climbs higher or consolidates, as more and more traders are taking leveraged positions. This is exactly what can be seen on the chart.</p><p>Meanwhile, another interesting observation is that even with the market going through a short-term correction a few weeks ago, the open interest has yet to drop. While this is generally a bullish sign, it also points to the fact that the futures market might still be overheated. Therefore, there is still the probability for a liquidation cascade to happen in the short term, which could cause a flash crash before the market stabilizes again.</p><p><strong>Binance Free $600 (CryptoPotato Exclusive):</strong>(</p><a href=\"https://cryptopotato.com/binance600f/\">Use this link</a>to register a new account and receive $600 exclusive welcome offer on Binance<p><a href=\"https://cryptopotato.com/binance600d/\">full details</a>).</p><p><strong>LIMITED OFFER for CryptoPotato readers at Bybit:</strong></p><a href=\"https://cryptopotato.com/pl/bybit24/\">Use this link</a>to register and open a $500 FREE position on any coin!<p>Disclaimer: Information found on CryptoPotato is those of writers quoted. It does not represent the opinions of CryptoPotato on whether to buy, sell, or hold any investments. You are advised to conduct your own research before making any investment decisions. Use provided information at your own risk. See Disclaimer for more information.</p><p><a href=\"https://www.tradingview.com/ideas/cryptocurrency/\">Cryptocurrency charts</a>by TradingView.</p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://cryptopotato.com/bitcoin-price-analysis-btc-targets-new-highs-as-fed-rate-uncertainty-disappears/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]