[
  {
    "slug": "pm-would-never-have-appointed-mandelson-had-he-known-full-epstein-link",
    "title": "PM would 'never' have appointed Mandelson had he known full Epstein links",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Sir Keir Starmer has said he would \"never\" have appointed Peter Mandelson as his ambassador to the US if he had known the full details of his relationship with convicted paedophile Jeffrey Epstein.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/235a/live/6302c940-923e-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>PM would 'never' have appointed Mandelson had he known full Epstein links</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/235a/live/6302c940-923e-11f0-b391-6936825093bd.jpg.webp\" alt=\"Pool Sir Keir Starmer\"/>\n    <p>Sir Keir Starmer has said he would \"never\" have appointed Peter Mandelson as his ambassador to the US if he had known the full details of his relationship with convicted paedophile Jeffrey Epstein.</p>\n    <p>In his first comments since sacking Lord Mandelson, Sir Keir said the Labour peer went through a proper due diligence process before his appointment, but he added: \"Had I known then what I know now, I'd have never appointed him.\"</p>\n    <p>Sir Keir gave public backing to Lord Mandelson at Prime Minister's Questions on Wednesday only to sack him the following day.</p>\n    <p>It came after emails reported by Bloomberg showed supportive messages Lord Mandelson sent to Epstein in 2008 following his guilty plea.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6133/live/2bce6ee0-0b00-11f0-97d3-37df2b293ed1.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox every day”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "tory-mp-and-shadow-minister-danny-kruger-defects-to-reform",
    "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Conservative MP Danny Kruger has become the first sitting Conservative MP to defect to Reform UK.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2451/live/4ddef9c0-9221-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Tory MP and shadow minister Danny Kruger defects to Reform</h1>\n    <p>Conservative MP Danny Kruger has become the first sitting Conservative MP to defect to Reform UK.</p>\n    <p>Kruger has been an MP since 2019, and sat on Tory leader Kemi Badenoch's team as a shadow work and pensions minister.</p>\n    <p>\"The Conservatives are over,\" he told a press conference, sitting alongside Reform party leader Nigel Farage.</p>\n    <p>Kruger said he had been \"honoured\" to be asked to help Reform prepare for government, and said he hoped that Farage would be the next prime minister.</p>\n    <p>The East Wiltshire MP - who has said he would not be triggering a by-election - said the Conservatives were no longer the main party of opposition.</p>\n    <p>He said: \"There have been moments when I have been very proud to belong to the Tory party\", but added: \"The rule of our time in office was failure.</p>\n    <p>\"Bigger government, social decline, lower wages, higher taxes and less of what ordinary people actually wanted.\"</p>\n    <p>He added: \"This is my tragic conclusion, the Conservative Party is over, over as a national party, over as the principal opposition to the left.\"</p>\n    <p>Although he said he had \"great regard\" for Badenoch, he said the Tory party had a \"toxic brand\", adding: \"We have had a year of stasis and drift and the sham unity that comes from not doing anything bold or difficult or controversial.\"</p>\n    <p>Describing his move leaving a party he has been a member of for 20 years as \"personally painful\", he said his \"mission\" with Reform would be to \"not just to overthrow the current system, it is to restore the system we need\".</p>\n    <p>Responding to the news of the defection, Badenoch said: \"Danny has made his case very clear, that this is not about me.</p>\n    <p>\"I can't be distracted by that, and I'm not going to get blown off course by these sort of incidents.</p>\n    <p>\"I know this is the sort of thing that is going to happen while a party is changing. I'm making sure people understand what Conservative values are.\"</p>\n    <p>Kruger's defection is damaging for Badenoch, not only as a Tory thinker and veteran, but also as the most significant among several from the party moving to Reform.</p>\n    <p>Speaking after the press conference, Kruger told the BBC he had come to the conclusion the Conservative Party doesn't have \"any chance\" of winning the next election.</p>\n    <p>A few weeks ago, Kruger said he agreed with Reform on many issues except public spending, <a href=\"https://hansard.parliament.uk/Commons/2025-07-15/debates/5A153C4B-4507-48BB-B340-F8C9CDC85C17/WelfareSpending?highlight=%22drunken%22#contribution-4FBEEF75-D201-473F-88C0-4AA6CE76E83C\">telling MPs in July</a>: \"There is a problem: they would spend money like drunken sailors.\"</p>\n    <p>Asked about his comment, Kruger said: \"I think we're all sober sailors now, I'm glad to say, because since I said that Reform have corrected their position on welfare spending.</p>\n    <p>\"I was very concerned that we need to really reduce overall benefit spending... Nigel made clear he also wants to bring down overall benefit spending but he does want to support families with children.\"</p>\n    <p>Kruger is the second sitting MP to join Reform UK. Lee Anderson, who was previously a Tory MP, sat as an independent before joining Reform in 2024.</p>\n    <p>Reform now have five MPs in the Commons, having seen two of their MPs elected in the 2024 general election, Rupert Lowe and James McMurdock, leave the party.</p>\n    <p>In 2005, Kruger was working at Conservative campaign headquarters when he was selected as the Conservative candidate to stand against the then-prime minister Tony Blair.</p>\n    <p>However, he stepped back over comments about wanting a \"period of creative destruction\" in public services.</p>\n    <p>His political jobs have included serving as former Conservative Prime Minister David Cameron's speechwriter, penning the \"hug a hoodie\" speech, and as former political secretary to Boris Johnson when he was prime minister.</p>\n    <p>A keen Brexiteer, Kruger described the Brexit vote as \"a heroic blow for a better model\". In May this year, he criticised Reform for \"piggybacking\" on the Tories' work during a debate on Brexit \"in a desperate search to be relevant and to catch up with the Conservative party\".</p>\n    <p>In 2023, <a href=\"https://www.bbc.co.uk/news/uk-politics-65612836\">Kruger was one of the speakers </a>at a National Conservatism Conference, an event organised by a right-wing think tank from the United States, and told delegates that marriages between men and women were \"the only possible basis for a safe and successful society\" and one that \"wider society should recognise and reward\".</p>\n    <p>Kruger, the son of TV chef Prue Leith, is an old Etonian, and studied at Edinburgh and Oxford Universities before becoming a director at the Centre for Policy Studies and later a senior fellow at the Legatum Institute.</p>\n    <p>A Labour Party spokesperson said: \"Nigel Farage can recruit as many failed Tories as he likes – it won't change the fact that he has no plan for Britain.</p>\n    <p>\"Britain deserves better than Reform's Tory tribute act that would leave working people paying a very high price.\"</p>\n    <p>Liberal Democrat deputy leader Daisy Cooper labelled the Conservative Party \"a shell of its former self\" and said Badenoch had pushed lifelong Tories towards her party \"in their droves\".</p>\n    <p>\"Nigel Farage's party is shapeshifting into the Conservatives in front of our very eyes,\" she said.</p>\n    <p>\"It is getting to the point where the only difference between them is just a slightly lighter shade of blue.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4c9f/live/d67d32f0-6b8f-11f0-af20-030418be2ca5.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "us-farmers-are-being-squeezed-and-it-s-testing-their-deep-loyalty-to-t",
    "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "On a scorchingly hot day in the American Midwest, Tim Maxwell is voicing his fears about the future of farming.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/089a/live/d8611090-920f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>\n      <strong>On a scorchingly hot day in the American Midwest, Tim Maxwell is voicing his fears about the future of farming.</strong>\n    </p>\n<p>The 65-year-old has worked the fields since he was a teenager. He now owns a grain and hog farm near Moscow, Iowa - but he's unsure about its prospects.</p>\n<p>\"I'm in a little bit of a worried place,\" says Mr Maxwell, who wears a baseball cap bearing the logo of a corn company.</p>\n<p>He is concerned that American farmers aren't able to sell their crops to international markets in the way they could in previous years, in part because of the fallout from President Trump's tariffs.</p>\n<p>\"Our yields, crops and weather are pretty good - but our [interest from] markets right now is on a low,\" he says. \"It's going to put stress on some farmers.\"</p>\n<p>His fears are not unique. US agricultural groups warn that American farmers are facing widespread difficulty this year, mostly due to economic tensions with China. Since April, the two countries have been locked in a trade war, causing a sharp fall in the number of Chinese orders for American crops.</p>\n<p>American farmers are wounded as a result, economists say. The number of small business bankruptcies filed by farmers has reached a five-year high, according to data compiled by Bloomberg in July.</p>\n<p>With all this economic pain, rural areas could well have turned against Trump. But that doesn't seem to be happening.</p>\n<p>Rural Americans were one of the president's most loyal voting blocs in last year's election, when he won the group by 40 percentage points over Kamala Harris, beating his own margins in 2020 and 2016, according to Pew Research analysis.</p>\n<p>Polling experts say that in the countryside, he is still broadly popular.</p>\n<p>Mr Maxwell says he is sticking with Trump, despite his own financial worries. \"Our president told us it was going to take time to get all these tariffs in place,\" he says.</p>\n<p>\"I am going to be patient. I believe in our president.\"</p>\n<p>So why do so many farmers and other rural Americans broadly continue to back Trump even while feeling an economic squeeze that is driven in part by tariffs - the president's signature policy?</p>\n<h2>Farmers on a 'trade and financial precipice'</h2>\n<p>If you want a window into rural America, the Iowa State Fair is a good start. The agricultural show attracts more than one million visitors over 10 days.</p>\n<p>There is candy floss; deep-fried hot dogs on a stick for $7 (£5) - known as \"corn dogs\"; an antique tractor show; a competition for the biggest boar.</p>\n<p>But when the BBC visited last month, there was another topic of conversation: tariffs.</p>\n<p>\"A lot of people say he's just using tariffs as a bargaining chip, as a bluff,\" says Gil Gullickson, who owns a farm in South Dakota and edits an agriculture magazine.</p>\n<p>\"But I can say: history proves that tariffs don't end well.\"</p>\n<p>In April, what he termed \"liberation day\", Trump imposed sweeping tariffs on most of the world, including a 145% tariff on China.</p>\n<p>In response, China put a retaliatory 125% tariff on American goods - a blow to farmers in the American Midwest, sometimes known as the \"corn belt\", many of whom sell crops to China.</p>\n<p>Last year Chinese companies bought $12.7bn (£9.4bn) worth of soybeans from America, mostly to feed their livestock.</p>\n<p>September is harvest season, and the American Soybean Association (ASA) has warned that soybean orders from China are way below where they should be at this point in the year.</p>\n<p>Tariffs have fluctuated dramatically since they were introduced - and the uncertainty is proving tough for farmers, says Christopher Wolf, a professor of agricultural economics at Cornell University.</p>\n<p>\"China is just so big that when they buy things, it matters - and when they don't, it matters.\"</p>\n<p>The cost of fertiliser has rocketed, too - partly because of trade disputes with Canada, which has raised the cost of potash, a salt imported from Canada by American farmers and used in fertiliser.</p>\n<p>Jon Tester, a former Democrat Senator of Montana, who is a third-generation farmer, told a US news station earlier this month: \"With all these tariffs the president's put on, it's interrupted our supply chain… it's increased the cost of new equipment… and because of the trade and tariffs, a lot of customers have said to heck with the United States…</p>\n<p>\"The people who are new to agriculture, those young farmers who haven't saved money for times like this, they're going to be in trouble and a lot of those folks are going to go broke.</p>\n<p>\"And if this continues, a lot of folks like me are going to go broke too.\"</p>\n<p>American farmers already suffer from high levels of stress. They are more than three times more likely than average to die by suicide, according to a paper by a charity, the National Rural Health Association, which analysed a period before Trump's presidency.</p>\n<p>In a letter to the White House, Caleb Ragland, president of the ASA, warned of a tipping point: \"US soybean farmers are standing at a trade and financial precipice.\"</p>\n<h2>Trump: 'Our farmers are going to have a field day'</h2>\n<p>Supporters of President Trump say that his tariffs will help American farmers in the long run, by forcing countries like China to come to the negotiating table and agree new deals with the US over agriculture.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "filmed-in-a-single-shot-how-adolescence-pulled-off-an-emmys-sweep",
    "title": "Filmed in a single shot: How Adolescence pulled off an Emmys sweep",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Many truly great works of art over the years have been shot in one take - from World War One epic 1917 to the Spice Girls' music video for Wannabe.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fd7d/live/f6453110-923f-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<p>Many truly great works of art over the years have been shot in one take - from World War One epic 1917 to the Spice Girls' music video for Wannabe.</p>\n<p>But a lot of the most famous examples - including that 90s girlband masterpiece - weren't actually shot continuously in real life. They instead simply used some clever editing to made it look like they had been.</p>\n<p>One of the many notable things about Netflix's Adolescence, <a href=\"https://www.bbc.co.uk/news/articles/clyxn4wqkq0o\">which has just won several top prizes at the Emmy Awards,</a> was that all four of its hour-long episodes really did involve filming everything in one go, without interruption.</p>\n<p>It's a shooting technique which was widely praised for making the viewing experience more gripping and immersive when the series was released to huge acclaim in March.</p>\n<p>Audiences were instantly drawn in to the show's bracing depiction of a teenage boy who is accused of stabbing a female classmate. But the series was far more than another procedural crime drama.</p>\n<p>Its exploration of the impact of smartphones and social media on teenagers captured the zeitgeist, tapping into the fears of parents around the world.</p>\n<p>The drama's breakout star was Owen Cooper, a Warrington-born actor who was only 14 when the series was filmed.</p>\n<p>Cooper played the central character, Jamie Miller, a schoolboy who is abruptly woken up by the police storming his house in the show's first episode.</p>\n<p>They find him in his bedroom and place him under arrest. \"You're making a big mistake,\" insists the boy's dad, played by Stephen Graham, who also co-created the series with writer Jack Thorne.</p>\n<p>But as the episode unfolds, it's clear there is no mistake. Damning CCTV evidence ultimately proves Jamie's guilt, and Adolescence begins to examine its key questions: what led to this murder, and what motive could a teenager possibly have had.</p>\n<p>It was a storyline based on real events. \"I read an article about a young boy who'd stabbed a young girl to death, and it made me feel cold,\" <a href=\"https://youtu.be/Wcu3t4yOQbE?si=-lJLGBjecSfL-5RH&amp;t=104\">Graham told Radio X's Chris Moyles</a>.</p>\n<p>A similar but separate teen stabbing hit the headlines just a couple of months later. \"And these two incidents were at the opposite ends of the country,\" Graham noted.</p>\n<p>\"And I just thought, why is this happening? And not just because I'm a father, but I think any human being with a moral compass can look at that situation and think, what's going on with society today that we're in this era where these young boys are stabbing young girls to death?\"</p>\n<p>Graham knew the success of the show would hinge on the young actor chosen to play Jamie, and casting director Shaheen Baig struck gold with Cooper - who had first become interested in acting around the age of 10.</p>\n<p>In a joint interview with Baig, <a href=\"https://www.netflix.com/tudum/features/owen-cooper-shaheen-baig-adolescence\">Cooper explained:</a> \"I don't know where it came from, but I asked my mum and dad if I could start going to drama classes, and I think they were a bit shocked by it because I've always wanted to become a footballer.</p>\n<p>\"I still play football now, and then asking them if I wanted to start drama lessons, it was a bit out of the blue, really.\"</p>\n<p>Baig recalled: \"It was really [about] trying to find somebody with the emotional register to be able to play Jamie.</p>\n<p>\"Owen sent us an improv tape, and I remember first watching that, and thinking, \"OK. He looks great on camera, but also his improv was really smart.\" It felt very natural.\"</p>\n<p>Many of the headlines surrounding Cooper claimed he had never acted before. But that wasn't actually true.</p>\n<p>\"It has frustrated us a bit,\" said drama teacher Esther Morgan, who helped run the weekly acting classes Cooper had attended for two years in Didsbury, Manchester.</p>\n<p>The Adolescence team, <a href=\"https://www.bbc.co.uk/news/articles/cp91yz4p44vo\">she told BBC News in April,</a> had approached the Drama MOB school while casting the series, asking to see tapes of their \"strongest northern boys\".</p>\n<p>\"They kept coming back for Owen,\" she recalled. \"He just had something.\"</p>\n<p>It was true that Cooper didn't have any TV or film credits to his name, but not that he had never tried his hand at acting.</p>\n<p>In fact, Morgan suggested Cooper's comfort with one-take shooting was partly due to the drama school's focus on improvisation.</p>\n<p>When the show launched, Morgan said: \"It felt amazing, but I didn't realise it would be as good as it was, I didn't expect it to be talked about so much.\"</p>\n<p>For several weeks, the series dominated the news agenda, and eventually went on to become Netflix's second most watched English-language series ever (after the first season of Wednesday).</p>\n<p>\"We wanted to pose a question that got people talking on their sofas, in pubs, in schools, maybe even in parliament,\" <a href=\"https://www.theguardian.com/tv-and-radio/2025/mar/18/adolescence-writer-jack-thorne-incel-culture-netflix\">Thorne said.</a></p>\n<p>The government subsequently supported Netflix's proposal to make the drama available to schools. Prime Minister Sir Keir Starmer said there was a need to tackle the \"emerging and growing problem\" the show raised.</p>\n<p>Many critics shared the sentiment in their reviews. \"If you're a parent to a school-age boy... it will chill your blood\" <a href=\"https://www.telegraph.co.uk/tv/2025/03/19/adolescence-review-it-will-chill-the-blood-of-any-parent-of/\">said the Telegraph's Anita Singh</a>. It is a drama so quietly devastating that I won't forget it for a very long time.\"</p>\n<p>Clearly, Emmy voters didn't forget about it either. The show's impact was so undeniable that it was seen as the dead-cert for best limited series.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "armand-duplantis-seals-14th-pole-vault-world-record-third-world-title",
    "title": "Armand Duplantis seals 14th pole vault world record & third world title",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Armand Duplantis has won 12 senior international titles",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/624c/live/84c49290-9241-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/sport/athletics/articles/c1ed6845ng7o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Duplantis seals 14th world record &amp; third world title</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1200/cpsprodpb/2d7c/live/22d11c90-923f-11f0-a1c9-9feb11d883c1.jpg\" alt=\"Armand Duplantis celebrates after breaking the world record in Tokyo \"/>\n    <p>Armand Duplantis has won 12 senior international titles</p>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>History-maker Armand Duplantis soared to his 14th world record with his final attempt as the Swedish superstar continued his pole vault domination by winning a third consecutive world title.</strong>\n    </p>\n    <p>A captivated audience in Tokyo remained in the stadium long after Monday night's other events had concluded to watch the sport's modern-day great become the first human to clear the 6.30m barrier.</p>\n    <p>The 25-year-old has now claimed the past eight global men's pole vault gold medals on offer across both indoor and outdoor competitions following this triumph in the Japanese capital.</p>\n    <p>Returning to the stadium where he achieved the first of those major successes four years ago, Duplantis owned his latest moment in the spotlight with his charisma and breathtaking talent.</p>\n    <p>'What a legend!' Duplantis clears 6.30m to break world record</p>\n    <p>The two-time Olympic champion sealed gold with a first-time clearance at 6.15m to end Emmanouil Karalis' admirable challenge then raised the bar to one centimetre higher than he had ever gone before.</p>\n    <p>Such is the respect from his competitors, the Greek runner-up - who has risen to fourth on the discipline's all-time list amid his pursuit of Duplantis - held a fan for his rival between his agonisingly close first and second attempts.</p>\n    <p>With all eyes fixed upon him, a hush of expectation was replaced by rhythmic applause upon Duplantis' request as he prepared for his final attempt.</p>\n    <p>Japan's National Stadium then erupted as he leapt up from the mat after his successful effort and began his celebrations.</p>\n    <p>\"To be able to give you guys this world record is just amazing,\" Duplantis told the crowd, who had stayed beyond 23:00 local time to watch him seek the record.</p>\n    <p>A fourth world record of 2025 by Duplantis is the most occasions he has improved the mark in a single year in his career, which seemingly continues with no limit in sight.</p>\n    <h2>A $100,000 incentive</h2>\n    <p>Duplantis, widely known by his nickname 'Mondo', made clear his intentions upon reaching the final. The world record was \"on the cards\" in the showpiece.</p>\n    <p>Everybody else had already made that assumption.</p>\n    <p>World record talk has replaced any discussion of the destination of men's pole vault gold medals since he first succeeded Frenchman Renaud Lavillenie as the world record holder by clearing 6.17m in February 2020.</p>\n    <p>And, with World Athletics offering a $100,000 world record bonus, on top of the $70,000 awarded to gold medallists at the championship, there was no lack of motivation to deliver in front of another expectant global audience.</p>\n    <p>Duplantis has already won every major gold available to him, while last year he became the first man to retain the Olympic pole vault title for 68 years at Paris 2024.</p>\n    <p>Now it is a case of how many he will end up with - and, perhaps more pertinently, how high he can go.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/athletics/articles/c1ed6845ng7o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "prince-harry-says-his-conscience-is-clear-over-royal-revelations",
    "title": "Prince Harry says his 'conscience is clear' over Royal revelations",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The Duke of Sussex has said his \"conscience is clear\" following his revealing memoir Spare , and that he did not air his \"dirty linen in public.\"",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/172b/live/646f0aa0-9216-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Prince Harry says his 'conscience is clear' over Royal revelations</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/172b/live/646f0aa0-9216-11f0-85c7-5bdf6c05d36f.jpg.webp\" alt=\"Getty Images Prince Harry in a white shirt and blue jacket\"/>\n    <p>\n      <strong>The Duke of Sussex has said his \"conscience is clear\" following his </strong>\n      <strong>revealing memoir Spare</strong>\n      <strong>, and that he did not air his \"dirty linen in public.\"</strong>\n    </p>\n    <p>Prince Harry and his wife, the Duchess of Sussex, <a href=\"https://www.bbc.co.uk/news/articles/c8x5xrw4g70o\">stepped back from official royal duties in 2020</a>, and also spoke publicly about difficulties with family relationships to <a href=\"https://www.bbc.co.uk/news/uk-56316659\">US talk show host Oprah Winfrey</a> the following year.</p>\n    <p><a href=\"https://www.theguardian.com/uk-news/2025/sep/14/my-conscience-is-clear-prince-harry-on-ukraine-his-family-and-the-media\">Speaking to the Guardian</a> while on a trip to Kyiv, Ukraine, he said: \"I don't believe that I aired my dirty laundry in public. It was a difficult message, but I did it in the best way possible. My conscience is clear.\"</p>\n    <p>His comments came just days after <a href=\"https://www.bbc.co.uk/news/articles/cly14jq42djo\">a short meeting with his father</a>, King Charles, their first meeting in over a year.</p>\n    <p>It was the first time the pair had met since February 2024.</p>\n    <p>The prince, who also appeared with his wife in the 2022 Netflix series Harry and Meghan, also spoke about his upcoming legal case against the Daily Mail's publisher, Associated Newspapers, at the High Court in London.</p>\n    <p>He is suing them over allegations of phone-hacking and other unlawful information gathering along with Sir Elton John, Baroness Lawrence and other public figures.</p>\n    <p>Associated Newspapers has denied claims that it hacked phones, calling them \"preposterous smears\".</p>\n    <p>\"It is not about revenge, it is about accountability,\" said the Prince, who now lives in the US but returned to the UK last week to attend a series of events related to causes he supports.</p>\n    <p>Underlining his \"love\" for the UK, he suggested he would like to return home to see his family more often.</p>\n    <p>He added that for the coming year, \"the focus really has to be on my dad.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8457/live/dca09bc0-921f-11f0-8fd6-f3e5d0b160a2.jpg.webp\" alt=\"Reuters Prince Harry laid a wreath at an unofficial memorial to the dead that has sprung up in the centre of Kyiv\"/>\n    <p>The aim of Prince Harry's visit to the Ukrainian capital was to promote the work of his Invictus Games Foundation and to celebrate the recovery and rehabilitation of thousands of veterans who have suffered life-changing injuries since <a href=\"https://www.bbc.co.uk/news/topics/c1vw6q14rzqt\">the war with Russia</a> began three years ago.</p>\n    <p>\"Nobody should feel embarrassed or ashamed about their disabilities,\" he said. \"It's about flipping from sympathy to admiration and respect.\"</p>\n    <p>After having laid a wreath in memory of the dead, he described the conflict as \"all so unnecessary.\"</p>\n    <p>His work for Invictus, he said, had helped to give him a renewed \"purpose\" after his military career ended, adding that it \"saved me\".</p>\n    <p>He spoke to the British newspaper about the cost of war and how he boxes to relieve stress - punching a punch bag - as well as his portrayal in the media.</p>\n    <p>He stressed that while he felt he had been \"destroyed by certain members of the British press\", he also still felt a lot of love from the British public.</p>\n    <p>In January, the publisher of <a href=\"https://www.bbc.co.uk/news/articles/cp3wn1k6drqo\">the Sun newspaper agreed to pay \"substantial damages\"</a> and apologised to him settle a long-running legal battle over claims of unlawful intrusion into his life.</p>\n    <p>He told The Guardian some events of the last four years have been \"very stressful\" and he had been \"finding out certain things that have really, really hurt.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {}
]