[
  {
    "slug": "completely-different-yet-genuinely-get-on-watch-bbc-correspondents-on-",
    "title": "'Completely different, yet genuinely get on' - watch BBC correspondents on Starmer and Trump",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "President Trump arrives in the UK on Tuesday ahead of his State visit.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/7ab7/live/1f060ef0-92fc-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>'Completely different, yet genuinely get on' - BBC correspondents on Starmer and Trump</h1>\n    <p>President Trump arrives in the UK on Tuesday ahead of his State visit.</p>\n    <p>The BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "eritrean-man-wins-block-on-removal-to-france-under-one-in-one-out-deal",
    "title": "Eritrean man wins block on removal to France under 'one in, one out' deal",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "An Eritrean man who arrived in the UK by small boat has won a last-minute legal claim at the High Court to temporarily block his removal to France.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/dd92/live/93f892f0-930b-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/c1dqe2443l1o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Eritrean man wins block on removal to France under 'one in, one out' deal</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/dd92/live/93f892f0-930b-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"PA Media A group of people thought to be migrants are brought in to the Border Force compound in Dover, Kent, from a Border Force vessel following a small boat incident in the Channel on 9 September. The people getting off the boat are wearing life jackets. \"/>\n    <p>An Eritrean man who arrived in the UK by small boat has won a last-minute legal claim at the High Court to temporarily block his removal to France.</p>\n    <p>The 25-year-old, who reached the UK on 12 August, was due to be returned on Wednesday under the 'one in, one out' returns pilot scheme agreed between the UK and France.</p>\n    <p>Launching the first legal challenge against the deal in the High Court in London, his lawyers successfully argued he needed more time to present evidence that he might have been the victim of modern day slavery.</p>\n    <p>Lawyers for the Home Office argued that he could have claimed asylum in France and that he had shown no evidence of why it was not a safe country.</p>\n    <p>They added that delaying his departure could encourage others allocated to the return flights this week to come forward and make similar claims.</p>\n    <p>The injunction - the first to be brought against the UK-France deal - raises serious questions about whether other migrants allocated to flights will use the same grounds to delay or block their transport out of the UK or are being subjected to rushed decisions.</p>\n    <p>Announcing the judgement on Tuesday evening, Mr Justice Sheldon said: \"I am going to grant a short period of interim relief.\"</p>\n    <p>Papers logged at the High Court show that the man, who cannot be named for legal reasons, left Ethiopia for Europe two years ago, arriving in Italy in April 2025.</p>\n    <p>A month later, he left for France where he was assisted by charities including the Red Cross, before his mother paid $1,400 (£1,024) to smugglers for his Channel crossing to the UK.</p>\n    <p>The court heard that he told his initial screening interview with British officials that he had not been exploited and had been paid when he worked as a labourer in Libya.</p>\n    <p>Asked why he had not sought asylum before arriving in the UK, the man said he had seen people sleeping on the streets in Europe and had concluded there was no support.</p>\n    <p>Officials said he should have claimed asylum there because he was not under the control of trafficking gangs.</p>\n    <p>However, Sonali Naik KC, representing the man, said that the Home Office had not yet assessed whether her client was a victim of trafficking - and there had been no evaluation of whether sending him to France would leave him destitute.</p>\n    <p>The 'one in, one out' scheme was announced by Prime Minister Keir Starmer and French President Emmanuel Macron in July.</p>\n    <p>Under the treaty, France agreed to take back migrants who had travelled to the UK by small boat and had their asylum claim withdrawn or declared inadmissible. For each person returned to France, the UK will accept someone with a case for protection as a refugee who has not attempted to cross the Channel.</p>\n    <p>No one has been removed under the scheme. The first returns to France had been expected to begin from as early as Tuesday.</p>\n    <p>Over the last fortnight, some migrants being held in immigration removal centres, received letters that said they would be put on a scheduled Air France flight departing from Heathrow Airport for Paris at 9am this morning.</p>\n    <p>However, a number of sources told the BBC that some of the potential passengers had been told their departure would be deferred as further representations about their cases were made.</p>\n    <p>Asked by reporters before the High Court ruling if the scheme was a \"shambles\", a government spokesperson said \"no\".</p>\n    <p>They added that the government was \"confident in the legal basis for this pilot, we've taken steps to ensure it's compliant with domestic and international law, as with any policy, we're prepared to respond to any legal scrutiny that occurs\".</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c1dqe2443l1o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "acting-legend-robert-redford-dies-aged-89",
    "title": "Acting legend Robert Redford dies aged 89",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "US acting legend Redford, best known for roles in Butch Cassidy and the Sundance Kid and The Sting, has died at the age of 89.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/0bde/live/611ea440-9320-11f0-873c-3fec77a46911.jpg",
    "source": "https://www.bbc.com/news/articles/c1dqe9ey0kgo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Acting legend Robert Redford dies aged 89</h1>\n    <p>US acting legend Redford, best known for roles in Butch Cassidy and the Sundance Kid and The Sting, has died at the age of 89.</p>\n    <p>In a statement, his publicist Cindi Berger, said: \"Robert Redford passed away on September 16 at his home at Sundance in the mountains of Utah - the place he loved, surrounded by those he loved. He will be missed greatly. The family requests privacy.\"</p>\n    <p>Tributes have been paid to the Oscar-winning star by actors including Meryl Streep and Jane Fonda.</p>\n    <p>Redford, also famous for founding Utah's Sundance Film Festival, won a best director Oscar in 1980 for Ordinary People. He announced his retirement from performing in 2018, having said in 2016 that he was \"tired of acting\".</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0bde/live/611ea440-9320-11f0-873c-3fec77a46911.jpg.webp\" alt=\"Getty Images Robert Redford in a recreation of The Washington Post's offices, in a publicity still for All the President's Men, filmed at Burbank Studios in Burbank, California, 1976.\"/>\n    <p>Hollywood actress Streep, who co-starred with him in Out of Africa, led the tributes, saying: \"One of the lions has passed. Rest in peace my lovely friend.\"</p>\n    <p>Fonda, a lifelong friend of Redford who starred alongside him in films such as 1967's romcom Barefoot in the Park, said he \"was a beautiful person in every way.\"</p>\n    <p>\"It hit me hard this morning when I read that Bob was gone. I can't stop crying. He meant a lot to me and was a beautiful person in every way. He stood for an America we have to keep fighting for,\" she added.</p>\n    <p>Director Ron Howard, <a href=\"https://x.com/RealRonHoward/status/1967946875551514886\">writing on X</a>, described Redford as \"a tremendously influential cultural figure\" and an \"artistic gamechanger\", while actor <a href=\"https://x.com/colmandomingo/status/1967929903736815782\">Colman Domingo posted</a>: \"With love and admiration. Thank you Mr Redford for your everlasting impact. Will be felt for generations. RIP.\"</p>\n    <p>Speaking to the BBC, actor Leonardo DiCaprio described Redford as \"an absolute legend\" and said that his death is a \"horrible loss\".</p>\n    <p>\"Not only was he a great actor and did incredible political films, he was an incredible environmentalist too. He was a hero to a lot of us. It's a great loss.\"</p>\n    <p><a href=\"https://www.threads.com/@jamieleecurtis/post/DOqfwd4kZlN\">Jamie Lee Curtis posted on Threads</a>: \"A life! Family. Art. Transformation. Advocacy. Creation. Legacy. Thank you Robert Redford.\"</p>\n    <p>US President Donald Trump told journalists as he left the White House on Tuesday that \"Robert Redford had a series of years where there was nobody better. There was a period of time when he was the hottest. I thought he was great.\"</p>\n    <p>Former secretary of state and presidential candidate Hillary Clinton described Redford as a \"true American icon\".</p>\n    <p><a href=\"https://www.instagram.com/p/DOqnggEjoYf/?hl=en\">Posting on Instagram</a>, she said: \"I always admired Robert Redford, not only for his legendary career as an actor and director but for what came next.</p>\n    <p>\"He championed progressive values like protecting the environment and access to the arts while creating opportunities for new generations of activists and filmmakers.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7c38/live/b2973630-9301-11f0-a647-dff301f4a439.jpg.webp\" alt=\"Getty Images Butch Cassidy and the Sundance Kid\"/>\n    <p>It was 1969's Butch Cassidy and the Sundance Kid, a Western film about two bank robbers, co-starring Paul Newman, that made Redford an overnight star.</p>\n    <p>But despite his success, Redford was never comfortable with his tag as a good-looking heartthrob.</p>\n    <p>\"People have been so busy relating to how I look, it's a miracle I didn't become a self-conscious blob of protoplasm. It's not easy being Robert Redford,\" he once told New York magazine.</p>\n    <p>He teamed up again with Newman for crime caper The Sting in 1973, also considered a classic.</p>\n    <p>But despite their long-running friendship and on-screen chemistry, the pair never appeared on screen together again.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8607/live/1bd1ef90-9308-11f0-a647-dff301f4a439.jpg.webp\" alt=\"Getty Images Robert Redford on set of Three Days of the Condor (1975)\"/>\n    <p><a href=\"https://www.bbc.co.uk/news/entertainment-arts-25808229\">Redford's biggest contribution to film was arguably Sundance Film Festival</a>, which helped boost independent film-making in the late 80s and early 90s, to rival the period which launched his career.</p>\n    <p>Films that premiered at Sundance and went onto huge success include Four Weddings and a Funeral, Precious, Manchester by the Sea, Little Miss Sunshine, The Blair Witch Project and Get Out.</p>\n    <p>In 2014, Redford spoke to the BBC about the festival, saying at the time: \"I didn't want to do it in New York or LA... I said, let's put it in Utah, let's make it hard to get to. Let's make it weird.</p>\n    <p>\"We started Sundance as a place to come and develop new artists, with the ambition of creating a community and giving them a platform for their work. I don't think our mission has changed at all,\" he explained.</p>\n    <p>\"Thirty years ago, these people had nowhere to go. Now I'm very proud that actually, the directors of Gravity and American Hustle - Alfonso Cuaron and David O Russell - actually came up through Sundance, and now they work in the mainstream.\"</p>\n    <p>Many of the films that make it to the Oscars were helped by Sundance along the way.</p>\n    <p>\"Our film, Coda, came to the attention of everyone because of Sundance,\" <a href=\"https://x.com/MarleeMatlin/status/1967932264098189450\">wrote actress Marlee Matlin</a>, who starred in the film.</p>\n    <p>\"Sundance happened because of Robert Redford. A genius has passed. RIP Robert.\"</p>\n    <p>Coda went on to <a href=\"https://www.bbc.co.uk/news/entertainment-arts-60825096\">win best picture at the Academy Awards</a> in 2022.</p>\n    <h2>On-screen chemistry</h2>\n    <p>Redford's other roles included The Candidate, All the President's Men, Indecent Proposal and The Way We Were.</p>\n    <p>He also turned his hand to directing, including A River Runs Through It, starring Brad Pitt, in 1992, Quiz Show (1994) and The Horse Whisperer (1998), in which he starred opposite Scarlett Johansson and Kristin Scott Thomas.</p>\n    <p>Redford was also a keen environmental campaigner.</p>\n    <p>He leaves behind his wife Sibylle Szaggars who he married in 2009, according to CBS News.</p>\n    <p>He had previously been married to Lola Van Wagenen - the couple had four children before divorcing in 1995.</p>\n    <p>One of their children, Scott, died at the age of two months from sudden infant death syndrome, CBS reports, and James, died of cancer in 2020.</p>\n    <p>He is survived by two daughters - Shauna, an artist, and Amy, a director.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c1dqe9ey0kgo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-bombing-has-been-insane-palestinians-scramble-to-flee-israeli-assa",
    "title": "'The bombing has been insane': Palestinians scramble to flee Israeli assault on Gaza City",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "Thousands of families are attempting to flee Gaza City as the Israeli military confirms it has begun ground operations that are part of its large-scale assault aimed at occupying the city.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/0cf9/live/10ad6740-92de-11f0-950e-eb051178bae0.jpg",
    "source": "https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>'The bombing has been insane': Palestinians scramble to flee Israeli assault on Gaza City</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0cf9/live/10ad6740-92de-11f0-950e-eb051178bae0.jpg.webp\" alt=\"Anadolu via Getty Images A man with a bandaged hand steers the handlebars of a bicycle while two small children lie on the front bars and seat. Some bags hang from the bike's handlebars as they journey in the night, with a bright light shining on to them.\"/>\n    <p>Thousands of families are attempting to flee Gaza City as the Israeli military confirms it has begun ground operations that are part of its large-scale assault aimed at occupying the city.</p>\n    <p>Lina al-Maghrebi, 32, a mother of three from the city's Sheikh Radwan neighbourhood told the BBC she had resisted leaving her home - despite the danger - until she received a phone call from an Israeli officer ordering her to evacuate.</p>\n    <p>\"I was forced to sell my jewellery to cover the cost of displacement and a tent,\" she said. \"It took us 10 hours to reach Khan Younis, and we paid 3,500 shekels (£735) for the ride. The line of cars and trucks seemed endless.\"</p>\n    <p>Israeli Prime Minister Benjamin Netanyahu said a \"powerful operation\" had been launched in Gaza City, which he described as Hamas's last major stronghold.</p>\n    <p>The Israeli military has designated al-Rashid coastal road as the only permitted route for civilians to use to evacuate. Many have described severe congestion, endless queues of cars and trucks, and long delays, with families stranded on the roadside while airstrikes continue overhead.</p>\n    <p>The operation has drawn widespread international condemnation, including from the UN human rights chief and German foreign minister.</p>\n    <p>UK Foreign Secretary Yvette Cooper called the offensive \"utterly reckless and appalling\", saying it would \"only bring more bloodshed, kill more innocent civilians and endanger the remaining hostages\".</p>\n    <p>But US Secretary of State Marco Rubio appeared to offer tacit support for Israel's operation during a joint press conference with Netanyahu on Monday, saying the US preferred a negotiated end to the war, but that \"sometimes when you're dealing with a group of savages like Hamas, that's not possible\".</p>\n    <p>Israel's ramped up offensive comes as a United Nations commission of inquiry released a report on Tuesday that says <a href=\"https://www.bbc.com/news/articles/c8641wv0n4go\">Israel is committing genocide against Palestinians in Gaza</a>. Israel categorically rejected the report.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7d3b/live/a4cfe0c0-92dd-11f0-950e-eb051178bae0.jpg.webp\" alt=\"Anadolu via Getty Images Dozens of people carrying heavy luggage, using cars and carts, walk down a barren road at dusk. \"/>\n    <p>Nivin Imad al-Din, 38, a mother of five, said she fled south after Israeli warplanes dropped evacuation leaflets in her neighbourhood, though her husband refused to leave their home.</p>\n    <p>\"I couldn't take my furniture with me because I couldn't afford the cost of a large truck,\" she explained. \"Leaving everything behind was the hardest decision I've ever made.\"</p>\n    <p>The cost of displacement has surged far beyond the reach of most households. Residents said renting a small truck now costs around 3,000 shekels (£630), while a tent for five people sells for about 4,000 shekels (£840). With most families deprived of income since the war began, some are forced to walk for miles or remain in their homes despite the risks.</p>\n    <p>Overnight into Tuesday, Israeli warplanes carried out a wave of heavy airstrikes across Gaza City, with concentrated bombardment on the central al-Daraj neighbourhood, the Beach refugee camp in the west, and Sheikh Radwan in the north.</p>\n    <p>The attacks were accompanied by artillery fire, drone fire and helicopter gunship activity.</p>\n    <p>The Israel Defense Forces said it was \"gradually\" moving into Gaza City as part of the \"next phase\" of its offensive.</p>\n    <p>It said air and ground forces would be part of this next stage of the military's operation, with the number of troops increasing day-by-day.</p>\n    <p>Residents described the overnight strikes as \"hell\".</p>\n    <p>Ghazi al-Aloul, a displaced resident from northern Gaza, told the BBC he is now sleeping at the entrance of al-Quds Hospital in Tel al-Hawa, southwest Gaza.</p>\n    <p>\"I did not choose this,\" he said. \"I was forced after leaving the home where my family and I had been sheltering for nearly a month after fleeing the north\".</p>\n    <p>\"The bombardment has been insane for hours, and the army is threatening to demolish several residential buildings in the area.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/f941/live/a1aba0e0-92de-11f0-84c8-99de564f0440.jpg.webp\" alt=\"Anadolu via Getty Images At night, in the dark, a stream of cars slowly moves down a coastal road. \"/>\n    <p>Sami Abu Dalal, from al-Daraj in central Gaza, described the night as \"extremely difficult\".</p>\n    <p>\"Whole residential blocks were levelled on top of their inhabitants, leaving many dead, missing, or injured,\" he said.</p>\n    <p>He said Israel was advancing on three fronts - and was accompanied by the use of<strong> </strong>booby-trapped vehicles, intense airstrikes, and heavy shelling. Meanwhile, Apache helicopters hovered over different parts of the city, firing continuously.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-hopes-for-0-tariff-on-steel-exports-to-us-dashed",
    "title": "UK hopes for 0% tariff on steel exports to US dashed",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "A proposed deal to eliminate tariffs on UK steel exports to the US has been put on hold indefinitely, the BBC understands.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/c8ce/live/1d90ed90-931c-11f0-873c-3fec77a46911.jpg",
    "source": "https://www.bbc.com/news/articles/cj4y2gge7p1o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>UK hopes for 0% tariff on steel exports to US dashed</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c8ce/live/1d90ed90-931c-11f0-873c-3fec77a46911.jpg.webp\" alt=\"Getty Images Manual worker on a workshop grinding big steel pipe&#10;\"/>\n    <p>A proposed deal to eliminate tariffs on UK steel exports to the US has been put on hold indefinitely, the BBC understands.</p>\n    <p>Tariffs of 25% are currently applied to steel exports to the US, which make up 6% of all UK steel exports by volume and 9% by value.</p>\n    <p>Other countries face tariffs of 50% and so senior government sources insist that the UK is in a competitive position relative to others.</p>\n    <p>This comes as President Donald Trump hailed the \"great honour\" of being hosted by King Charles at \"the ultimate\" Windsor Castle for his second state visit, and hinted at possible tariff relief for UK steel.</p>\n    <p>The UK and US signed a trade deal in June that reduced tariffs on car and aerospace imports to the US, but failed to agree on terms for British steel, leaving tariffs on it at 25%.</p>\n    <p>Speaking to reporters as he boarded Air Force One, Trump said he is \"into helping\" Britain on fine-tuning the UK-US trade deal.</p>\n    <p>\"They want to see if they can refine the trade deal a little bit,\" he said</p>\n    <p>\"We've made a deal, and it's a great deal, and I'm into helping them.</p>\n    <p>\"They'd like to see if they could get a little bit better deal. So, we'll talk to them.\"</p>\n    <p>His comments will be welcomed by Peter Kyle, the new business secretary, who said that tariff relief for British steel is being negotiated.</p>\n    <p>Senior government sources insist there \"remains a path to zero\".</p>\n    <p>Over the weekend, Liam Byrne, the Labour chair of the Commons Business and Trade Committee, said the state visit is \"no mere pageant\" and warned the government that \"we can't escape the truth that Britain now trades with its biggest partner on terms that are worse than the past\".</p>\n    <p>An agreement to reduce the tariffs to zero in short order was welcomed with some fanfare at the time by the government and the industry in July.</p>\n    <p>At the time the 25% tariff was first imposed, steel executives described the move as \"devastating\".</p>\n    <p>However, industry sources told the BBC on Tuesday that while the news was disappointing, the UK still enjoyed a comparative advantage over other producers who face 50%.</p>\n    <p>One added that it at least gave the industry some certainty in a world where a surplus of cheap steel was causing many countries to erect trade barriers to protect their domestic industry. Gareth Stace from UK Steel said the UK should do the same.</p>\n    <p>\"It is even more imperative now that the UK government beefs up its own trade defences to ensure UK steelmakers have a sustainable share of their own market. In these market conditions, the last country to protect their industry will be the first to lose it,\" he said.</p>\n    <p>A government spokesperson said: \"We are continuing to work closely with the US to deliver certainty for UK industry, protect skilled jobs and support economic growth as part of our Plan for Change.\"</p>\n    <p>\"We are still the only country to benefit from a 25% tariff on steel exports to the US, reinforcing our position as a trusted source of high-quality steel.\"</p>\n    <p>Andrew Griffith, the shadow business and trade secretary, criticised Prime Minister Keir Starmer over the development.</p>\n    <p>\"The Prime Minister claimed credit for negotiating steel tariffs to zero,\" he said.</p>\n    <p>Hopes of a hasty deal to remove tariffs completely hit snags as US officials raised questions about the exports from the UK's largest steel maker Tata, which has shut down its blast furnaces - meaning that steel is not made from scratch in the UK - pending the completion of new Electric Arc furnaces due to be completed in 2027.</p>\n    <p>The steel industry in the UK is in considerable financial distress. The government has taken over running Chinese-owned plants in Scunthorpe while Liberty Steel plants in Rotherham and Stocksbridge collapsed into government control last month.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cj4y2gge7p1o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "teacher-s-fears-over-southport-killer-were-met-with-red-tape",
    "title": "Teacher's fears over Southport killer were met with 'red tape'",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "A teacher emailed her colleague in frustration at the \"frightening red tape\" preventing her from getting police, social services and mental health interventions for the Southport killer, a public inquiry heard.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/9cdb/live/0fef7d90-624e-11f0-b903-f515e3045d80.jpg",
    "source": "https://www.bbc.com/news/articles/cvgvd15x8d7o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Teacher's fears over Southport killer met with 'red tape'</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9cdb/live/0fef7d90-624e-11f0-b903-f515e3045d80.jpg.webp\" alt=\"Getty Images Members of the public look on from in front of blue and white police tape as police officers stand in a road filled with police vans and cars, with debris strewn across it.\"/>\n    <p>A teacher emailed her colleague in frustration at the \"frightening red tape\" preventing her from getting police, social services and mental health interventions for the Southport killer, a public inquiry heard.</p>\n    <p>Violence-obsessed Axel Rudakubana had assaulted other children, attacked his own father and been caught carrying knives between 2019 and July 2024, when he murdered three girls at a dance studio.</p>\n    <p>But different agencies - including Prevent, MI5 and social services - appeared to pass his case between them, the inquiry heard.</p>\n    <p>Nicholas Moss KC, lead counsel to Southport Inquiry, said it would focus in the coming months on whether any agencies involved had \"taken responsibility\".</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/38b9/live/d3ae8de0-8e52-11f0-b391-6936825093bd.jpg.webp\" alt=\"Family handouts Left to right: Bebe King, Elsie Dot Stancombe and Alice Aguiar in school uniforms\"/>\n    <p>Delivering his opening statement, Mr Moss said it was \"notable\" that the then 17-year-old appeared to have deliberately targeted women and girls when he chose to attack the Taylor Swift-themed dance workshop.</p>\n    <p>Nine-year-old Alice Aguiar, Elsie Dot Stancombe, seven, and Bebe King, six, were killed and eight other children and two adults were seriously wounded.</p>\n    <p>The inquiry, sitting at Liverpool Town Hall, had been set up to explore the killer's history, his contact with relevant agencies and any \"missed opportunities\" to prevent the \"manifestly and extremely cowardly\" attack</p>\n    <p>Mr Moss said the \"red tape\" email was sent by Cheryl Smith, a safeguarding lead at Presfield High School in Southport, who had been trying to get the teenager to attend school for around a year.</p>\n    <p>He said the school's efforts \"came to a head\" on 21 March 2023 when Ms Smith wrote:</p>\n    <p>\"The red tape is frightening – [Rudakubana] was not under the remit of the children missing education team although not seen by the school since 25 May 2022.</p>\n    <p>\"Doesn't meet threshold for police welfare check as we can't say we think a crime is committed/emergency risk to him. Sefton Welfare team tell us to do the above.</p>\n    <p>\"Lancashire [Special Educational Needs] tell us to ring police (who won't go) and Lancashire social care MIGHT say he doesn't meet their remit.</p>\n    <p>\"Short of breaking in I don't know how to see this kid.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/88da/live/4cf12560-8e52-11f0-b199-41ee52afc86b.jpg.webp\" alt=\"PA Media Flowers laid for victims outside Southport Town Hall in the aftermath of the knife attacks\"/>\n    <p>Mr Moss said the first phase of the inquiry would focus on three \"central themes\" - whether agencies \"took responsibility or ownership\" for his case, whether anyone was looking at the \"overall picture\" of his risk, and what \"fundamental change\" may be necessary to make the system work.</p>\n    <p>Mr Moss said the killer's internet use and purchase of weapons - including machetes and archery equipment - would also be significant.</p>\n    <p>The inquiry has heard on the morning of the attack the teenager searched the social media platform X for \"Mar Mari Emmanuel stabbing\"- which brought up a graphic video showing Bishop Emmanuel being attacked in a church in Sydney, Australia.</p>\n    <p>Mr Moss said although most of his search history had been deleted, detectives found he had very recently viewed a PDF file called \"excerpt from Kamikaze death poetry\".</p>\n    <p>One tablet recovered from his house included downloads of material including documents about genocide, torture and weapons, an image of Hitler and a picture of a wolf in a suit with the caption: \"Just be a lone wolf bro\".</p>\n    <p>One document, which formed part of a terrorism charge Rudakubana admitted, was a study of an Al-Qaeda Training Manual - although police also found \"anti-Islamic\" material.</p>\n    <p>On another device police found screenshots of \"very disturbing\" images including graphic injuries, slavery, mistreatment of women and Nazi Germany.</p>\n    <h2>'No terrorist ideology'</h2>\n    <p>The inquiry heard his behaviour at school began to \"deteriorate rapidly\" from the start of Year 9, when he was 13.</p>\n    <p>Teachers at the Range High School in Formby had reported incidents including hitting other children, and commenting \"that's why teachers get murdered\" when he was given a detention.</p>\n    <p>He was expelled from mainstream education in October 2019 after admitting he had taken a knife to school because he \"wanted to kill a bully\".</p>\n    <p>In the December, he went back to the school and attacked a pupil with a hockey stick while carrying a knife in his backpack.</p>\n    <p>This resulted in him pleading guilty to assault and carrying an offensive weapon.</p>\n    <p>Between 2019 and 2021, he was referred to the government's counter-extremism service Prevent three times by teachers concerned at comments he had made, and internet searches for topics including \"school shootings\" and terror attacks.</p>\n    <p>But on each occasion, including after a multi-agency meeting with MI5, the referrals were closed by counter terrorism officers because no \"terrorist or domestic extremist ideology\" was identified.</p>\n    <p>Mr Moss said during that time, various teams within Lancashire County Council's social services department opened and closed cases with him.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0c32/live/b0585620-5c00-11f0-9142-41d59aceb1f6.png.webp\" alt=\"PA Media Chair Sir Adrian Fulford sitting inside the hearing room at Liverpool Town Hall, Liverpool, ahead of the start of the inquiry\"/>\n    <p>Mr Moss said the killer's father, Alphonse, asked for support from social workers and mental health services when his behaviour became increasingly unmanageable.</p>\n    <p>On different occasions ahead of the attack, the teenager kicked his father, poured milk over him and threatened him with a knife, the inquiry heard.</p>\n    <p>Mr Moss also said the inquiry would also address the behaviour of certain individuals, including taxi driver Gary Poland, who dropped the killer off at the dance studio.</p>\n    <p>Dashcam footage showed Mr Poland saw the teenager enter the building at 11:45 BST. Children began to run out screaming a few seconds later.</p>\n    <p>But Mr Poland, who will give evidence at a later date, drove away from the scene and collected another fare before eventually calling the police at 12:46.</p>\n    <p>The inquiry heard he told the police he was \"sorry\" and had acted out of \"complete shock\".</p>\n    <p>Alphonse Rudakubana had also disclosed to police that he found a bow and arrow in his son's bedroom around a week before the attack, and had signed for deliveries of machetes his son had ordered online.</p>\n    <p>Mr Moss said the killer's family would be questioned on what items they may have found around the house and what \"steps\" they took to try and recover knives.</p>\n    <p>He told the inquiry this was \"particularly important\" because on 22 July 2024, a week before the attack, Mr Rudakubana had stopped his son getting into a taxi to Range High School with a rucksack on, which he suspected contained a knife.</p>\n    <p>Earlier, Sir Adrian Fulford, chairman of the inquiry, promised to do everything \"humanly possible\" to answer the questions of bereaved families and victims.</p>\n    <p>The inquiry continues.</p>\n    <p>\n      <i>Listen to the best of BBC Radio Merseyside on </i>\n      <i>BBC Sounds</i>\n      <i> and follow BBC Merseyside on </i>\n      <i>Facebook</i>\n      <i>, </i>\n      <i>X</i>\n      <i>, and </i>\n      <i>Instagram</i>\n      <i>, and watch BBC North West Tonight on </i>\n      <i>BBC iPlayer</i>\n      <i>.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cvgvd15x8d7o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "starmer-orders-investigation-into-mi5-after-bbc-exposed-false-evidence",
    "title": "Starmer orders investigation into MI5 after BBC exposed false evidence in spy case",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "The prime minister has ordered a new investigation into how MI5 gave false evidence to three courts about conversations with the BBC.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/9b10/live/c2545e70-92f4-11f0-84c8-99de564f0440.png",
    "source": "https://www.bbc.com/news/articles/cn834zwe83lo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>PM orders investigation into MI5 over false evidence</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9b10/live/c2545e70-92f4-11f0-84c8-99de564f0440.png.webp\" alt=\"BBC Silhouette of a woman looking over the London skyline \"/>\n    <p>The prime minister has ordered a new investigation into how MI5 gave false evidence to three courts about conversations with the BBC.</p>\n    <p>Sir Keir Starmer's direction follows requests from the High Court and Investigatory Powers Tribunal (IPT), which both rejected MI5's explanations about what happened.</p>\n    <p>The case centres on a neo-Nazi state informant known as Agent X who used his MI5 role to coerce his girlfriend, whom he attacked with a machete.</p>\n    <p>On Tuesday, the prime minister wrote to the Investigatory Powers Commissioner Sir Brian Leveson directing him to conduct a new inquiry.</p>\n    <p>In a <a href=\"https://questions-statements.parliament.uk/written-statements/detail/2025-09-16/hcws928\">written statement</a> to Parliament, Sir Keir said: \"I have now issued a direction to the Commissioner to commence this investigation immediately.\" </p>\n    <p>He said the courts \"will use the outcome of this investigation to determine their next steps in relation to the case of Agent X\".</p>\n    <p>Sir Keir noted that the relevant courts had found that MI5's investigations into the false evidence \"suffered from serious procedural deficiencies\".</p>\n    <p>In a letter to Sir Brian, the prime minister said the courts had \"rightly expressed their displeasure at MI5 for providing this false evidence\".</p>\n    <p>The investigation will be led by the Deputy Investigatory Powers Commissioner, Sir John Goldring, who will be supported by a \"small investigation team\". Sir John oversaw the Hillsborough inquests a decade ago.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/af4f/live/87af82a0-92f3-11f0-b391-6936825093bd.jpg.webp\" alt=\"A close-up shot of a man holding a large machete. His face is blurred and he is wearing a black t-shirt.\"/>\n    <p>In February, the BBC revealed that <a href=\"https://www.bbc.co.uk/news/articles/cew5rwpw579o\">MI5 had lied to three courts while defending its handling of the misogynistic MI5 agent</a>, whom the BBC had sought to expose in a 2022 investigation.</p>\n    <p>Arguing for secrecy, the Security Service told judges it had stuck to its policy of not confirming or denying informants' identities.</p>\n    <p>In fact, MI5 had disclosed the Agent X's status in phone calls to me, as it tried to persuade me not to investigate him. The service aggressively maintained its position until I produced evidence proving it was untrue, including a recording of one of the calls.</p>\n    <p>Following the BBC's revelations, MI5's Director General Sir Ken McCallum apologised. Two official inquiries then took place which absolved MI5 and its officers of deliberate wrongdoing, claiming the false evidence was down to mistakes and poor memories.</p>\n    <p>But, in July, a <a href=\"https://www.bbc.co.uk/news/articles/c8d6e4d8v8mo\">panel of senior high court judges ruled</a> that the \"investigations carried out by MI5 to date suffer from serious procedural deficiencies\" and that \"we cannot rely on their conclusions\". </p>\n    <p>They said it would be \"premature\" to decide whether to begin contempt of court proceedings against any MI5 officers before a new investigation took place.</p>\n    <p>Later the same month, the IPT also rejected MI5's explanations and requested a new investigation.</p>\n    <p>The tribunal also said its concerns were not confined only to the possibility of contempt of court but to wider questions of whether the duty of candour was fully complied with by MI5 and the government, and whether it is possible to identify individuals who were responsible for that failure, potentially including government lawyers.</p>\n    <p>The duty of candour requires public bodies to be open and honest in disclosing relevant information in legal proceedings.</p>\n    <p>In a statement today, Sir Brian Leveson said: \"I have received Sir Ken McCallum's assurance that the inspection team will have access to legally privileged material where this is required.\"</p>\n    <p>The new investigation's terms of reference say it should consider the circumstances resulting in the \"provision of false evidence to both the High Court and to the Investigatory Powers Tribunal, including the degree of compliance with the duty of candour, in proceedings connected with Agent X.\"</p>\n    <p>A Home Office spokesperson said: \"The Home Secretary is concerned that inaccurate evidence was provided to the High Court and Investigatory Powers Tribunal. The Director General of MI5 has rightly apologised for this serious failing, both publicly and to the Courts.\"</p>\n    <p>Kate Ellis, the joint head of the Centre for Women's Justice who acts for Agent X's former girlfriend, said she welcomed the prime minister's decision on further investigation.</p>\n    <p>\"The reliance on false evidence in court is, self-evidently, profoundly serious and raises concerns that there may have been a deliberate contempt of court,\" she added.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cn834zwe83lo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "king-at-duchess-of-kent-s-funeral-but-ill-queen-did-not-attend",
    "title": "King at Duchess of Kent's funeral but ill Queen did not attend",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "King Charles and other senior royals have gathered with friends and family to remember Katharine, the Duchess of Kent, whose funeral was held at Westminster Cathedral.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/98d0/live/569ad150-930d-11f0-a647-dff301f4a439.jpg",
    "source": "https://www.bbc.com/news/articles/cpq5eynnn8ro?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>King at Duchess of Kent's funeral but ill Queen did not attend</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/98d0/live/569ad150-930d-11f0-a647-dff301f4a439.jpg.webp\" alt=\"PA Media King Charles, Prince William and Catherine in dark clothes at the funeral of the Duchess of Kent\"/>\n    <p>King Charles and other senior royals have gathered with friends and family to remember Katharine, the Duchess of Kent, whose funeral was held at Westminster Cathedral.</p>\n    <p>But Queen Camilla sent her \"deep regrets\" at having to miss the service because she was recovering from acute sinusitis.</p>\n    <p>The Prince and Princess of Wales, among many who have paid warm tributes to the widely-respected, music-loving duchess, joined mourners at the Requiem Mass, alongside the Duke of Kent and his three children.</p>\n    <p>This is the first Catholic funeral for a member of the Royal Family in modern times - and a message from Pope Leo was read out during the service.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8c78/live/9c64d6b0-9301-11f0-a647-dff301f4a439.jpg.webp\" alt=\"PA Media The Duke of Kent at the funeral of his wife Katharine. He walks aided by a stick and is wearing a black morning suit. He is accompanied by his children and grandchildren. \"/>\n    <p>The Pope's message praised the duchess for her \"dedication to official duties, patronage of charities and devoted care for vulnerable people\" and sent his \"heartfelt condolences, together with the assurance of my prayerful closeness\" to the King, the Duke of Kent and their family.</p>\n    <p>Queen Camilla's absence because of ill health was announced by the palace ahead of the funeral.</p>\n    <p>\"Her thoughts and prayers will be with the Duke of Kent and all the family,\" said a statement from Buckingham Palace.</p>\n    <p>But the palace said that despite this painful inflammation of the sinuses, the Queen still plans to take part in the state visit of President Trump, who will be in Windsor on Wednesday.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/577c/live/5ff61380-9304-11f0-a647-dff301f4a439.jpg.webp\" alt=\"PA Media Coffin of the duchess of Kent at Westminster Cathedral\"/>\n    <p>Crowds gathered outside the Byzantine-style church in Westminster on Tuesday afternoon as the family and friends of the duchess arrived for the funeral, which was a private service.</p>\n    <p>Princess Anne and her husband Sir Tim Laurence and Prince Andrew with his former wife Sarah Ferguson were among the royals attending. Sophie, Duchess of Edinburgh was at the funeral, but her husband Prince Edward was on an overseas visit.</p>\n    <p>There were also famous faces such as actresses Maureen Lipman and Rula Lenska and champion racing driver Sir Jackie Stewart.</p>\n    <p>Readings at the service were given by the children and grandchildren of the duchess.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6989/live/af6f73e0-9302-11f0-84c8-99de564f0440.jpg.webp\" alt=\"PA Media Sarah Ferguson and Prince Andrew, both dressed in black\"/>\n    <p>The coffin of the duchess had rested in front of the cathedral's altar during the Requiem Mass, draped in the royal standard and with white roses among the flowers, in honour of the duchess' Yorkshire roots.</p>\n    <p>The duchess was the oldest member of the Royal Family when she died earlier this month at the age of 92. She was married to the first cousin of the late Queen Elizabeth II.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5820/live/97153f40-92ea-11f0-9ef6-83faefc563e4.jpg.webp\" alt=\"PA Media Duchess of Kent photo\"/>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/23bb/live/cb455c60-9307-11f0-a647-dff301f4a439.jpg.webp\" alt=\"Reuters Mourners at the funeral of the Duchess of Kent in Westminster Cathedral\"/>\n    <p>There have been many memories of her kindness and her dedication to charities.</p>\n    <p>Cardinal Vincent Nichols, who presided over the funeral service, has spoken of how the duchess often volunteered at the Passage charity for the homeless, which is based next door to the cathedral.</p>\n    <p>Speaking ahead of the funeral, he remembered her as a \"very down to earth person\" who had helped in the kitchen and with cleaning at the charity.</p>\n    <p>\"So as well as combining royal duties, she entered very wholeheartedly into serving people,\" Cardinal Nichols told the BBC.</p>\n    <p>This is a historic moment in terms of being a royal Catholic funeral, but the Cardinal said it should be seen primarily as a \"family funeral where the members of the family gather round\".</p>\n    <p>\"One of their oldest members has died. A woman who was greatly loved within that family and also, as we've seen, by much of the public,\" said Cardinal Nichols.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/253b/live/0b0b50f0-92f1-11f0-ad9f-17dac350ed4d.jpg.webp\" alt=\"PA Media Queen Camilla in a picture from September 2025 in Scotland\"/>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/fc9e/live/747600b0-9307-11f0-a647-dff301f4a439.jpg.webp\" alt=\"PA Media Rula Lenska and Maureen Lipman at the funeral of the Duchess of Kent\"/>\n    <p>The duchess had a deep love of music and had worked as a primary school music teacher, calling herself Mrs Kent, with the pupils not knowing anything about her royal life.</p>\n    <p>Music at the funeral included Ave Verum Corpus by Mozart, which was selected by the duchess as her favourite piece when she was a guest on the BBC's Desert Island Discs in 1990.</p>\n    <p>A piper also played the lament Sleep, Dearie, Sleep, which was played at the funeral of the late Queen, three years ago this week.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1ed0/live/3c515b90-9310-11f0-87f0-b54fda7d0376.jpg.webp\" alt=\"PA Media Duchess of Kent's coffin being taken from Westminster Cathedral\"/>\n    <p>There was music by JS Bach and from the requiem by French composer Maurice Durufle.</p>\n    <p>The duchess has been remembered as a familiar figure at the Wimbledon tennis championships, where she handed over trophies - and consoled those who had lost, including a tearful Jana Novotna in 1993.</p>\n    <p>After the funeral at Westminster Cathedral, the coffin was taken to the royal burial ground in Frogmore, on the Windsor estate.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/cab6/live/0e4a17d0-8a57-11f0-84c8-99de564f0440.png.webp\" alt=\"Family tree of King George V, showing his children and grandchildren. His children are Edward VIII, George VI (father of Elizabeth II and Princess Margaret), Princess Mary (mother of George and Gerald Lascelles), Henry, Duke of Gloucester (father of Prince William of Gloucester and Richard, Duke of Gloucester), George, Duke of Kent (father of Edward, Duke of Kent, Princess Alexandra of Kent and Prince Michael of Kent) and Prince John. Edward, Duke of Kent is shown married to Katharine, Duchess of Kent. The graphic includes small headshots of all the family members shown.\"/>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ef34/live/a99f61b0-109d-11f0-b234-07dc7691c360.png.webp\" alt=\"Thin, purple banner promoting the Royal Watch newsletter with text saying, “Insider stories and expert analysis in your inbox every week”. There is also a graphic of a fleur-de-lis in white. \"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/zkp3wsg\">Sign up here to get the latest royal stories and analysis</a> every week with our Royal Watch newsletter. Those outside the UK can <a href=\"https://cloud.email.bbc.com/RoyalWatch_Newsletter_SignUp\">sign up here</a>.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cpq5eynnn8ro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "judge-dismisses-terrorism-charges-against-luigi-mangione",
    "title": "Judge dismisses terrorism charges against Luigi Mangione",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-16",
    "excerpt": "A judge in New York state has dismissed two terrorism charges against Luigi Mangione, the alleged killer of UnitedHealthcare CEO Brian Thompson.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/a978/live/5eeb3990-930c-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cj4y2p8qq5qo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Judge dismisses terrorism charges against Luigi Mangione</h1>\n    <p>A judge in New York state has dismissed two terrorism charges against Luigi Mangione, the alleged killer of UnitedHealthcare CEO Brian Thompson.</p>\n    <p>However, Judge Gregory Carro during a hearing on Tuesday morning ruled a charge of second-degree murder against Mangione could stand.</p>\n    <p>He said prosecutors had failed to establish that there was enough evidence to justify the terrorism-related murder charges that they sought against Mangione.</p>\n    <p>Mangione is accused of gunning down Thompson on a busy Manhattan street in December last year.</p>\n    <p>In a written ruling, Carro said that the allegations against Mangione did not meet the definition of terrorism under state law.</p>\n    <p>Although prosecutors argued that writings left by Mangione demonstrated a terrorism motive, the judge said they failed to show that the suspect intended to put political pressure on the government or terrorise the general population - key provisions of New York's terrorism law, passed in the wake of the 11 September 2001 attacks.</p>\n    <p>\"There was no evidence presented that the defendant made any demands of government or sought any particular governmental policy change, let alone that he did so by intimidation or coercion,\" Carro wrote in his ruling.</p>\n    <p>The first-degree murder charge that was dismissed would have carried a maximum sentence of life in prison without the possibility of parole.</p>\n    <p>If convicted of the remaining second-degree murder charge, Mangione faces a minimum sentence of 15 to 25 years in prison. He has also been charged with weapons and forgery crimes.</p>\n    <p>And in addition to the New York state criminal proceedings, Mangione also faces federal murder charges, which could lead to the death penalty.</p>\n    <p>Carro rejected the defence team's request to delay the state trial until the conclusion of Mangione's federal trial.</p>\n    <p>During the hearing on Tuesday the judge ruled that trial hearings would begin on 1 December.</p>\n    <p>Mangione has pleaded not guilty to the charges against him.</p>\n    <p>Thompson, a father of two, was the chief executive of the insurance division of UnitedHealth Group - the largest health insurer in the US.</p>\n    <p>He was in New York City for a meeting when he was shot three times on a busy Manhattan street at around 6:45 a.m. on 4 December.</p>\n    <p>After a five-day manhunt, Mangione was arrested about 300 miles (480km) away, at a McDonald's restaurant in Altoona, Pennsylvania.</p>\n    <p>Police said he left a note criticising companies profiting from the US healthcare system, accusing them of \"corruption and greed\".</p>\n    <p>Outside the Manhattan Supreme Court on Tuesday a handful of Mangione's supporters gathered, some of them holding placards with slogans such as \"Free Luigi\" and \"Innocent until proven guilty\".</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cj4y2p8qq5qo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "inquiries-dropped-into-ex-mp-accused-of-misusing-donors-money",
    "title": "Inquiries dropped into ex-MP accused of misusing donors' money",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "A police investigation into claims former Conservative MP Mark Menzies misused donors' money to pay \"bad people\" has been dropped after he agreed to repay the money.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/ad19/live/90370710-925b-11f0-b9c5-fd64e0842f34.jpg",
    "source": "https://www.bbc.com/news/articles/c3vz5pgegr2o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Inquiries dropped into ex-MP accused of misusing donors' money</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ad19/live/90370710-925b-11f0-b9c5-fd64e0842f34.jpg.webp\" alt=\"BBC Mark Menzies is interviewed by the BBC's Sunday Politics North West programme in 2018. He is wearing a blue tie and black suit and sits on a red sofa in front of a blue backdrop.\"/>\n    <p>A police investigation into claims former Conservative MP Mark Menzies misused donors' money to pay \"bad people\" has been dropped after he agreed to repay the money.</p>\n    <p>Police opened an investigation into Menzies last year after accusations the then-MP for Fylde had used campaign funds for personal expenses.</p>\n    <p>BBC News understands that at least some of that money was used to pay sex workers.</p>\n    <p>It was reported by <a href=\"https://www.thetimes.com/uk/article/tory-mp-mark-menzies-under-investigation-campaign-funds-bhksggpwl\">The Times newspaper</a> that Menzies had telephoned an elderly Conservative party volunteer at 3am in December 2023, to say he had been locked in a flat by \"bad people\" and needed thousands of pounds immediately.</p>\n    <p>He made other calls that morning and eventually borrowed a total of around £8,500 from his office manager and another aide.</p>\n    <p>The majority of that - some £6,500 - was repaid from a bank account set up for money raised from local political supporters.</p>\n    <p>Questions were also raised about a further £14,000 in donor funds which Menzies had used for what he described as medical expenses, according to a party volunteer who was a signatory on the bank account.</p>\n    <p>Menzies, who did not respond to a request for comment, stood down at the last general election but has continued to face two investigations from the police and expenses watchdog into his conduct.</p>\n    <p>Both have now concluded they will not take action against him.</p>\n    <p>The police investigation followed Labour demanding a probe into potential fraud and misconduct in public office offences and officers spent months interviewing several people with knowledge of Menzies's spending.</p>\n    <p>A spokesman for Lancashire police said that a \"full and thorough investigation\" had found \"no evidence that any criminal offences have taken place\".</p>\n    <p>Two people interviewed as part of the police investigation said they had been told by officers that it was dropped in part because Menzies had agreed to repay borrowed money.</p>\n    <p>It is not clear how much he has agreed to pay, but he repaid £1,000 into the bank account containing donors' money in June.</p>\n    <p>Katie Fieldhouse, the life-long Conservative supporter who had received the late night phone call from Menzies, said she was recently contacted by Lancashire police with an update.</p>\n    <p>\"The police rang me. They told me there's insufficient evidence to prosecute and he's agreed to pay it back,\" she said.</p>\n    <p>Another source involved with the business account said they also understood the ex-MP's agreement to repay funds to be part of the reason the police had closed the investigation.</p>\n    <p>Menzies is not thought to have found employment since he stood down as an MP but the Conservative party confirmed they had given him a hardship loan which is understood to be a five-figure sum.</p>\n    <p>He was first elected in 2010. He resigned as a ministerial aide in 2014, after being accused of paying for sex from a male sex worker, allegations which he denied at the time.</p>\n    <p>Menzies's political career ended in April last year after a newspaper report revealed that he had been accused of misusing campaign funds given by local donors in his constituency.</p>\n    <p>The money had been paid to a \"business group\", with a bank account set up and administered by Ms Fieldhouse and another local Conservative volunteer.</p>\n    <p>In December 2023, he called Ms Fieldhouse at 3am, waking her from her sleep and asking her to send him thousands of pounds of the donated money.</p>\n    <p>He claimed it was \"a matter of life and death\", she has said, with men holding him in a London flat and refusing to release him unless he paid up.</p>\n    <p>The former MP subsequently denied the men in the flat he labelled \"bad people\" were sex workers.</p>\n    <p>A source close to him instead told The Times that he'd met a man on an online dating website, subsequently gone to the flat of a second man,<strong> </strong>and then been falsely accused of being sick before facing demands for a large sum to pay for cleaning.</p>\n    <p>However, one of the men present at the flat has admitted they had agreed to have sex with Menzies for payment.</p>\n    <p>The man, who is Brazilian, advertises himself as a \"high-class male escort\" and said he had participated in a \"party\" with Menzies and several other escorts.</p>\n    <p>The gathering lasted from Wednesday night to Friday morning, with Menzies absent from a full day of parliamentary work.</p>\n    <p>At its conclusion, Menzies didn't have sufficient funds to pay his bill, which amounted to more than £14,000, according to an account he later gave a close aide.</p>\n    <p>The Brazilian man denied that Menzies had ever been locked in but said there were \"lots of other guys\" and the then-MP \"hadn't paid anyone\".</p>\n    <p>He said he was not aware that Menzies was a politician and when informed of this added that he was \"surprised [b]ut that's his problem, I have nothing to do with it\".</p>\n    <p>\"My contact with him was just for work and ended there,\" he said.</p>\n    <p>As well as telephoning Ms Fieldhouse to demand money from the campaign funds account, Menzies summoned a male aide in his 30s to travel from Manchester to London to meet him at the flat where the \"party\" had taken place.</p>\n    <p>The aide said he was also asked for money, and he and a family member ended up handing over around £1,500.</p>\n    <p>Menzies received a further £6,500 from his office manager. She was subsequently reimbursed from the campaign fund.</p>\n    <p>After meeting the MP at the flat, the male aide said he accompanied Menzies and two sex workers to a nearby bank, waiting in a neighbouring cafe while the politician withdrew cash.</p>\n    <p>Menzies's alleged efforts to repay the male aide led to an investigation by Ipsa, the expenses watchdog.</p>\n    <p>The aide said that Menzies's office manager gave him £1,000 from the money she had been reimbursed from the local business group's account, but he was still owed £500 which the MP told him he couldn't afford to pay.</p>\n    <p>He alleged that Menzies instead told him he would arrange for a bonus payment to be made through his parliamentary staffing budget.</p>\n    <p>Ipsa, which investigated this claim as an allegation of fraud, found that Menzies had signed off a bonus payment for the aide \"a few days after the incident in question\". This was the only time the aide received a bonus and was described as being for work he had done on a wind farm application.</p>\n    <p>The bonus was for £700, amounting to around £500 after tax.</p>\n    <p><a href=\"https://assets.ctfassets.net/w59ykwiqehvh/3YnHUeKx52oK5dWRUMHMqO/e318efae337c17e4a3abb339f7a10826/Closure_report_MM.pdf\">In a report on its investigation published on Tuesday</a>, Ipsa's compliance officer said that he had found the case \"not proven\".</p>\n    <p>He wrote that there was \"evidence of wrongdoing\", including the timing of the payment, but stated that the aide was \"non-committal\" in his statement to the police on whether it was for wind farm work or to reimburse him, and that there was a discrepancy over the amount because he'd claimed to be owed £1,000.</p>\n    <p>Another of Menzies's former staffers also told Ipsa the payment was legitimately for the aide's wind farm work.</p>\n    <p>The aide told the BBC that he had done work on a wind farm, but that was just the excuse Menzies used for the bonus which he told him was actually to reimburse him for the money he had lent him to pay sex workers.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6133/live/2bce6ee0-0b00-11f0-97d3-37df2b293ed1.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox every day”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c3vz5pgegr2o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "mandelson-red-flags-were-missed-or-ignored-senior-labour-mp-says",
    "title": "Mandelson red flags were missed or ignored, senior Labour MP says",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "A senior Labour MP has said \"red flags were missed or ignored\" before Peter Mandelson's appointment as the UK's ambassador to the US, in an emergency debate about his sacking.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/4e22/live/6f455330-9301-11f0-a647-dff301f4a439.jpg",
    "source": "https://www.bbc.com/news/articles/c147k2zpg68o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Mandelson red flags were missed or ignored, senior Labour MP says</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4e22/live/6f455330-9301-11f0-a647-dff301f4a439.jpg.webp\" alt=\"PA Media Lord Peter Mandelson speaking at the British Embassy in Washington DC.\"/>\n    <p>A senior Labour MP has said \"red flags were missed or ignored\" before Peter Mandelson's appointment as the UK's ambassador to the US, in an emergency debate about his sacking.</p>\n    <p>Dame Emily Thornberry, chairwoman of the Foreign Affairs Committee, said \"something went very wrong\" given Lord Mandelson's known links to convicted sex offender Jeffery Epstein.</p>\n    <p>Lord Mandelson was sacked last week after the publication of emails that showed the Labour peer had sent supportive messages to Epstein as he faced jail in 2008.</p>\n    <p>In the debate, the appointment was widely criticised by MPs, including Conservative leader Kemi Badenoch, who accused Prime Minister Sir Keir Starmer of \"hiding from questions\".</p>\n    <p>Badenoch said the prime minister had \"shrivelled\" from leadership and called on him to apologise to Epstein's victims.</p>\n    <p>On Monday, Sir Keir said he would \"never\" have appointed Lord Mandelson if he had known the full details of his relationship with Epstein.</p>\n    <p>The prime minister sacked Lord Mandelson after reviewing a cache of emails between the Labour peer and Epstein.</p>\n    <p>The emails were published by Bloomberg after Sir Kier had expressed confidence in Lord Mandelson in Parliament, and the prime minister has insisted he did not know what was in the messages at that point.</p>\n    <p>An emergency debate was requested by the Conservative MP David Davis, who said the prime minister's standing had been \"diminished\" by the appointment of Lord Mandelson.</p>\n    <p>Dame Emily, who spoke in the debate, said she had asked the government questions about the vetting of Lord Mandelson and had received responses from Foreign Secretary Yvette Cooper.</p>\n    <p>In a letter, Cooper suggested her department was not responsible for any failure to recognise risks in the appointment of Lord Mandelson.</p>\n    <p>She said no concerns about Lord Mandelson were raised with the Foreign Office after a due diligence process was conducted by the Cabinet Office.</p>\n    <p>The Foreign Office, she said, was not asked to contribute to that process.</p>\n    <p>Her comments throw the spotlight on the Cabinet Office and Sir Keir for their role in deciding whether Lord Mandelson was a suitable candidate.</p>\n    <p>\"Clearly we all think [the appointment] was a mistake,\" Dame Emily told MPs.</p>\n    <p>\"The question is, how did that mistake occur? And how do we make sure this sort of thing does not happen again because something went very wrong.</p>\n    <p>\"When Lord Mandelson was appointed, red flags were obviously missed or ignored.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/07ce/live/beda8e10-9301-11f0-a647-dff301f4a439.png.webp\" alt=\"Emily Thornberry, chairwoman of the Foreign Affairs Committee\"/>\n    <p>Dame Emily was one of the few Labour MPs who spoke in the debate, with the majority of voices coming from the opposition benches.</p>\n    <p>Outside of Parliament, some Labour MPs have been <a href=\"https://www.bbc.co.uk/news/articles/cx238pwwqg6o\">privately and publicly critical</a> with a few questioning if Sir Keir can stay on as prime minister. </p>\n    <p>During the debate, several Conservatives criticised Sir Keir for failing to attend and sending Foreign Office minister Stephen Doughty in his place.</p>\n    <p>Liberal Democrat Leader Sir Ed Davey said the prime minister should apologise to victims of Jeffrey Epstein.</p>\n    <p>\"How must it have felt for the victims to see another of Epstein's closest friends made British ambassador to the United States,\" he said.</p>\n    <p>\"How must it have felt for them to hear ministers say, even after Mandelson was sacked, that his appointment was a risk worth taking?\"</p>\n    <p>Stephen Flynn, the SNP leader in Westminster, said: \"I do not know what it is about the decades of scandals and being best friends with a notorious child trafficker and paedophile, which should have got some alarm bells ringing in No 10 before this decision was taken.\"</p>\n    <p>Asked if the government would apologise to victims, Doughty said he had made \"very clear our position on Epstein's victims and our horror at the revelations\".</p>\n    <p>He said the prime minister had acted \"decisively\" in response to new information about Lord Mandelson's friendship with Epstein.</p>\n    <p>Last week, Lord Mandelson said he \"very deeply\" regretted his friendship with Epstein, which he said he continued \"for far longer than I should have done\".</p>\n    <p>He said he never saw wrongdoing while with Epstein and he \"never sought, nor did [Epstein] offer introductions to women in the way that he did to others, perhaps it is because I am a gay man\".</p>\n    <p>The debate comes ahead of a state visit to the UK by US President Donald Trump, who is expected to arrive in the country on Tuesday evening.</p>\n    <p>During the visit, the prime minister could face questions about Mandelson while standing alongside Trump, who himself <a href=\"https://www.bbc.co.uk/news/articles/cp8j3e5g74no\">had links to Epstein.</a> </p>\n    <p>Trump and Epstein were friends but the president has said the pair fell out in the early 2000s.</p>\n    <p>Epstein was first criminally indicted in 2006 in Florida and pleaded guilty in 2008 to prostitution charges involving a minor.</p>\n    <p>He died in prison in 2019 while awaiting trial on sex trafficking charges.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c147k2zpg68o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "thousands-of-opioid-deaths-missed-off-official-figures",
    "title": "Thousands of opioid deaths missed off official figures",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "More than 13,000 heroin and opioid deaths have been missed off official statistics in England and Wales, raising concerns about the impact on the government's approach to tackling addiction.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/6615/live/8f926d00-9237-11f0-a06c-f10cee3fef66.jpg",
    "source": "https://www.bbc.com/news/articles/cg7dzmyjrjzo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Thousands of opioid deaths missed off official figures</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6615/live/8f926d00-9237-11f0-a06c-f10cee3fef66.jpg.webp\" alt=\"Family handout Hilary hugs her son Ben. They are both smiling.\"/>\n    <p>More than 13,000 heroin and opioid deaths have been missed off official statistics in England and Wales, raising concerns about the impact on<strong> </strong>the government's approach to tackling addiction.</p>\n    <p>Research from King's College London, shared exclusively with BBC News, found that there were 39,232 opioid-related deaths between 2011 and 2022, more than 50% higher than previously known.</p>\n    <p>The error has been blamed on the government's official statistics body not having access to correct data and it is understood ministers are now working with coroners to improve the reporting of deaths.</p>\n    <p>A former senior civil servant said fewer people might have died if drug policies had been based on accurate statistics.</p>\n    <p>The number of opioid deaths per million people in England and Wales has almost doubled since 2012, but this new study means the scale of the problem is likely to be even greater.</p>\n    <p>Researchers from the National Programme on Substance Use Mortality at King's used data from coroners' reports to calculate a more accurate estimate of opioid-related deaths.</p>\n    <p>Opioids include drugs such as heroin that come from the opium poppy plant, as well as synthetically-made substances like fentanyl.</p>\n    <p>The Liberal Democrats have said the government needs to \"urgently investigate\" how the error was made.</p>\n    <p>The reliability of the Office for National Statistics (ONS) data relies on coroners naming specific substances on death certificates, something which often does not happen.</p>\n    <p>Specific substances such as heroin are instead sometimes only included on more detailed post-mortem reports or toxicology results, which the ONS does not have access to.</p>\n    <p>Government data on overall drug deaths, which does not name specific substances, is not affected by the error, but ministers' decision-making is generally influenced by the more granular statistics.</p>\n    <p>The body that oversees police commissioners says correct data on opioid deaths could have led to more funding and better treatment for front-line services such as police forces and public health.</p>\n    <p>Sir Philip Rutnam, who was the most senior civil servant at the Home Office between 2017 and 2020, told the BBC it was \"quite possible\" that fewer people would have died, if the government's drug policies had been based on accurate statistics.</p>\n    <p>He told BBC Radio 4's PM programme: \"It really does matter, first of all the level of attention given to these issues, but then specifically it will affect decisions on how much funding to put into health-related programmes, treatment programmes, or into different bits of the criminal justice system.\"</p>\n    <p>Ben was 27 when he died from a heroin overdose in 2018, but his death was ruled as \"misadventure\" and was never included on the official opioid death statistics.</p>\n    <p>His addiction began with cannabis when he was a teenager and progressed to using aerosols and eventually heroin.</p>\n    <p>\"Ben was just a very kind person. We miss him, we all miss him every day,\" said his mother Hilary.</p>\n    <p>At one point, she said Ben appeared to \"turn a corner\".</p>\n    <p>He was awarded a place in a rehab facility, but shortly before he was set to move in, Hilary got the phone call she had always dreaded.</p>\n    <p>\"I think what happened is, he wasn't using,\" she said. \"They think probably about three months and his tolerance had gone down.\"</p>\n    <p>Ben's family believe that different treatment and support for drug addicts could have helped him.</p>\n    <p>Dr Caroline Copeland, who led the new research, said drug policies \"will not have the desired impact unless the true scale of the problem is known\".</p>\n    <p>She added: \"We need to alert coroners to the impact that not naming specific drugs as the cause of death has on the planning and funding of public health policies.\"</p>\n    <p>The research, which has been peer-reviewed and published in the International Journal of Drug Policy, focused specifically on opioid deaths, but similar undercounts are thought to exist in data about deaths from other drugs too.</p>\n    <p>Further work by King's College London has found that 2,482 cocaine-related deaths have also been missed off ONS statistics over the last 10 years.</p>\n    <p>David Sidwick, the drugs lead for the National Association of Police and Crime Commissioners, told the BBC the organisation would \"be pushing hard\" for more treatment funding, in light of the faulty statistics.</p>\n    <p>Mr Sidwick, who is also a Conservative police and crime commissioner, said more accurate data would lead to \"better decisions about the amount of funding required for treatment\" and suggested \"new treatment methods\" such as buprenorphine, a monthly injection that can help heroin users overcome addiction.</p>\n    <p>Helen Morgan, the Liberal Democrat health spokesperson, said: \"I dread to think of the lives that may have been lost due to damaging policies based on faulty stats.\"</p>\n    <p>She added: \"The government now needs to step up, launch an investigation and ensure that the ONS is given access to the data it needs so that it can never make this error again.\"</p>\n    <p>The ONS, which helped with the research, said it had warned that \"the information provided by coroners on death registrations can lack detail\" on the specific drugs involved.</p>\n    <p>A spokesperson added: \"The more detail coroners can provide about specific drugs relevant to a death will help further improve these statistics to inform the UK government's drug strategy.\"</p>\n    <p>The flaw in the ONS system is not present in Scotland, where there are no coroners and where National Records Scotland (NRS) is responsible for collating official statistics.</p>\n    <p>Unlike the ONS, the NRS does receive more detailed pathology reports, but differences in how deaths are reported across the UK make it difficult to compare.</p>\n    <p>The opioid undercounting raises further questions about the under-fire ONS, which has been accused of failing on several statistical fronts recently.</p>\n    <p>Data sets on job markets and immigration have been criticised and earlier this year <a href=\"https://www.bbc.co.uk/news/articles/ckg3zxyj5l2o\">a government review said the ONS had \"deep-seated\" issues which needed tackling</a>.</p>\n    <p>A spokesperson for the Department of Health and Social Care said: \"We continue to work with partners across health, policing and wider public services to drive down drug use, ensure more people receive timely treatment and support, and make our streets and communities safer.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6133/live/2bce6ee0-0b00-11f0-97d3-37df2b293ed1.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox every day”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cg7dzmyjrjzo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "former-tory-minister-maria-caulfield-defects-to-reform",
    "title": "Former Tory minister Maria Caulfield defects to Reform",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "Former Conservative health minister Maria Caulfield has become the latest Tory to join Nigel Farage's Reform UK Party.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/5830/live/12ad9cb0-92e1-11f0-950e-eb051178bae0.png",
    "source": "https://www.bbc.com/news/articles/c1wg3zx4r0qo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Former Tory minister Maria Caulfield defects to Reform</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5830/live/12ad9cb0-92e1-11f0-950e-eb051178bae0.png.webp\" alt=\"PA Media Headshot of Maria Caulfield. She wears a black top with a small, silver cross visibe on a necklace. She has dark blonde hair worn in a bob and has put her black-rimmed glasses up on top of her head.\"/>\n    <p>Former Conservative health minister Maria Caulfield has become the latest Tory to join Nigel Farage's Reform UK Party.</p>\n    <p>Caulfield lost her seat to the Lib Dems at last year's general election after nearly nine years as the MP for Lewes.</p>\n    <p><a href=\"https://www.gbnews.com/politics/maria-caulfield-ex-tory-defects-reform-uk-former-minister-nigel-farage\">She told GB News</a> she joined Reform a month ago because the Conservative Party had become \"less and less what I believe in\". </p>\n    <p>Reform confirmed she has joined as a member. Caulfield is the 15th former Tory MP to join the party.</p>\n    <p>The latest defection comes after Danny Kruger, who sat on Tory leader Kemi Badenoch's team as a shadow work and pensions minister, <a href=\"https://www.bbc.co.uk/news/articles/ce802dmgnyro\">became the first sitting Tory MP to defect on Monday</a>.</p>\n    <p>Caulfield told GB News: \"The [Reform] party needs a lot of experience of people who know the system and can talk about this.\"</p>\n    <p>\"If you are Conservative right-minded, then the future is Reform. The country is going to change a lot,\" she said.</p>\n    <p>\"The same people who thought that Brexit would not happen think that Reform will not happen. They are in for a shock.\"</p>\n    <p>She added: \"I am sad for the Conservative Party. I could see that I have not changed but the party has become less and less what I believe in.\"</p>\n    <p>Responding to the defection, Tory leader Kemi Badenoch told broadcasters: \"Conservatives are the only party that are talking about how we need to deliver a stronger economy, living within our means, cutting welfare spending.</p>\n    <p>\"We have got a plan to start getting growth back - Labour do not, and Reform are merely focused on Westminster bubble issues about who is in which party.</p>\n    <p>\"That's not going to make life better for all the people out there.\"</p>\n    <p>Caulfield is a Brexit supporter and <a href=\"https://www.bbc.co.uk/news/uk-politics-44785797\">quit her role as Tory vice chair</a> in protest at Theresa May's 2018 attempt at a softer withdrawal from the EU, known as the Chequers deal.</p>\n    <p>At the time, she told May her plan would not capitalise on the opportunities of Brexit.</p>\n    <p>She has previously served in a number of junior ministerial roles, including as a health minister.</p>\n    <p>Her appointment by May as minister for women in 2018 <a href=\"https://www.bbc.co.uk/news/uk-politics-42608737\">sparked a backlash from women's rights groups</a> because of her opposition to decriminalising abortion.</p>\n    <p>James MacCleary, the Liberal Democrat who won Caulfield's seat in Lewes last year, said the move showed Farage \"doesn't care about our NHS\" because \"the Conservatives left our NHS on its knees\".</p>\n    <p>He added: \"Rather than offering solutions to the problems our country faces, Reform seems to be welcoming in the people that were responsible for causing them in the first place.\"</p>\n    <p>The BBC has contacted Caulfield for comment.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6fad/live/133a6af0-dc98-11ef-bc01-8f2c83dad217.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Get the latest political analysis and big moments, delivered straight to your inbox every weekday”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c1wg3zx4r0qo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "pm-must-raise-palestinian-visa-ban-with-trump-say-lib-dems",
    "title": "PM must raise Palestinian visa ban with Trump, say Lib Dems",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "The Lib Dems are urging Sir Keir Starmer to call on Donald Trump to reverse a decision to block Palestinian officials from attending the UN General Assembly, when the US president arrives for a state visit later.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/7f79/live/e34101a0-92f0-11f0-ad9f-17dac350ed4d.jpg",
    "source": "https://www.bbc.com/news/articles/c24r9g4055zo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>PM must raise Palestinian visa ban with Trump, say Lib Dems</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7f79/live/e34101a0-92f0-11f0-ad9f-17dac350ed4d.jpg.webp\" alt=\"EPA/Shutterstock Mahmoud Abbas addresses the UN General Assembly in 2023\"/>\n    <p>The Lib Dems are urging Sir Keir Starmer to call on Donald Trump to reverse a decision to block Palestinian officials from attending the UN General Assembly, when the US president arrives for a state visit later.</p>\n    <p>The UK is next week expected to formally recognise Palestinian statehood at the UN meeting, something the US is strongly opposed to.</p>\n    <p>The White House has <a href=\"https://www.bbc.co.uk/news/articles/cjdym32z9v7o\">taken the unusual step of blocking Palestinian president Mahmoud Abbas</a> and 80 other officials from attending the UN in New York by revoking their visas.</p>\n    <p>Lib Dem leader Sir Ed Davey has called on the PM to raise the issue with Trump - and if the US president refuses to restore the visas to push for the UN meeting to be moved to Geneva.</p>\n    <p>Sir Ed, who is <a href=\"https://www.bbc.co.uk/news/articles/crlz6rp2ln8o\">boycotting the state banquet</a> being held for the US president, said: \"President Trump has made the reckless decision to block Palestinian officials from attending the UN General Assembly, meaning Palestinians are shut out of the very place meant to deliver peace.</p>\n    <p>\"Keir Starmer must raise this with Trump when he lands for the state visit this evening.</p>\n    <p>\"Donald Trump cannot be allowed to block progress towards a two-state solution.</p>\n    <p>\"Britain must show leadership and make sure Palestinians have a voice at the UN.\"</p>\n    <p>Announcing the visa ban in August, US Secretary of State Marco Rubio blamed Palestinian officials for undermining peace efforts and for seeking \"the unilateral recognition of a conjectural Palestinian state\".</p>\n    <p>The decision, welcomed by Israel, is unusual as the US is expected to facilitate travel for officials of all countries wishing to visit the UN headquarters.</p>\n    <p>Sir Keir has said the UK will formally recognise Palestinian statehood at the UN summit, which gets under way next Tuesday, <a href=\"https://www.bbc.co.uk/news/articles/cpdjvn1eeplo\">if Israel does not meet certain conditions</a>.</p>\n    <p>These include Israel agreeing to a ceasefire in Gaza and reviving the prospect of a two-state solution.</p>\n    <p>Sir Ed Davey and the Lib Dems' 72 MPs have written to Sir Keir to urge him to put pressure on Trump to reverse the Palestinian delegation's visa ban.</p>\n    <p>\"If he refuses to act,\" the letter adds, Sir Keir must call for next week's summit to be relocated to the UN's offices in Geneva, Switzerland, so the Palestinian officials can attend.</p>\n    <p>In an interview with BBC Scotland Sir Ed said Trump was \"the one person in the world\" who could pick up the phone to Israeli Prime Minister Benjamin Netanyahu and tell him to end the fighting, and speak to Gulf States in order to prompt Hamas to release hostages.</p>\n    <p>On rejecting the King's invitation to the state banquet, Sir Ed said there would not have been an opportunity for him to speak to the US president at the event - but he argued that by boycotting it he could \"put pressure on Donald Trump to do the right thing\".</p>\n    <p>The State of Palestine is currently recognised by 147 of the UN's 193 member states.</p>\n    <p>At the UN, it has the status of a \"permanent observer state\", allowing participation but no voting rights.</p>\n    <p>It comes as UK Foreign Secretary Yvette Coooper condemned Israel over the latest military offensive in Gaza.</p>\n    <p>Residents still in Gaza City were warned to leave and head south as the Israel Defence Forces (IDF) advanced.</p>\n    <p>Israel's defence minister Israel Katz said \"Gaza is burning\" after heavy strikes overnight targeted the city before the ground assault.</p>\n    <p>Yvette Cooper said on X: \"The new IDF assault on Gaza is utterly reckless and appalling.</p>\n    <p>\"It will only bring more bloodshed, kill more innocent civilians &amp; endanger the remaining hostages.</p>\n    <p>\"We need an immediate ceasefire, all hostages released, unrestricted humanitarian aid and a path to lasting peace.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c24r9g4055zo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "hillsborough-law-will-include-duty-of-candour",
    "title": "Hillsborough Law will include duty of candour",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "A long-awaited \"Hillsborough Law\" bill will force public officials to tell the truth during investigations into major disasters.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/0f26/live/255c0460-92c7-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/czrpvrrrmj2o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Hillsborough Law will include duty of candour</h1>\n    <p>A long-awaited \"Hillsborough Law\" bill will force public officials to tell the truth during investigations into major disasters.</p>\n    <p>The news has been welcomed by campaigners, who had feared the legislation was going to be watered down.</p>\n    <p>The landmark Public Office (Accountability) Bill will force public bodies to cooperate with investigations into major disasters or potentially face criminal sanctions, as well as provide legal funding to those affected by state-related disasters.</p>\n    <p>Prime Minister Sir Keir Starmer, who had <a href=\"https://www.bbc.co.uk/news/articles/c0jwzgpzzjxo\">previously pledged to bring in the law by the 36th anniversary of the 1989 disaster</a>, said he was \"humbled\" by what the families had achieved.</p>\n    <p>\"Thank you to the families and campaigners that for years and years and years never gave up on fighting for justice and truth and their determination to deliver a Hillsborough Law is why we're here today,\" he said.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9313/live/aa289260-7a51-11ef-b9fe-390153503232.jpg.webp\" alt=\"Sir Kier Starmer wearing a suit with a white shirt and red tie against a red and white background\"/>\n    <p>Sir Keir continued: \"Today is an important day having known the families for 10 years and it is humbling to see what they have achieved after an unimaginable loss.\"</p>\n    <p>He said he had wanted the bill to be introduced earlier but: \"In the end I decided it was better to get it right and I've discussed it with the families here today and I do think it is right to have got the law into place that they are welcoming of it.</p>\n    <p>\"And they know it will serve thousands upon thousands of people they will never meet, who will not have to go through what they have gone through.</p>\n    <p>\"The extra work we've done has allowed us to get it right.\"</p>\n    <p>He added: \"We are not going to allow it to be watered down – I've made that commitment to the families as soon as possible to make sure no one suffers injustice.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9644/live/5026f660-1202-11ef-8b57-15288a1c2bec.jpg.webp\" alt=\"Margaret Aspinall has long blonde hair and is wearing a pink jumper and a gold cross necklace.\"/>\n    <p>The bill will be introduced to Parliament on Tuesday to begin its journey towards becoming law.</p>\n    <p>The government has confirmed a new professional and legal \"duty of candour\" will be part of the bill, meaning public officials would have to act with honesty and integrity at all times and would face criminal sanctions if they breached it.</p>\n    <p>Margaret Aspinall, whose 18-year-old son James died at Hillsborough, said she was hopeful the new law \"will mean no-one will ever have to suffer like we did\".</p>\n    <p>The disaster, during the FA Cup semi-final between Liverpool and Nottingham Forest at the football ground in Sheffield on 15 April 1989, led to the deaths of 97 football fans.</p>\n    <p>The government said the new legislation would \"end the culture of cover-ups\" and learn lessons from wider disasters including the Grenfell Tower fire and the Post Office Horizon and infected blood scandals.</p>\n    <p>Ms Aspinall said: \"It's been a long journey to get here. I am so grateful to the prime minister for fulfilling his promise to me.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9cda/live/a6eca6a0-9327-11f0-873c-3fec77a46911.jpg.webp\" alt=\"PA Media Deputy Prime Minister David Lammy, Justice Minister Alex Davies-Jones and Attorney General Lord Richard Hermer walk down a street alongside Hillsborough campaigners and families with colourful wreaths in their hands as they approach the Hillsborough memorial at Anfield on Monday.\"/>\n    <p>Sir Keir praised Ms Aspinall's \"courage\" and \"the strength of all the Hillsborough families and survivors\" in their long campaign for justice.</p>\n    <p>He said the new legislation would change \"the balance of power in Britain\" to ensure the state could \"never hide from the people it is supposed to serve\".</p>\n    <p>\"Make no mistake, this a law for the 97, but it is also a law for the subpostmasters who suffered because of the Horizon scandal, the victims of infected blood, and those who died in the terrible Grenfell Tower fire,\" he said.</p>\n    <p>Charlotte Hennessy, whose 29-year-old father Jimmy died at Hillsborough, said the campaign for the law had been \"really tough\".</p>\n    <p>\"It has taken a lot of negotiation, blood, sweat and tears, late nights, meetings after meetings, reading a draft and saying 'no',\" she said.</p>\n    <p>\"The duty of candour was the biggest barrier we had - it's important to note current laws such as perjury only apply to criminal cases.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/826c/live/09eda190-7a52-11ef-b282-4535eb84fe4b.jpg.webp\" alt=\"Photographic montage of all 97 Liverpool fans who were fatally injured in the 15 April 1989 Hillsborough Disaster.\"/>\n    <p>Ms Hennessy said her family only became aware of exactly what happened to her father - a plasterer from Ellesmere Port, Cheshire - after the Hillsborough Independent Panel report.</p>\n    <p>\"I didn't know the truth of what happened to my dad until 25 years later. When people say 'are they still going on about it?' - I've only known the truth for 13 of the last 36 years.\"</p>\n    <p>One of the bill's architects, Elkan Abrahamson of law firm Broudie Jackson Canter, said there was still some way to go before it became law.</p>\n    <p>\"We will now scrutinise the bill as it makes its passage through parliament, so we're not quite there yet,\" he said.</p>\n    <p>\"But today is still a momentous step, owed entirely to the persistence of campaigners and their refusal to give up.</p>\n    <p>\"The Hillsborough Law will transform the face of British justice.\"</p>\n    <p>The former bishop for Liverpool, the Right Reverend Bishop James Jones KBE chaired the independent panel investigating the disaster in 2009.</p>\n    <p>\"This is an historic day both for the 97 and the nation,\" he said.</p>\n    <p>\"The voices of the families and survivors have triumphed after 36 years. I salute their dignified tenacity.</p>\n    <p>\"This ground breaking bill will make the whole country a more truthful and just nation.\"</p>\n    <p>\n      <i>Listen to the best of </i>\n      <i>BBC Radio Merseyside on Sounds</i>\n      <i> and follow BBC Merseyside on </i>\n      <i>Facebook</i>\n      <i>, </i>\n      <i>X</i>\n      <i>, and </i>\n      <i>Instagram</i>\n      <i>. You can also send story ideas via Whatsapp to 0808 100 2230.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/czrpvrrrmj2o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "mp-who-defected-to-reform-rules-out-by-election",
    "title": "MP who defected to Reform rules out by-election",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "A Tory MP who announced on Monday he was defecting to Reform has rejected calls for a by-election.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/8670/live/2e56dcd0-931b-11f0-873c-3fec77a46911.jpg",
    "source": "https://www.bbc.com/news/articles/cp8jdr6npggo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>MP who defected to Reform rules out by-election</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8670/live/2e56dcd0-931b-11f0-873c-3fec77a46911.jpg.webp\" alt=\"PA Media Danny Kruger is shaking Nigel Farage's hand in front of a blue backdrop with Reform UK written on it. They are both smiling at each other. \"/>\n    <p>A Tory MP who announced on Monday <a href=\"https://www.bbc.co.uk/news/articles/ce802dmgnyro\">he was defecting to Reform</a> has rejected calls for a by-election.</p>\n    <p>Danny Kruger was elected as Devizes MP in 2019 and the MP for East Wiltshire in 2024, with Reform coming fourth in the latter election.</p>\n    <p> An online petition calling for him to face a by-election <a href=\"https://www.bbc.co.uk/news/articles/c4gv23vnm0ro\">has gathered more than 500 signatures.</a></p>\n    <p>However, Kruger - who said he was \"honoured\" to be asked to help Reform \"prepare for government\" - has told BBC News that there will not be one.</p>\n    <p>Kruger has said that he would \"continue to be the MP that I was elected to be at the last election\" and would \"vote exactly the same way that I've voted since the Labour government came in\".</p>\n    <p>He has previously indicated there would not be a by-election in the wake of his defection and has now confirmed this when speaking to BBC Points West.</p>\n    <h2>'A populist rebellion'</h2>\n    <p>Kruger said he has concluded the Conservative party \"is not getting into a position to be able to make it into government\".</p>\n    <p>He also said he \"respects\" what Trump and JD Vance are doing in the USA.</p>\n    <p>\"I respect the populist impulse,\" Kruger said. \"I think it's right we see a populist rebellion.</p>\n    <p>\"On a personal level, I find [Trump] too confrontational and dividing.\"</p>\n    <p><a href=\"https://www.bbc.co.uk/news/articles/ce802dmgnyro\">Kruger is the second sitting MP to join Reform UK</a>, after Lee Anderson, who was previously a Tory MP, sat as an independent before joining Reform in 2024.</p>\n    <p>Reform now have five MPs in the Commons, having seen two of their MPs elected in the 2024 general election.</p>\n    <p>Former Tory MP Maria Caulfield, who lost her seat at the last election, <a href=\"https://www.bbc.co.uk/news/articles/c1wg3zx4r0qo\">announced on Tuesday</a> that she was also joining the party.</p>\n    <p>\n      <i>Follow BBC Wiltshire on </i>\n      <i>Facebook</i>\n      <i>, </i>\n      <i>X</i>\n      <i> and </i>\n      <i>Instagram</i>\n      <i>. Send your story ideas to us on email or via </i>\n      <i>WhatsApp on 0800 313 4630</i>\n      <i>.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cp8jdr6npggo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "davey-has-no-regrets-over-welsh-lib-dem-leader-rebuke",
    "title": "Davey has no regrets over Welsh Lib Dem leader rebuke",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "The leader of the Liberal Democrats says he does not regret publicly asking the party's Welsh leader to reflect on her position in light of her role in a historic church abuse case.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/b2da/live/e008c5c0-930b-11f0-a647-dff301f4a439.jpg",
    "source": "https://www.bbc.com/news/articles/c3rvpzy7gpqo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Davey has no regrets over Welsh Lib Dem leader rebuke</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b2da/live/e008c5c0-930b-11f0-a647-dff301f4a439.jpg.webp\" alt=\"Getty Images Ed Davey and Jane Dodds pictured side by side smiling with Lib Dem placards behind them\"/>\n    <p>The leader of the Liberal Democrats says he does not regret publicly asking the party's Welsh leader to reflect on her position in light of her role in a historic church abuse case.</p>\n    <p>Speaking ahead of the Liberal Democrat party conference in Bournemouth, Sir Ed Davey said it was \"good\" Jane Dodds had apologised.</p>\n    <p>Dodds, a Member of the Senedd (MS) for Mid and West Wales, previously admitted their relationship \"would take time to repair\".</p>\n    <p>A 2021 report found Dodds, who is in charge of the Welsh Lib Dems, made a \"grave error of judgement\" by not organising a meeting to discuss a particular case of abuse by a late former bishop.</p>\n    <p>Sir Ed said he had last spoken to Ms Dodds \"earlier this year\".</p>\n    <p>And when asked if she was the right person to take the Welsh Liberal Democrats into the Senedd elections in May, he appeared to avoid giving her his full backing.</p>\n    <p>\"She's going to lead us into the Senedd election, it seems\" he said.</p>\n    <p>The relationship between Sir Ed and Dodds was put in the spotlight after the 2021 report.</p>\n    <p>She apologised after the case re-emerged last November and was backed by the Welsh party, but said Sir Ed's public calls for her to consider her position had damaged their relationship.</p>\n    <p>Sir Ed said he had no regrets about how the situation was handled saying \"it's important that people are held to account from wherever they are, and she has apologised\".</p>\n    <p>Dodds is the Welsh Lib Dems' only current MS and the party won one Welsh seat at the last general election in Brecon, Radnor and Cwm Tawe.</p>\n    <p>The latest polling by the YouGov MRP model, released on Tuesday evening, suggests the Lib Dems have the support of 6% of voters and would be projected to win three seats were a Senedd election to be taking place now.</p>\n    <p>The poll, for ITV Cymru Wales and Cardiff University eight months before the actual election is due, indicates the Liberal Democrats are currently the fifth-largest party in Wales, behind Plaid Cymru (30%), Reform UK (29%), Labour (14%) and the Conservatives (11%).</p>\n    <p>Projections, by Cardiff University's Dr Jac Larner, also suggest Plaid Cymru would currently win 38 seats in an <a href=\"https://www.bbc.co.uk/news/articles/cw07kprpg74o\">expanded Senedd</a>, Reform UK 37, Labour 11, the Conservatives six and the Greens one.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6f3b/live/55c486a0-92ee-11f0-9ef6-83faefc563e4.jpg.webp\" alt=\"Ed Davey speaking in TV interview in dark suit and blue tie with yellow pattern\"/>\n    <p>Sir Ed said the party was \"on a roll in Wales\" after the last general election, adding the party was hoping for new results under the <a href=\"https://www.bbc.co.uk/news/uk-wales-politics-61393446\">new electoral system</a>. </p>\n    <p>\"We're putting our biggest campaign force we've ever done into the field, because it's a proportional election, we think we can do really well,\" he said.</p>\n    <p>He said the party would achieve this by focusing on the \"massive issue\" of social care, because Labour had failed \"dramatically\".</p>\n    <p>\"People aren't getting the care that they need, and causing a huge backlog in our hospitals. That's why the Welsh health service is performing so badly.</p>\n    <p>\"Liberal Democrats are literally the only party coming with solutions for social care in Wales.\"</p>\n    <p>He denied this year's budget, which only passed due to the Welsh Liberal Democrat leader, was a missed opportunity to get more money to tackle issues in social care.</p>\n    <p>\"We are very strong on social care, the problem is Labour isn't,\" he said.</p>\n    <p>Welsh government ministers made £100m worth of commitments to secure Dodd's abstention, including £30m for social care to tackle delayed discharges.</p>\n    <p>Elsewhere Sir Ed said boycotting the state dinner with president Donald Trump over the war in Gaza was not a missed chance to advocate for Welsh farmers and steel workers, ahead of a finalised UK-USA trade deal.</p>\n    <p>\"I've been to state banquets, they're lovely, but you never get to speak to the visiting head of state,\" he said, adding it was better to prompt a debate by not attending.</p>\n    <p>\"I'm gaining an opportunity to speak for farmers, to speak for steel workers, and to speak for our whole country, who, frankly, is fed up of Donald Trump, fed up of people like Elon Musk interfering with our democracy and undermining our economy.\"</p>\n    <h2>Analysis</h2>\n    <p>The Liberal Democrats had a record performance across the UK in the last general election, but just one of those 72 seats was in Wales.</p>\n    <p>However in the Senedd, they have often used their one seat there to play an outsized role.</p>\n    <p>But the question is whether they have used these opportunities to their full advantage when it comes to increasing their vote share and reach.</p>\n    <p>Next year, they're hoping to expand outside their mid Wales stronghold and \"paint Wales in gold\", but are fighting for attention in an increasingly crowded field.</p>\n    <p>Not only has the emergence of Reform pushed them into fifth place in many polls, but the Green Party will also be fighting for votes over similar policy areas.</p>\n    <p>With a challenging campaign ahead, some will see today's public hints of a continuing rift between the party leaders as unhelpful and unwelcome.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c3rvpzy7gpqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "state-pension-likely-to-rise-by-4-7-in-april",
    "title": "State pension likely to rise by 4.7% in April",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-16",
    "excerpt": "People drawing their new state pension from April are likely to see a rise of more than £500 a year, latest wages data suggests.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/3d70/live/eca4eba0-92c1-11f0-aabe-7b11bbfd55ab.jpg",
    "source": "https://www.bbc.com/news/articles/c62lnzdndkeo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>State pension likely to rise by 4.7% in April</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3d70/live/eca4eba0-92c1-11f0-aabe-7b11bbfd55ab.jpg.webp\" alt=\"Getty Images A man and a woman review paperwork at a kitchen table.\"/>\n    <p>People drawing their new state pension from April are likely to see a rise of more than £500 a year, latest wages data suggests.</p>\n    <p>Under the \"triple lock\" policy, the state pension goes up each year by either 2.5%, inflation, or average earnings growth - whichever is the highest figure.</p>\n    <p>The Office for National Statistics (ONS) revealed total pay including bonuses for the three months to July was 4.7%, which is likely to be the figure used for the annual increase.</p>\n    <p>Almost 13 million people receive the state pension in the UK and current projections suggest pensioners will pay income tax on it from 2027 for the first time.</p>\n    <p>The latest wage figures from the ONS likely means:</p>\n    <ul>\n      <li>The new flat-rate state pension - for those who reached state pension age after April 2016 - is expected to increase to £241.05 a week. That will take it to £12,534.60 a year, a rise of £561.60 compared with now.</li>\n      <li>The old basic state pension - for those who reached state pension age before April 2016 - is expected to go up to £184.75 a week. That will take it to £9,607 a year, a rise of £431.60 compared with now.</li>\n    </ul>\n    <p>With inflation forecast to be 4% in September, it is likely Tuesday's average earnings growth figure will be used to set the increase in the state pension<strong> </strong>for the third year in a row.</p>\n    <p>Sir Steve Webb, partner at pension consultants LCP and former pensions minister, said the standard rate of the new state pension was \"creeping ever closer to the frozen personal tax allowance\", which currently stands at £12,570 and is set to remain at the same level until 2028.</p>\n    <p>The standard personal allowance is the amount of income permitted each year without paying income tax.</p>\n    <p>Sir Steve said that someone with no other income aside from the new state pension is set to be a taxpayer come April 2027.</p>\n    <p>\"It is already the case that nearly three quarters of all pensioners pay income tax, and the ongoing freeze in tax thresholds coupled with steady rises in the pension will drag more and more into the tax net,\" he added.</p>\n    <p><a href=\"https://www.bbc.co.uk/news/articles/c9wdgk7ggezo\">Linda, a retired hairdresser from Wokingham, told the BBC</a> she was worried her state pension was being pushed towards the tax threshold.</p>\n    <p>\"They're giving it on one hand and it's taken away in the other, so that's not a load of good,\" she said.</p>\n    <p>\"If they could raise the tax threshold it would make a huge difference.\"</p>\n    <p>The pensioner said she would struggle to manage on the state pension if she lived on her own.</p>\n    <p>\"I'm lucky that my husband's got a good pension so we have a fairly reasonable lifestyle but if left alone I don't know what would happen to be honest.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ab20/live/f22a1d90-92ce-11f0-a72d-3fad567a173a.jpg.webp\" alt=\"Linda has a brown fringe and her hair is tied back behind her head. She is wearing a black t-shirt and is standng in a dance studio. In the background there is a window with curtains on the left and a white door at the back.\"/>\n    <p>According to the ONS, regular wage growth - excluding bonuses - dropped to 4.8% in the three months to July, down from 5% in the previous three months and the lowest since May 2022.</p>\n    <p>Averages earnings growth in the public sector was 5.6% over the same period, while pay increases in the private sector were 4.7%.</p>\n    <p>Liz McKeown, the ONS director of economic statistics, said salary increases remained \"strong by historic standards\" despite it edging down further in cash terms.</p>\n    <p>However, Yael Selfin, chief economist at KPMG, said earnings growth was \"likely to continue to decline over the coming year\".</p>\n    <p>\"Demand for workers has fallen sharply due to a combination of weaker economic activity and businesses facing higher labour costs. As a result, we expect wage growth to fall below 4% by the end of the year,\" she added.</p>\n    <p>Not all pensioners receive the full state pension because it depends on years of qualifying contributions through the National Insurance system.</p>\n    <p>For many retired people, the state pension is not their only source of income as they will also receive money from workplace or private pensions.</p>\n    <p>The state pension is the second-largest item in the government budget after health spending.</p>\n    <p>The Conservative-Liberal Democrat coalition designed the triple lock in 2011 to ensure the value of the state pension was not overtaken by the increase in the cost of living or the incomes of working people.</p>\n    <p>But there has been intense debate over the cost of the triple lock and whether it is justified, with Chancellor Rachel Reeves previously pledging that the Labour government would keep it in place until the end of the current parliament.</p>\n    <p>In July, the government's official forecaster said the cost of the triple lock guarantee was set to be three times higher by the end of the decade than was originally anticipated when it began.</p>\n    <p>Work and Pensions Secretary Pat McFadden said the government promised to \"honour\" the triple lock for the \"course of this parliament\".</p>\n    <p>\"It is estimated that will mean a rise in the State Pension of around £1,900 a year by the end of the parliament,\" he said.</p>\n    <p>The latest ONS data also revealed the UK unemployment rate hit at 4.7% in the three months to July, a level not seen since May 202. There was also a 10,000 drop in vacancies over the quarter to August, while the number of payrolled workers fell last month by 8,000.</p>\n    <p>Ms McKeown said the labour market was continuing \"to cool\" with firms telling the ONS there were \"fewer jobs\" available.</p>\n    <p>But the rate of decline \"appears to be slowing\", she said.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c62lnzdndkeo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-pay-growth-stays-high-but-britons-are-feeling-the-pinch",
    "title": "UK pay growth stays high – but Britons are feeling the pinch",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "Tuesday’s latest snapshot of the UK jobs market shows what is becoming a familiar pattern: a gradual slowdown in hiring, rising unemployment, yet with wage growth still uncomfortably high for policymakers.",
    "cover": "https://i.guim.co.uk/img/media/c9ae70c39db8bc84c1dddc97d559a832f43ec169/1092_0_4443_3555/master/4443.jpg?width=1600&quality=85&auto=format&fit=max&s=1600e768aac3d23671e5c43338b91e64071",
    "source": "https://www.theguardian.com/business/2025/sep/16/uk-pay-growth-unemployment-wages",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Heather Stewart Economics editor",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Tuesday’s latest snapshot of the UK jobs market shows what is becoming a familiar pattern: a gradual slowdown in hiring, rising unemployment, yet with wage growth still uncomfortably high for policymakers.</p>\n    <p>Whether because of Rachel Reeves’s <a href=\"https://www.theguardian.com/politics/2025/apr/02/reeves-defends-40bn-tax-increase-in-autumn-budget-as-businesses-prepare-for-nics-hike\">£25bn national insurance increase</a>, <a href=\"https://www.theguardian.com/business/2025/sep/15/aldis-uk-boss-warns-shoppers-face-higher-food-prices-if-budget-heaps-extra-costs-on-retailers\">uncertainty over her upcoming budget</a>, AI-related disruption or Donald Trump’s tariffs – or perhaps all four – companies seem to be cautious about taking on staff.</p>\n    <p>In the July to August period, the number of vacancies in the economy was down by 119,000 on a year earlier.</p>\n    <p>The unemployment data only runs to July – but it shows 2.3 unemployed people for each vacancy, up from 2.2 in the previous quarter.</p>\n    <p>The unemployment rate was up by 0.1 percentage points on the previous three months – at 4.7% – the highest rate in four years.</p>\n    <p>Employment was also rising, however, in part as more people move from being economically inactive, into the workforce.</p>\n    <p>At 21.1%, the economic inactivity rate was down 0.8 percentage points on a year earlier – though it remains stubbornly higher than before the pandemic.</p>\n    <p>And as Helen Gray, the chief economist at the Learning and Work Institute thinktank, said: “While economic inactivity is falling, a sizeable number of those returning to the labour market appear to be seeking work, rather than entering employment.”</p>\n    <p>Bank of England policymakers, who meet on Thursday to decide interest rates, have been waiting for this slowdown in the labour market – under way for many months now – to bring wage inflation under control.</p>\n    <p>Yet so far that has been a slow process, and wage growth remained relatively robust, at an annual rate of 4.8% excluding bonuses in the three months to July, according to the ONS.</p>\n    <p>When wages are rising strongly, economists fret that it will create the space for companies to continue raising their prices, contributing to a further round of inflation.</p>\n    <p>\n      <a href=\"#EmailSignup-skip-link-12\">skip past newsletter promotion</a>\n    </p>\n    <p>after newsletter promotion</p>\n    <p>The Bank’s governor, Andrew Bailey, has repeatedly stressed the importance of the jobs market, and specifically wages, in determining where interest rates go from their current level of 4%. The latest data makes it even less likely that the Bank’s monetary policy committee will cut rates this week.</p>\n    <p>While wage growth remains higher than the Bank believes is consistent with meeting its inflation target, however, it will not feel that way for workers.</p>\n    <p>With inflation on the rise again, pushed up by food prices and energy bills, the ONS calculates that real wages are just 1% higher than a year ago – or 0.5% once housing costs are taken into account.</p>\n    <p>That is likely to mean that many consumers continue to feel the pinch, despite Labour’s stated determination to ensure economic growth can be felt in workers’ pockets.</p>\n    <p>As Ben Harrison, the director of the Work Foundation thinktank, put it: “The combination of stagnant living standards and sticky inflation means that people are still likely to feel pessimistic about their household finances one year into the new parliament.”</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/16/uk-pay-growth-unemployment-wages\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "new-headache-for-rachel-reeves-as-obr-expected-to-lower-productivity-f",
    "title": "New headache for Rachel Reeves as OBR expected to lower productivity forecast",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "The Office for Budget Responsibility is expected to downgrade its key productivity forecast, the Guardian understands, setting Rachel Reeves on course to break her fiscal rules without significant action in the budget.",
    "cover": "https://i.guim.co.uk/img/media/60620ccdd4e10b7ce454813135b465f8431cbd42/246_0_4146_3317/master/4146.jpg?width=1600&quality=85&auto=format&fit=max&s=aa1600a31700fdbb04e7df99ecec87b9e5",
    "source": "https://www.theguardian.com/business/2025/sep/16/new-headache-for-rachel-reeves-as-obr-downgrades-key-productivity-forecast",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Heather Stewart Economics editor",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>The <a href=\"https://www.theguardian.com/business/office-for-budget-responsibility\">Office for Budget Responsibility</a> is expected to downgrade its key productivity forecast, the Guardian understands, setting Rachel Reeves on course to break her fiscal rules without significant action in the budget.</p>\n    <p>The government’s independent watchdog <a href=\"https://www.theguardian.com/business/2025/jun/15/reeves-obr-revised-forecast-tax-spending-plans-20bn-hole-autumn-budget\">has carried out a “stocktake” of its forecast models over the summer</a>, and Treasury officials privately acknowledge the result will inevitably be a weaker growth outlook.</p>\n    <p>One Treasury source said they expected the OBR to “kitchen sink it” – making a significant downward revision to productivity forecasts in one go rather than taking a more piecemeal approach.</p>\n    <p>Reeves will respond by pointing to the long-term weakness of productivity in the UK economy and promising to tackle it with a programme of investment.</p>\n    <p>The consultancy Oxford <a href=\"https://www.theguardian.com/business/economics\">Economics</a>, however, estimates that moving the OBR’s productivity forecast back in line with the less optimistic independent average projection would knock 1.4% off GDP at the end of its five-year forecast period.</p>\n    <p>That would force Reeves to increase taxes or cut spending by an eye-watering £20bn to meet her fiscal rules and maintain her slim £10bn of headroom, roughly the equivalent of <a href=\"https://ifs.org.uk/be-chancellor\">raising the main and higher rates of income tax</a> by 2p.</p>\n    <p>Treasury ministers hope to convince the OBR to “score” government policies such as planning reforms, which it hopes will boost growth, but these are likely to be more than outweighed by the productivity downgrade.</p>\n    <p>When it assesses the chancellor’s headroom against the fiscal rules, the OBR will also have to take into account the additional costs of recent political U-turns, including on the winter fuel allowance and botched welfare reforms.</p>\n    <p>The widespread expectation that Reeves will have to raise taxes, combined with a late budget date of 26 November has paved the way for weeks of fevered speculation about how extra revenue might be raised.</p>\n    <p>Reeves is understood to have expressed frustration at the publication of a paper from the Institute For Public Policy Research that called for a windfall tax on banks and <a href=\"https://www.theguardian.com/business/2025/aug/29/uk-bank-shares-tumble-after-call-for-windfall-tax-on-lenders-in-budget\">prompted a selloff of financial sector stocks</a> earlier this month.</p>\n    <p>Any plans for tax changes will have to pass <a href=\"https://www.theguardian.com/uk-news/2025/sep/10/keir-starmer-tightens-grip-on-economic-policy-by-strengthening-autumn-budget-board\">a beefed-up “budget board”,</a> whose makeup was announced last week and which is intended to avoid a repeat of the furious business backlash that followed last year’s budget.</p>\n    <p>The CBI’s chief executive, <a href=\"https://www.theguardian.com/business/2025/sep/09/cbi-boss-calls-for-rachel-reeves-to-tear-up-labours-manifesto-pledge-on-tax\">Rain Newton-Smith, urged the chancellor</a> last week to consider breaking Labour’s manifesto pledges not to increase national insurance, VAT or income tax, rather than look to businesses again to raise more revenue.</p>\n    <p>A Treasury spokesperson said: “We are not going to speculate on the OBR’s forecast. We are committed to keeping taxes for working people as low as possible, which is why at the last budget, we protected working people’s payslips and kept our promise not to raise the basic, higher or additional rates of income tax, employee national insurance or VAT.”</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/16/new-headache-for-rachel-reeves-as-obr-downgrades-key-productivity-forecast\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "our-plans-could-be-derailed-family-firms-say-labour-tax-rises-will-for",
    "title": "‘Our plans could be derailed’: family firms say Labour tax rises will force fire sales",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "Unassuming wooden crates filled with brake pads and metal springs are piled high in the loading bay of the Broadbent factory close to Huddersfield city centre. Shipping them out to Nigeria and Ghana remains the day job for Simon Broadbent, but the manufacturer’s owner has a gr…",
    "cover": "https://i.guim.co.uk/img/media/b485cd9e72b97fe67ca14457b506fb3850e310b0/944_0_7138_5711/master/7138.jpg?width=1600&quality=85&auto=format&fit=max&s=d1600a59f6641ad9c59b3843ee1a29b534",
    "source": "https://www.theguardian.com/business/2025/sep/16/family-firms-labour-tax-rises-manufacturers",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Phillip Inman",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Unassuming wooden crates filled with brake pads and metal springs are piled high in the loading bay of the Broadbent factory close to Huddersfield city centre. Shipping them out to Nigeria and Ghana remains the day job for Simon Broadbent, but the manufacturer’s owner has a growing issue nagging at him – the fate of his 160-year-old business in the face of Labour’s tax overhaul.</p>\n    <p>Broadbent has emerged as a reluctant challenger to plans by the chancellor, <a href=\"https://www.theguardian.com/politics/rachel-reeves\">Rachel Reeves</a>, to strip family firms of the ability to pass on their businesses tax free from next April. Campaigners, including the manufacturers association Make UK, say the tax overhaul threatens the backbone of the British industrial sector.</p>\n    <p>Under the current system, business property relief allows families to pass on assets free of inheritance tax (IHT). Reeves’s IHT changes – which have also <a href=\"https://www.theguardian.com/politics/2025/aug/14/national-farmers-union-uk-rachel-reeves-meeting-report-inheritance-tax-reforms\">caused shock and anger among farmers</a> – would mean children who inherit companies’ property assets, which in many cases is a factory, will need to find the money to pay IHT at 20% on assets above £1m.</p>\n    <p>Once assembled on the west African coast, Broadbent’s crafted metal parts will be attached to his centrifugal spinning machines, designed for sugar refiners to separate sugar crystals from molasses.</p>\n    <p>Simon, 72, is the great-great grandson of the company’s founder, Thomas Broadbent, and as its current chair he controls one of the few metal forming operations in the UK, bending and welding rolled steel into sophisticated machines that are exported all over the world.</p>\n    <p>He fervently makes the case for small, family-owned businesses. “For every JCB and Dyson, there are hundreds of firms just making a decent living, but not a fortune, and certainly not enough that we can hand over 20% of our perceived wealth every time one of us dies,” he says.</p>\n    <p>“We want the company to have a future, and there is no reason why it shouldn’t when we have a good product to sell. Yet we are in a situation now where, if I die on the wrong day, our plans to keep it going could all be derailed.”</p>\n    <p>Broadbent, whose company also has operations in China and Thailand, is concerned that Reeves’s plan will allow only a proportion of family assets above £1m to be passed on to the next generation tax free.</p>\n    <p>Certain Treasury allowances mean that, in some circumstances, the tax free limit increases to £3m, as it does for farming estates. But like farmers, business owners argue that the asset value of the firm is irrelevant as there is no intention to sell.</p>\n    <p>HMRC confirmed last month that the changes would go ahead as planned, after outlining how asset values would be calculated.</p>\n    <p>Reeves, who is expected to raise taxes in her 26 November budget as she faces a large spending deficit, has defended the reduction in tax relief, arguing that the Treasury is unable to afford to continue the subsidy and that only a handful of estates each year will be affected.</p>\n    <p>When the plan was announced last year, the Treasury’s independent forecaster, the Office for Budget Responsibility (OBR), tentatively estimated that the projected revenue from the changes to business property relief and the agricultural property relief affecting farmers in a similar way <a href=\"https://obr.uk/efo/economic-and-fiscal-outlook-october-2024/#:~:text=Table%203.4%3A%20Costing%20of%20changes%20to%20the%20inheritance%20tax%20regime\">would be £500m a year from 2027/28</a>.</p>\n    <p>Broadbent says factories are not like stocks and shares, “you can’t sell off part of the factory. You need all of it. Otherwise you can’t make the product”.</p>\n    <p>Given the way land values and property assets of all kinds have soared over the last 40 years, many family owners have found themselves asset rich and cash poor, putting a strain on finances. The high value of the pound, soaring energy bills, Brexit and competition from China have been enough to send many British manufacturers bust.</p>\n    <p>Now some of those that remain have run the numbers and say an extra tax bill will mean they need to starve their companies of investment, or sell up.</p>\n    <p>Family Business UK, a lobby group for family-owned firms, believes Reeves’s plans are likely to trigger a fire sale of British-owned businesses or a depressed sector, with owners forced to redirect working capital – the investment funds needed for research and development – into paying the IHT bill.</p>\n    <p>A study by CBI <a href=\"https://www.theguardian.com/business/economics\">Economics</a> found that family businesses make up more than 90% of private sector companies in the UK and provide employment for nearly 16 million people.</p>\n    <p>CBI said figures to the end of 2023 show family businesses generated £985bn, equivalent to 59% of total private sector income. More than half of respondents to its survey said they were cancelling or delaying investments while they consulted advisers about the financial implications of the IHT changes.</p>\n    <p>Josh Burbidge heads the family firm Archwood Group and the Richard Burbidge manufacturing brand, which can trace its roots to the same decade that Thomas Broadbent was inventing spinning machines to dry wool for the Yorkshire textile industry – the 1860s.</p>\n    <p>He manages the factory near Chirk in north Wales. Originally based in Coventry, the company was lured, along Cadbury’s, to set up factories in a neglected part of Wales by government subsidies that have long since run out.</p>\n    <p>These days 40% of revenues stem from making wooden stairs for new-build properties. Burbidge says the company is embedded in the local community and has overseen investments that have not only transformed the factory into an eco-haven covered in 2,600 solar panels, but has also negotiated with wood suppliers in China, Estonia and Sweden to do the same.</p>\n    <p>“The fact we are a family business means we keep the business going for the next generation. We have made it an environmental and sustainable business.</p>\n    <p>\n      <a href=\"#EmailSignup-skip-link-25\">skip past newsletter promotion</a>\n    </p>\n    <p>after newsletter promotion</p>\n    <p>“I get that the government needs tax revenues to improve public services, but I am concerned that changes to business assets relief is a backward step.</p>\n    <p>“The alternative is that firms like this are owned by private equity … focused on the money and not the people or the local community.</p>\n    <p>“Britain should follow the German model that recognises family businesses,” he says.</p>\n    <p>Germany’s Mittelstand business community is famous as the bedrock of the country’s manufacturing miracle. Family firms that have survived two world wars continue, winning praise from politicians for generating exports.</p>\n    <p>The upmarket appliance maker Miele and the power tool firm Stihl are among the top 500 family firms that generate 43% of Germany’s economic output. Giving some heft to the list are Volkswagen, Lidl and Aldi, which are also family owned.</p>\n    <p>German companies lobbied for the tax-free transfer of property assets in the early 1990s at the same time as their British counterparts. Both won after their respective governments conceded that family firms had no intention of capitalising on rising property values and simply wanted to continue running the same business.</p>\n    <p>Only when cash was extracted was there tax to pay. It meant that while company funds remained inside the business, successive generations could carry on in charge.</p>\n    <p>Peer-Robin Paulus, the head of policy at the <a href=\"https://www.familienunternehmer.eu/index.html\">Family Business Association</a> in Potsdam, says: “The key for any business is to retain enough capital to invest in IT and digital technologies to remain market leading companies. Otherwise you go bust.</p>\n    <p>“We have to accept that some people will abuse the privilege, but that is a very small risk and worth it to save a vast swathe of family businesses.”</p>\n    <p>Jonathan Roberts, the head of external affairs at the Country Land and Business Association, says the IHT changes will prove to be loss-making for the Treasury because families will freeze major investments.</p>\n    <p>“We have put forward a plan that allows the Treasury to claw back tax if families sell within seven years of inheriting. That would show ministers that families are committed to their businesses and not seeking to exploit them,” he says.</p>\n    <p>A spokesperson for the Treasury said most estates claiming tax relief will fall below the IHT threshold. The largest companies, 4% of the total, claim the biggest amount of tax relief at 53% and should pay a higher inheritance bill, it argues.</p>\n    <p>“The money raised will go towards public services we all rely on every day instead,” they said.</p>\n    <p>Broadbent’s children are not part of the business, but like many family owners, he wants the ethos and practice of hi-tech manufacturing to continue in his home town. He is on the hunt for a like-minded family steeped in the industry to buy his business.</p>\n    <p>He says Reeves’s “tax raid” has all but scuppered that project. “Maybe it was naive to think there is such a family out there, but the uncertainty created by the tax changes means my aim will be much more difficult to achieve,” he says.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/16/family-firms-labour-tax-rises-manufacturers\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "state-pension-on-course-for-inflation-busting-4-7-rise-under-triple-lo",
    "title": "State pension on course for inflation-busting 4.7% rise under triple lock; JLR production shutdown extended again – as it happened",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "State pension on course for 4.7% rise under triple lock",
    "cover": "https://i.guim.co.uk/img/media/c72a44a2c393ae4d924a868f1477d17d4af89ffb/500_0_5000_4000/master/5000.jpg?width=1600&quality=85&auto=format&fit=max&s=3936721fbc00c23fe12e0d2247855073",
    "source": "https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Graeme Wearden",
    "rights": "Unknown",
    "body": "<p>State pension on course for 4.7% rise under triple lock</p>\n<p>UK pensioners can look forward to a 4.7% increase in their state pensions next year, if the government sticks with the triple-lock.</p>\n<p>This morning’s labour market data shows that average wage growth (including bonuses) was 4.7% between May to July.</p>\n<p>That is the figure used in the triple lock formula which dictates that the state pension will increase in line with average wages, inflation or 2.5% each year, whichever is higher.</p>\n<p>Helen Morrissey, head of retirement analysis at Hargreaves Lansdown, explains:</p>\n<p>“State pensioners look on course to get an 4.7% uplift in their state pension next year as average wage growth remained robust. Such an increase would see a full new state pension rise from its current level of £230.25 per week to £241.05 per week from April. Those retiring on the basic state pension would see their weekly income increase from £176.45 per week to £184.75.</p>\n<p>However, the hike is not yet set in stone. We are awaiting the final piece of the triple lock puzzle – September’s inflation data to be published next month and if this surpasses 4.7% then we could see an even bigger increase. However, given that inflation currently sits at 3.8% it seems likely that wage growth will be the key figure here.</p>\n<p>Morrissey adds that the system creates some complexity for pensioners:</p>\n<p>Those on the new state pension will receive the uplift but those on the basic state pension will only receive it on their main state pension. Any further top ups such as the state second pension are usually uprated in line with inflation instead, so they won’t get the full benefit of the triple lock on their entire payment.</p>\n<p>Rachel Vahey, head of public policy at AJ Bell, points out that the state pensions will be close to the personal allowance of £12,570 – pensioners with additional income (such as a second pension) would then pay income tax on earnings over that limit.</p>\n<p>Vahey says:</p>\n<p>“Pensioners will be rejoicing at the prospect of an inflation-busting rise to the state pension from April next year as a result of the triple lock guarantee, with the latest ONS earnings growth figure coming in at 4.7% for the period between May and July of this year.</p>\n<p>“Under the triple lock guarantee, the state pension will rise by the highest of average earnings growth in May to July, September’s inflation figure or 2.5%. Provided inflation doesn’t spike above 4.7% in September, all stars point to these latest earnings figures boosting the new state pension to £12,534.60 from April 2026 – putting it above £12,000 for the first time ever and perilously close to the frozen personal allowance.</p>\n<p>The triple lock is a political pledge, not laid down in legislation, so pensions aren’t guaranteed to rise as outlined above. But in July, then work and pensions secretary LizKendall said the government was commited to the pensions triple lock “for the entirety of this Parliament”….</p>\n<p>Millions of people are poised for an above-inflation 4.7% increase in their state pension payments, adding to pressure on the government finances as Rachel Reeves explores raising taxes at the autumn budget.</p>\n<p>Labour has committed to retaining the triple lock on the state pension, which guarantees annual increases in line with whichever is the higher of 2.5%, inflation in September or annual earnings growth in the three months to July.</p>\n<p>Official figures published on Tuesday show average weekly earnings including bonuses were 4.7% higher in May to July than in the same period a year earlier.</p>\n<p>Experts said the increase put state pensioners in line for their payments to go up by that amount from next April because inflation in September – currently running at 3.8% – was unlikely to be higher.</p>\n<p>A final decision will be taken by the government before the budget. However, PatMcFadden, the work and pensions secretary, confirmed on Tuesday that the triple lock promise would be honoured.</p>\n<p>He said:</p>\n<p>“That’s a commitment from the Labour government to the UK’s pensioners. It’s something that we said we’d do at the election and something that we will keep to.”</p>\n<p>Jaguar Land Rover has extended its shutdown on car production, as Britain’s biggest carmaker grapples with the aftermath of a cyber-attack.</p>\n<p>JLR said it would freeze production until at least next Wednesday, 24 September, as it continues its investigations into the hack, which first emerged earlier this month.</p>\n<p>The manufacturer said:</p>\n<p>“We have taken this decision as our forensic investigation of the cyber incident continues, and as we consider the different stages of the controlled restart of our global operations, which will take time.</p>\n<p>“We are very sorry for the continued disruption this incident is causing and we will continue to update as the investigation progresses.”</p>\n<p>Looking ahead to tomorrow’s US interest rate decision, a hawkish tone from the Fed could spark a ‘sell the news’ pullback in the markets.</p>\n<p>So suggests Chris Beauchamp, chief market analyst at investment and trading platform IG:</p>\n<p>“Despite the dramatic build-up to tomorrow’s nailed-on rate cut, the dull reality is that a 25bps move is merely the expected result. What everyone is watching for is any hint of more cuts to come.</p>\n<p>“Markets have merrily priced in a progression of easing moves in October and December, but if the committee strikes a more hawkish note, then we may finally see some volatility emerge with traders ‘selling the news’. This could well lead to an early-Autumn pullback in equity markets ahead of the next Fed meeting.”</p>\n<p>Sir Jim Ratcliffe’s chemicals empire has suffered a blow from ratings agency Fitch overnight.</p>\n<p>Fitch has downgraded INEOS Group to ‘BB-’, with a negative outlook, down from BB. That’s a one-notch fall, to the 13th place on Fitch’s scale of credit worthiness, and still leaves Ineos ranked as ‘non-investment grade’.</p>\n<p>Explaining the decision, Fitch points out that Ineos is increasingly highly leveraged, due to the “weak chemical market” and high spending on a new ethane cracker in the Port of Antwerp.</p>\n<p>Fitch also predicts that Ineos’s revenue to grow by 2% on average in 2025-2029, after growing 9% in 2024.</p>\n<p>A lower credit rating implies a higher risk of default, or debt restructuring, and can result in higher borrowing costs.</p>\n<p>A dried sunflower field in the Kharkiv region of Ukraine Photograph: Julia Kochetova/The Guardian</p>\n<p>Last summer’s extremely hot weather was not great for the European and Ukrainian sunflower crop.</p>\n<p>Ukrainian and European sunflower oil prices have jumped, Bloomberg reports, as forecasters expect low yields in the country and limited production across the continent.</p>\n<p>That’s because the hot, dry summer hampered crop development.</p>\n<p>There are forecasts that Europe could see its worst sunflower harvest in a decade, while harvesting in Ukraine is slow following a drought this year.</p>\n<p>In Ukraine, sunflower yields are expected to fall below the five-year average “largely due to the drought in the south, where most sunflower cultivation takes place,” the European Union’s Monitoring Agricultural Resources unit said in a report.</p>\n<p>Europe is facing similar challenges, with top producer France expecting output to drop 15% below the five-year average, according to figures from the French agriculture ministry.</p>\n<p>Over in the US, retail sales were stronger than expected last month – which might deter the Federal Reserve from a surprisingly hefty interest rate cut tomorrow.</p>\n<p>Spending at retail and food services sites jumped by 0.6% month-on-month in August, and were 5% higher than in August 2024.</p>\n<p>Economists had expected a smaller rise, of 0.2%.</p>\n<p>It’s an encouraging sign for US economic growth, but could also encourage Fed policymakers to vote for a quarter-point cut to interest rates, rather than a larger, half-point cut.</p>\n<p>U.S. retail sales stronger than expected. Hindrance for a 50 bp cut tomorrow? #retail</p>\n<p>Spending at “nonstore retailers” (ie, internet shopping) were up 10.1% year-on-year, while spending at food service and drinking places rose 6.5% compared with a year earlier.</p>\n<p>Britain’ Competition and Markets Authority has launched a merger inquiry into payments provider Global Payments’ $24.25bn acquisition of rival Worldpay.</p>\n<p>The CMA will examine whether the deal, announed in April, could lessen competition in UK markets.</p>\n<p>The CMA has set a deadline of November 11 to reach its Phase 1 decision.</p>\n<p>It’s a year since former Italian PM Mario Draghi’s landmark report, which warned that the EU risked “agonising decline” without an €800bn investment boost.</p>\n<p>Today, Draghi has warned that Europe was “in a harder place” than one year ago, and suggested that Europe actually needs annual investments of nearly €1,200bn, up from €800bn last year, with increasing demand for defence.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-state-pension-what-is-the-triple-lock-and-could-it-be-ditched",
    "title": "UK state pension: what is the triple lock, and could it be ditched?",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "The full new state pension looks likely to increase by almost £11 to £241 a week from next April – equating to £12,534 a year – as a result of the triple lock, the latest wage growth figures suggest.",
    "cover": "https://i.guim.co.uk/img/media/14a7590495a0f0b9c1a31dcd6bd0b59bfb02511d/627_0_3395_2718/master/3395.jpg?width=1600&quality=85&auto=format&fit=max&s=27234b148bf5d7b5d55f4eb33001012c",
    "source": "https://www.theguardian.com/money/2025/sep/16/uk-state-pension-what-is-the-triple-lock-and-could-it-be-ditched",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Rupert Jones",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>The full new state pension looks likely to increase by almost £11 to £241 a week from next April – equating to £12,534 a year – as a result of the triple lock, the <a href=\"https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves\">latest wage growth figures</a> suggest.</p>\n    <p>The inflation-busting 4.7% or £560-a-year rise will need to be confirmed by the government. It is likely to reignite debate about the affordability of the triple lock, and poses questions about the standard tax-free personal allowance, which stands at £12,570.</p>\n    <h2>What is the triple lock?</h2>\n    <p>The UK state pension increases in April each year based on a system known as the triple lock.</p>\n    <p>Introduced in 2011 by the coalition government, it guarantees that the basic and new state pensions will rise by whichever of three figures is the highest:</p>\n    <ul>\n      <li>\n  <p class=\"dcr-130mj7b\">Inflation, based on the consumer price inflation (CPI) figure for September of the previous year</p></li>\n    </ul>\n    <ul>\n      <li>\n  <p class=\"dcr-130mj7b\">The average increase in wages during the May to July period of the previous year</p></li>\n    </ul>\n    <ul>\n      <li>\n  <p class=\"dcr-130mj7b\">2.5%.</p></li>\n    </ul>\n    <p>\n      <a href=\"https://interactive.guim.co.uk/uploader/embed/2025/09/pensions-triple-lock/giv-32554W27OC1D30JFH/\">graphic</a>\n    </p>\n    <h2>How many people get the state pension?</h2>\n    <p>There are almost 13.1 million state pensioners, according to Department for Work and Pensions figures issued in August.The majority, 8.4 million, are on the old basic state pension.</p>\n    <p>To get this, you need to be a man born before 6 April 1951 or a woman born before 6 April 1953.</p>\n    <p>People born after those dates claim the new state pension.</p>\n    <p>The full basic state pension is £176.45 a week, and the full new state pension £230.25.</p>\n    <p>The government says it is not possible to make direct comparisons between the two payments. Under the old system, people can receive extra money from the state based on their national insurance (NI) contributions. They could qualify for the “additional state pension” – known as the state earnings-related pension scheme (Serps), or state second pension – for the years they paid the full rate of NI. This payment could be worth in excess of £200 a week on top of the basic state pension, the government has said.</p>\n    <h2>What is the rise from next April?</h2>\n    <p>It’s not 100% confirmed, but we have a pretty good idea of what will happen.</p>\n    <p>Figures from the Office for National Statistics on Tuesday show the <a href=\"https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves\">annual growth in earnings was 4.7%</a> for May to July this year. As is often the case with official data, this figure may undergo a small revision next month.</p>\n    <p>The September inflation figure will be published next month, but it is not expected to exceed 4.7%. <a href=\"https://www.theguardian.com/business/2025/aug/20/inflation-rises-july-pause-interest-rate-cuts\">It was 3.8% in July</a> and is forecast to remain unchanged in August when those figures are released on Wednesday.</p>\n    <p>A 4.7% increase would lift the full basic state pension to £184.75 a week, or £9,607 a year. It would lift the full new state pension to £241.05 a week, or £12,534.60 a year.</p>\n    <p>The government is expected to make a final decision on the pension increase before the budget on 26 November.</p>\n    <h2>Is the triple lock popular?</h2>\n    <p>There has been a great deal of discussion about the affordability and fairness of the triple lock in recent years.</p>\n    <p>Critics say it is unfair because many older people enjoy a higher standard of living than younger people may expect to in the future, and believe it is not right to expect the younger generation to subsidise older people’s incomes to such an extent via the triple lock.</p>\n    <p>Organisations including the Institute for Fiscal Studies have argued that the triple lock is unsustainable and makes planning government finances tricky because the various components are difficult to forecast.</p>\n    <p>The Office for Budget Responsibility said in July that the triple lock had already <a href=\"https://www.theguardian.com/business/2025/jul/08/uk-public-finances-obr-national-debt-gdp\">cost about three times more than initially expected</a> and suggested it was unaffordable in the long term.</p>\n    <p>Supporters of the triple lock say it is vital for maintaining the value of the state pension, particularly for future pensioners, many of whom do not have access to the generous workplace schemes that many older people were able to join and are not saving enough for their retirement, in part because of cost of living pressures.</p>\n    <p>Surveys have shown that many current workers do not expect to have any provision beyond the state pension when they retire.</p>\n    <h2>Could the triple lock be ditched?</h2>\n    <p>The work and pensions secretary, Pat McFadden, confirmed on Tuesday that the government was committed to maintaining the triple lock for this parliament. That echoes previous pledges by other ministers.</p>\n    <p>The head of policy at the financial services consultancy Broadstone, David Brooks, said however that debate over the future of the triple lock was likely to intensify.</p>\n    <p>“Increasingly the debate appears to be framed as triple lock or nothing when it comes to increasing the state pension,” he said. “But most would consider it fair that the state pension should increase, and the government has repeatedly committed to it for the remainder of this parliament.”</p>\n    <p>He said the debate should be about whether the increase was dictated by an earnings link or an inflation link, and should be a priority.</p>\n    <p>Steve Webb, a former pensions minister and partner at the consultancy firm LCP, said the annual standard rate of the new state pension was “creeping ever closer to the frozen personal tax allowance”.</p>\n    <p>“Indeed, we know for certain that someone who has no other income aside from the new state pension will be a taxpayer come April 2027,” he said.</p>\n    <p>“It is already the case that nearly three quarters of all pensioners pay income tax, and the ongoing freeze in tax thresholds coupled with steady rises in the pension will drag more and more into the tax net.”</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/money/2025/sep/16/uk-state-pension-what-is-the-triple-lock-and-could-it-be-ditched\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "uk-state-pension-likely-to-rise-by-4-7-under-triple-lock",
    "title": "UK state pension likely to rise by 4.7% under triple lock",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "Millions of people are poised for an above-inflation 4.7% increase in their state pension payments, adding to pressure on the government finances as Rachel Reeves explores raising taxes at the autumn budget.",
    "cover": "https://i.guim.co.uk/img/media/2b07e73bc3b99a6df01428b9d1069454a94bdbbf/1040_0_5200_4160/master/5200.jpg?width=1600&quality=85&auto=format&fit=max&s=1600cae2d89858a9881515abd25847d5af",
    "source": "https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Richard Partington Senior economics correspondent",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Millions of people are poised for an above-inflation 4.7% increase in their state pension payments, adding to pressure on the government finances as Rachel Reeves explores raising taxes at the autumn budget.</p>\n    <p>Labour has committed to retaining the triple lock on the state pension, which guarantees annual increases in line with whichever is the higher of 2.5%, inflation in September or annual earnings growth in the three months to July.</p>\n    <p>Official figures published on Tuesday show average weekly earnings including bonuses were 4.7% higher in May to July than in the same period a year earlier.</p>\n    <p>Experts said the increase put state pensioners in line for their payments to go up by that amount from next April because inflation in September – currently running at 3.8% – was unlikely to be higher.</p>\n    <p>A final decision will be taken by the government before the budget. However, Pat McFadden, the work and pensions secretary, confirmed on Tuesday that the triple lock promise would be honoured.</p>\n    <p>“That’s a commitment from the Labour government to the UK’s pensioners,” he said. “It’s something that we said we’d do at the election and something that we will keep to.”</p>\n    <p>The latest figures are expected to translate into an annual rise worth more than £500 for those on the new state pension, which would increase from £230.25 a week to £241.05 a week from April. Those retiring on the basic state pension would see their weekly income increase from £176.45 a week to £184.75.</p>\n    <p>Successive governments have committed to the triple lock since it was first <a href=\"https://www.theguardian.com/uk/2010/jun/22/emergency-budget-full-speech-text\">introduced by George Osborne in 2010</a>, despite criticism that protecting pensioner incomes comes with a costly price tag for the public purse and risks fuelling intergenerational inequalities.</p>\n    <p>\n      <a href=\"https://interactive.guim.co.uk/uploader/embed/2025/09/pensions-triple-lock/giv-32554W27OC1D30JFH/\">graphic</a>\n    </p>\n    <p>The Office for Budget Responsibility projects that state pension costs will rise from about 5% of GDP now to about 8% by the 2070s. Half of the increase is driven by the triple lock, at a time of rising pressure on other areas of spending and social care.</p>\n    <p>The Institute for Fiscal Studies has called for the policy to be scrapped. Heidi Karjalainen, a senior research economist at the thinktank, said: “The triple lock has so far been much costlier than initially expected, and it creates a lot of uncertainty in terms of future spending.</p>\n    <p>“If the economy is doing well then it won’t cost more than increasing the state pension in line with average earnings growth, whereas in volatile periods it can become very costly – as we have seen in the last decade and a half.”</p>\n    <p>It comes as official figures showed the UK’s jobs market has continued to cool, amid a slowdown in annual pay growth and rising redundancies.</p>\n    <p>The ONS said annual growth in regular earnings excluding bonuses slowed to 4.8% in the three months to July, down from 5% in the three months to June, matching the forecasts of City economists.</p>\n    <p>\n      <a href=\"#EmailSignup-skip-link-15\">skip past newsletter promotion</a>\n    </p>\n    <p>after newsletter promotion</p>\n    <p>The official unemployment rate was unchanged on the previous month in July, at 4.7%, the highest level in four years.</p>\n    <p>Business groups have complained since Reeves’s first autumn budget that her £25bn increase in <a href=\"https://www.theguardian.com/business/2025/mar/30/a-bitter-blow-british-pubs-restaurants-and-hospitality-firms-brace-for-rise-in-nics\">employer national insurance contributions</a> and 6.7% rise in the “national living wage” would force them to cut jobs and raise prices for consumers.</p>\n    <p>Economists said there was clear evidence of the jobs market cooling. Separate figures from HMRC showed a decline in the number of workers on company payrolls of 8,000, matching City forecasts.</p>\n    <p>After taking account of inflation, annual growth in regular pay was 1.2% in the three months to July, down from 1.5%.</p>\n    <p>Reeves is widely expected to raise taxes in her autumn budget. However, business leaders have warned a weaker growth outlook will make it harder for her to raise taxes without further harming the economy.</p>\n    <p>Daisy Cooper, the Liberal Democrat Treasury spokesperson, said Labour had committed an act of “self sabotage” by pushing more people out of work. “[It has put] even more pressure on already stretched public services and leaving businesses scrambling just to keep the lights on.”</p>\n    <p>Strong wage growth has caused a headache for the <a href=\"https://www.theguardian.com/business/bankofenglandgovernor\">Bank of England</a> by stoking inflationary pressures, putting further interest rate cuts at risk after four reductions in the past year. However, a deeper slowdown in the jobs market could show the economy is deteriorating, supporting faster rate cuts.</p>\n    <p>The Bank is expected to keep its base rate unchanged at 4% at its next policy meeting on Thursday.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "trump-official-confirmed-to-fed-board-but-court-rejects-lisa-cook-remo",
    "title": "Trump official confirmed to Fed board but court rejects Lisa Cook removal bid",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-16",
    "excerpt": "Senate Republicans voted on Monday to confirm a senior Trump official to the Federal Reserve’s board of governors as the White House raced to strengthen the US president’s control over the central bank ahead of its latest meeting.",
    "cover": "https://i.guim.co.uk/img/media/7c9a30f3ddba9b843f1314ce0abd7bc88fe7c52c/328_112_4118_3293/master/4118.jpg?width=1600&quality=85&auto=format&fit=max&s=1600f5cde9115f86604583c94bd42132da",
    "source": "https://www.theguardian.com/business/2025/sep/15/stephen-miran-federal-reserve-lisa-cook",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Callum Jones in New York",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Senate Republicans voted on Monday to confirm a senior Trump official to the Federal Reserve’s board of governors as the White House raced to strengthen the US president’s control over the central bank ahead of its latest meeting.</p>\n    <p>Hours before Fed policymakers convene for their September decision on interest rates, the Senate voted 48 to 47 to confirm Stephen Miran – already chair of Donald Trump’s council of economic advisers – as a governor.</p>\n    <p>The vote concluded just as a <a href=\"https://www.reuters.com/legal/government/appeals-court-declines-let-trump-remove-fed-governor-cook-2025-09-16/\">US appeals court</a> declined the Trump administration’s request to fire Lisa Cook, a governor appointed by Joe Biden, before the two-day policy meeting begins on Tuesday. The ruling from the US court of appeals for the District of Columbia circuit means Cook may remain in her position during the policy meeting where the Fed is expected to cut interest rates.</p>\n    <p>Miran’s appointment marks the first time in the history of the modern Federal Reserve, which stretches back almost a century, that a sitting member of the executive branch would also work at the highest levels of the central bank.</p>\n    <p>Trump has made no secret of his plans to influence the Fed, calling into question the future of its longstanding independence from political oversight by publicly describing plans to swiftly build “a majority” on its board.</p>\n    <p>He has repeatedly broken with precedent – presidents typically allow the Fed to operate without interference – to demand interest rate cuts, and attack senior Fed officials, including its chair <a href=\"https://www.theguardian.com/business/jerome-powell\">Jerome Powell</a>, when they repeatedly defied these calls.</p>\n    <p>While Powell has signaled the Fed is <a href=\"https://www.theguardian.com/business/2025/aug/22/jerome-powell-speech-jackson-hole\">gearing up to resume rate cuts</a>, Trump has already made clear he is unlikely to be satisfied by its cautious approach. Concerning economic signs, including data indicating that <a href=\"https://www.theguardian.com/business/2025/sep/05/us-jobs-report-august-tariffs\">the labor market has stalled</a> while <a href=\"https://www.theguardian.com/business/2025/sep/11/us-inflation-august-trump-tariffs\">inflation picked up</a>, have reinforced expectations that many policymakers will want to tread carefully.</p>\n    <p>The administration has played down these official reports – and <a href=\"https://www.theguardian.com/us-news/2025/aug/01/trump-fires-erika-mcentarfer-labor-statistics\">fired one of the officials</a> responding for overseeing them. Trump’s proposed replacement is an <a href=\"https://www.theguardian.com/us-news/2025/aug/14/trump-bureau-labor-statistics-ej-antoni\">ardent supporter of his agenda</a>, who has been accused of misrepresenting and exaggerating statistics.</p>\n    <p>While Miran described the Fed’s independence as “critical” during a confirmation hearing earlier this month, and pledged to preserve it as governor, his decision to only take unpaid leave from his current job at the White House, rather than resign, raised questions over his ability to operate independently.</p>\n    <p>The administration has also been pushing to remove Cook for the Fed’s board as soon as possible, despite her legal action over Trump’s bid to dismiss her. The president has cited <a href=\"https://www.theguardian.com/us-news/2025/aug/24/trump-lawfare-mortgage-fraud-lisa-cook\">unconfirmed allegations of mortgage fraud</a>. US district judge Jia Cobb also ruled on 9 September that Trump’s unfounded claims of mortgage fraud were not enough to terminate Cook under existing law. Congress created provisions to shield the Fed from political interference including that the president could only fire a governor “for cause”. The law does not define what would qualify as cause for termination.</p>\n    <p>Cook has denied wrongdoing, and argued Trump has no authority to fire her. Her term is not due to expire until 2038. A respected economist, with stints at Harvard University and Stanford University, she is the first Black woman to sit on the Fed’s board of governors. In August, Cook sued the Fed and Trump alleging the president chose to fire her for her stance on monetary policy.</p>\n    <p>Early on Monday, Trump reiterated his call for lower rates. Powell “MUST CUT INTEREST RATES, NOW, AND BIGGER THAN HE HAD IN MIND”, the US president wrote on his Truth Social platform, claiming: “HOUSING WILL SOAR!!!”</p>\n    <p>The latest Fed decision will be announced on Wednesday.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/15/stephen-miran-federal-reserve-lisa-cook\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "this-visit-is-mired-with-potential-pitfalls-despite-careful-planning",
    "title": "This visit is mired with potential pitfalls despite careful planning",
    "category": "News",
    "subcategory": "Top_Stories",
    "date": "2025-09-15",
    "excerpt": "Listen to James read this article",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/99f1/live/3fc05260-9246-11f0-9cf6-cbf3e73ce2b9.png",
    "source": "https://www.bbc.com/news/articles/c4gw25w9841o?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<p>\n      <strong>Listen to James read this article </strong>\n    </p>\n<p>\n      <strong>US President Donald Trump's state visit to the United Kingdom this week will be no stranger to controversy, just as his first was six years ago.</strong>\n    </p>\n<p>Back then, in June 2019, as well as taking tea with the late Queen, the US President called London Mayor Sadiq Khan \"a stone-cold loser\", backed Boris Johnson in a Tory leadership race and suggested the NHS should be part of US-UK trade talks.</p>\n<p>All this was accompanied by a petition saying he should not receive a state visit in the UK, signed by more than one million people, as well as noisy protests involving thousands and a huge inflatable effigy that became known as the Trump Baby.</p>\n<p>This week's second state visit – unprecedented for a non-royal - will prove the first was no exception.</p>\n<p>There will again be protests and Lord Mandelson's sacking as UK ambassador to the US has already cast a diplomatic pall over proceedings.</p>\n<p>Planning for the visit - over Wednesday and Thursday - has gone on for months, but for all the careful preparation, the possibility that things could go wrong is still very real.</p>\n<p>And for many of those organising it, the Mandelson affair is only one of their worries.</p>\n<h2>How Windsor became 'Trumpton'</h2>\n<p>For those at the royal end of the show, the focus has been on logistics and security - and turning Windsor Castle into a ring of steel hard enough to satisfy even the most fastidious secret service agents.</p>\n<p>Such has been the huge American presence some locals have renamed Windsor \"Trumpton\", after the eponymous town in the 1970s children's TV show.</p>\n<p>For Palace officials, attention to detail is all.</p>\n<p>One of the biggest problems has been finding a place to muster the Household Cavalry.</p>\n<p>It needs to be far enough from the helicopter landing zones to ensure the horses are not spooked by the noise, close enough to form the escort quickly that will accompany the Trumps' carriage procession through the grounds of Windsor Castle.</p>\n<p>There has also been much discussion between the Palace and Foreign Office over who sits where at the State Banquet in St George's Hall.</p>\n<p>\"The value of these things are not just the photo opportunities but also all the off-grid conversations,\" said one royal insider.</p>\n<p>\"A huge amount of attention goes into the seating plan for the banquet. So people with certain policy areas are sat next to one another.\"</p>\n<p>Much thought, too, is devoted to the menu and the music which will involve \"lots of nods to his Scottish heritage\".</p>\n<p>King Charles III's seven-minute speech at the banquet has gone through many drafts, ensuring he pushes the right buttons without crossing political lines.</p>\n<p>Officials say they have been given no indication by their US counterparts of what Trump may say in his speech.</p>\n<h2>'Pressure to make this massive'</h2>\n<p>So far, so logistical – but the key challenge for royal organisers has been finding a way of ensuring Trump feels he has been given a full state visit with all the trimmings. That is no easy task.</p>\n<p>The president is on the ground for less than 48 hours and will not visit Downing Street, address Parliament or even find time to play a round of golf.</p>\n<p>\"There has been a large amount of government pressure to make this massive and that's been the challenge,\" one courtier told me.</p>\n<p>The scale of the ceremonial at Windsor has been stepped up, with 1,300 troops and 120 horses involved - far more than those used when President Macron of France visited earlier this year. (It's a point that will no doubt be emphasised to the Americans in private.)</p>\n<p>For the ceremonial hoopla is the overwhelming focus of the White House in this visit; a chance for the President to be photographed with the King and Queen and the Prince and Princess of Wales, along with military parades and bands and the Red Arrows.</p>\n<p>One Whitehall source said: \"The focus is very much on the optics, the historic moment, the pomp. For Trump it's all about TV and this is great TV.\"</p>\n<p>Another said: \"It's theatre. It's all show. It's not like we are going to do deep substance. We are sucking up to the most powerful guy in the world for good reason.\"</p>\n<h2>The Trumps: Warm and solicitous guests</h2>\n<p>Lord McDonald, a former top civil servant in the Foreign Office, said the UK's strategic choice to afford the most powerful man in the world \"the fullest honour British protocol allows\" will be watched closely by the rest of the world.</p>\n<p>\"This state visit is not just a UK-US event,\" he said. \"It will be one of the biggest stories around the world.</p>\n<p>\"The rest of the world will be looking at London and Windsor, burnishing the UK's wider international standing.\"</p>\n<p>Many officials are confident the visit will go smoothly, simply because all sides want it to succeed.</p>\n<p>They emphasise that Palace staff thought the Trumps were warm and solicitous guests in 2019, both keen not to put a foot wrong.</p>\n<p>\"Trump can be quite funny in private,\" said one diplomat. \"He has got quite a neat turn of phrase that the King will appreciate.\"</p>\n<p>For the UK government, the overwhelming aim is for Air Force One to take off on Thursday evening with Trump warmly disposed to Britain.</p>\n<h2>Serious business behind the pageantry</h2>\n<p>Beyond providing a day of royal pageantry, the government has business to conduct on Thursday when proceedings move to the prime minister's country residence at Chequers.</p>\n<p>Ministers hope to complete a deal to <a href=\"https://www.bbc.co.uk/news/articles/c5yp5qzeer6o\">exclude UK steel</a> and aluminium from US tariffs. There will be some new civil nuclear cooperation.</p>\n<p>The centrepiece is set to be the signing of a technology partnership, involving new investment in Britain and greater cooperation with Silicon Valley on artificial intelligence and quantum computing.</p>\n<p>This was Lord Mandelson's priority, something he described in his outgoing letter to embassy staff last week as \"my personal pride and joy\", that he claimed would \"help write the next chapter of the special relationship\".</p>\n<p>All these issues will be portrayed as big domestic \"wins\" to help promote the government's growth agenda.</p>\n<p>The visit will also provide Prime Minister Sir Keir Starmer with a significant opportunity to bend the ear of the president just a week before the United Nations general assembly in New York, especially on Ukraine.</p>\n<p>Jeremy Hunt, who as Foreign Secretary was heavily involved in the last Trump state visit, said this was a key chance to shape the president's thinking.</p>\n<p>\"Trump appears to be on a journey away from Putin, towards recognising that he needs a way of standing with his European allies a bit better,\" Hunt said.</p>\n<p>\"What the government will really be wanting to do is continue that journey, looking for a deal to impose more sanctions on countries buying Russian oil.\"</p>\n<p>Sophia Gaston, senior research fellow at King's College London, said the state visit was an important chance for the UK to influence US policy at a crucial stage of the Trump administration, a window of opportunity between its disruptive first six months and next year when its focus may shift to domestic elections and strategic competition with China.</p>\n<p>\"We are moving into a new phase,\" she said. \"This state visit really does matter. It is about us securing a foothold as the primary symbolic and strategic ally of the United States.\"</p>\n<h2>The Mandelson question</h2>\n<p>For all these potential gains, the risks are huge and the most obvious involves, of course, Lord Mandelson.</p>\n<p>The peer's dismissal as ambassador, after revelations of the scale of his friendship with Jeffrey Epstein following Epstein's conviction as a paedophile, means the press conference at Chequers on Thursday will not be dominated by questions about his future.</p>\n<p>Instead, the prime minister will likely be asked why he appointed the peer in the first place and why he took so long to sack him; what did he know and when?</p>\n<p>Some diplomats wonder if Trump may voice an opinion about who should replace Lord Mandelson, potentially putting No 10 in an invidious position.</p>\n<p>But perhaps the most dangerous question for the Prime Minister may be why he thinks Lord Mandelson should be punished for his links to Epstein, but not the US President standing next to him.</p>\n<p>According to Whitehall sources, this was a point Lord Mandelson deployed as he fought to save his job.</p>\n<p>It was not an argument that found favour in No 10 and officials note Trump, unlike Lord Mandelson, cut ties with Epstein well before his conviction - but it is a question that will float above this week's royal and political ceremonial.</p>\n<p>Diplomats I have spoken to insist that so far the White House has been sanguine - if not a little bemused - at Lord Mandelson's departure, saying it is the UK's business, and the president remains excited about the state visit.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c4gw25w9841o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "pm-i-would-never-have-appointed-mandelson-had-i-known-full-epstein-lin",
    "title": "PM: I would never have appointed Mandelson had I known full Epstein links",
    "category": "News",
    "subcategory": "Politics",
    "date": "2025-09-15",
    "excerpt": "Sir Keir Starmer has said he would \"never\" have appointed Peter Mandelson as his ambassador to the US if he had known the full details of his relationship with convicted paedophile Jeffrey Epstein.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/79f1/live/7c0ecd40-924c-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss",
    "source_domain": "bbc.com",
    "source_name": "Bbc",
    "author": "Bbc",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>PM: I would never have appointed Mandelson had I known full Epstein links</h1>\n    <p>Sir Keir Starmer has said he would \"never\" have appointed Peter Mandelson as his ambassador to the US if he had known the full details of his relationship with convicted paedophile Jeffrey Epstein.</p>\n    <p>In his first comments since sacking Lord Mandelson, Sir Keir said the Labour peer went through a proper due diligence process before his appointment, but he added: \"Had I known then what I know now, I'd have never appointed him.\"</p>\n    <p>Sir Keir gave public backing to Lord Mandelson in the Commons on Wednesday only to sack him the following day.</p>\n    <p>Opposition MPs will get a chance to put further pressure on the government after the Speaker granted the Tories an emergency debate on the appointment on Tuesday.</p>\n    <p>Emails reported by Bloomberg showed supportive messages Lord Mandelson sent to Epstein in 2008 following his guilty plea.</p>\n    <p>The leaked emails included passages in which Lord Mandelson told Epstein to \"fight for early release\" shortly before he was sentenced to 18 months in prison.</p>\n    <p>He is also reported to have told Epstein \"I think the world of you\" the day before the disgraced financier began his sentence for soliciting prostitution from a minor in June 2008.</p>\n    <p>Speaking to reporters, Sir Keir said the messages showed Lord Mandelson \"was not only questioning but wanting to challenge the conviction of Epstein at the time\".</p>\n    <p>Lord Mandelson's emails \"cut across the whole approach that I've taken on violence against women and girls for many years and this government's\", he added.</p>\n    <p>The emails showed \"the nature and extent of the relationship that Peter Mandelson had with Epstein was far different to what I had understood to be the position when I appointed him.\"</p>\n    <p>Sir Keir added he was \"not at all\" satisfied with Lord Mandelson's responses to questions \"put to him by government officials\".</p>\n    <p>The prime minister has faced questions about his judgment in appointing the peer, whose friendship with Epstein was public knowledge, in the first place.</p>\n    <p>Sir Keir insisted he did not know what was in the emails when he defended the US ambassador at Prime Minister's Questions but said he knew Foreign Office officials had asked Lord Mandelson questions about the email.</p>\n    <p>The scandal, coming so soon after Angela Rayner's resignation as deputy prime minister, has encouraged <a href=\"https://www.bbc.co.uk/news/articles/ce32qepq12qo\">some Labour MPs to become more vocal about their frustrations with the prime minister's leadership</a> and the wider Downing Street operation.</p>\n    <p>On Monday Sir Keir faced a further blow, <a href=\"https://www.bbc.co.uk/news/articles/ckgy79yr74do\">when one of his senior aides, Paul Ovenden, resigned</a> after the leaking of explicit messages about veteran MP Diane Abbott from eight years ago.</p>\n    <p>The debate in Parliament could prove damaging for Sir Keir's efforts to draw a line under the scandal ahead of US President Donald Trump's state visit this week, and the Labour conference at the end of the month.</p>\n    <p>Labour MPs are expressing public and private frustration with the prime minister's leadership.</p>\n    <p>The Foreign Affairs Committee, chaired by Labour MP Dame Emily Thornberry, has demanded the government give evidence on how Lord Mandelson was cleared and appointed.</p>\n    <p>Labour backbencher Richard Burgon told Radio 4's Today programme Sir Keir would be \"gone\" if May's elections in Scotland, Wales and parts of England go badly for Labour.</p>\n    <p>The Conservatives have also demanded the prime minister release documents relating to Mandelson's appointment.</p>\n    <p>In the letter to the prime minister, Tory MP Alex Burghart questioned what and when Sir Keir knew of Mandelson's friendship with Epstein before defending the former ambassador during Prime Minister's Questions last Wednesday.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6133/live/2bce6ee0-0b00-11f0-97d3-37df2b293ed1.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox every day”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx25xn2e8zqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "reeves-to-host-bosses-of-uk-and-us-financial-firms-as-trump-visit-begi",
    "title": "Reeves to host bosses of UK and US financial firms as Trump visit begins",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-15",
    "excerpt": "Rachel Reeves will host the bosses of top US and UK financial firms in Downing Street on Tuesday morning, as Donald Trump begins his official state visit.",
    "cover": "https://i.guim.co.uk/img/media/264653c367a82f82b87bb8e43ebff76db17c19f4/1873_0_3340_2672/master/3340.jpg?width=1600&quality=85&auto=format&fit=max&s=cfc1600ec1a4e1487765032c4313a2e0c",
    "source": "https://www.theguardian.com/politics/2025/sep/15/reeves-to-host-bosses-of-uk-and-us-financial-firms-as-trump-visit-begins",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Kalyeena Makortoff Banking correspondent",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Rachel Reeves will host the bosses of top US and UK financial firms in Downing Street on Tuesday morning, as Donald Trump begins his official state visit.</p>\n    <p>The meeting, which will be jointly hosted by US Treasury secretary, Scott Bessent, will be attended by senior figures from BlackRock, Barclays and Blackstone, who will have roundtable talks with officials hoping to highlight economic cooperation between the two countries.</p>\n    <p>Trump’s <a href=\"https://www.theguardian.com/politics/2025/sep/15/donald-trump-uk-state-visit-keir-starmer-peter-mandelson\">two-day visit</a> will include a series of business events, including a state banquet with tech bosses and senior cabinet ministers on Wednesday evening. Trump will later travel to Chequers on Thursday for a business reception, working lunch and press conference with Keir Starmer.</p>\n    <p>Meanwhile, ministers will be hoping that Tuesday’s roundtable with financial bosses from the City and Wall Street will secure further foreign investments that can generate growth and positive headlines before a challenging budget in November.</p>\n    <p>That is expected to include a £100bn investment from Blackstone, the alternative asset manager known for its private equity investments and which manages about $1.2tn (£880bn) worth of assets. It is due to confirm the investment out of the $500bn it is due to invest in Europe over the next decade.</p>\n    <p>Sky News, which broke news of Blackstone’s investment on Monday morning, said the funds would involve private equity buyouts as well as other forms of investment.</p>\n    <p>Blackstone, which is led by Steve Schwarzman, is marking 25 years in London this year, having launched operations in the City in 2000. The office currently employs 650 people, and has about $100bn already invested in the UK. That includes real estate investments, including a datacentre in the north of England. Schwarzman told Bloomberg in June that “the UK government has been really helpful, really focused to make that happen”.</p>\n    <p>Blackstone’s investment pledge will be welcome news, helping to offset challenging decisions in the upcoming autumn budget. Rumours are swirling that the chancellor is considering a number of potential tax increases – including on banks, property and landlords’ rental income – in an effort to plug a shortfall of up to £40bn in the public finances.</p>\n    <p>The government has launched a fresh charm offensive to try to keep businesses onside, and Reeves last week <a href=\"https://www.theguardian.com/politics/2025/sep/10/rachel-reeves-tells-private-equity-bosses-she-plans-to-shut-down-more-regulators\">pledged to shut down more regulators across the UK to encourage growth.</a></p>\n    <p>Reeves – who in July claimed regulators <a href=\"https://www.theguardian.com/politics/2025/jul/15/rachel-reeves-rules-red-tape-boot-on-neck-innovation-mansion-house\">were a “boot on the neck” of business</a> – told private equity bosses that there was “still more to do”, having already sacked the chair of the competitions watchdog, shut down the payments regulator and “severely” constrained the Financial Ombudsman Service.</p>\n    <p>\n      <a href=\"#EmailSignup-skip-link-10\">skip past newsletter promotion</a>\n    </p>\n    <p>after newsletter promotion</p>\n    <p>“I want to take out more regulators; there’s still too many,” Reeves told investment firms at the British Private Equity &amp; Venture Capital Association summit in London.</p>\n    <p>The Treasury declined to comment.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/politics/2025/sep/15/reeves-to-host-bosses-of-uk-and-us-financial-firms-as-trump-visit-begins\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "us-agrees-commercial-terms-on-tiktok-sale-as-trump-says-china-talks-we",
    "title": "US agrees commercial terms on TikTok sale, as Trump says China talks went ‘very well’ – as it happened",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-15",
    "excerpt": "Trump hints TikTok deal has finally been reached with China",
    "cover": "https://i.guim.co.uk/img/media/b13840cd2cd8e715b420405054260047c5d883a0/458_0_4583_3667/master/4583.jpg?width=1600&quality=85&auto=format&fit=max&s=ab1600b1995d0a6ebb2e157d4f6ab721ae",
    "source": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Graeme Wearden",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>Trump hints TikTok deal has finally been reached with China</p>\n    <p>Donald Trump has dropped a firm hint that the US and China have reached a deal about the future of TikTok.</p>\n    <p>Posting on Truth Social a few minutes ago, Trump declares that the meeting taking place between officials from the US and China about trade in Madrid had gone “VERY WELL”</p>\n    <p>Trump wrote:</p>\n    <p>The big Trade Meeting in Europe between The United States of America, and China, has gone VERY WELL! It will be concluding shortly. A deal was also reached on a “certain” company that young people in our Country very much wanted to save.</p>\n    <p>They will be very happy! I will be speaking to President Xi on Friday. The relationship remains a very strong one!!! President DJT</p>\n    <p>TikTok’s owner, Beijing-headquartered ByteDance, has faced a Wednesday deadline to find a buyer for the short video site’s US operations, or be banned in the country.</p>\n    <p>Trump has already extended that deadline several times, giving ByteDance more time to agree a deal with an American-backed owner that satisfies both the US and China.</p>\n    <p>Back in July, Trump claimed that the US “pretty much” had a deal on the sale of TikTok.</p>\n    <p>Washington and Beijing appear to have struck a deal on the future of the US operations of Chinese-owned social media platform TikTok.</p>\n    <p>JamiesonGreer, the US trade representative, said on Monday that Washington and Beijing have struck a framework agreement on transferring TikTok to US-controlled ownership.</p>\n    <p>Speaking after emerging from negotiations with Chinese officials, Scott Bessent said the deal was coming but declined to reveal the commercial terms.</p>\n    <p>“We have a framework for a TikTok deal,” the treasury secretary told reporters after coming out of high-level talks in Madrid.</p>\n    <p>“We’re not going to talk about the commercial terms of the deal. It’s between two private parties, but the commercial terms have been agreed upon.”</p>\n    <p>The framework agreement is a breakthrough in the long-running dispute over TikTok’s ownership, which has raised national security concerns in Washington over the app’s Chinese parent company ByteDance. In April 2024, Joe Biden signed legislation that gave ByteDance nine months to sell the platform to a US-approved buyer or face a total ban – a deadline that Donald Trump has repeatedly extended.</p>\n    <p>Trump hinted that a deal had been done, posting on his Truth Social site that a deal had been reached ‘on a “certain” company that young people in our Country very much wanted to save.’</p>\n    <p>On the ongoing trade talks with China, Scott Bessent told reporters in Madrid:</p>\n    <p>“We had very good discussions. We preferred to keep the discussions on TikTok, we will be holding trade negotiations in about a month again at a different location.”</p>\n    <p>US Treasury Secretary Scott Bessent added that trade talks between US and China had not concluded, after the meeting in Madrid wrapped up this lunchtime in Europe.</p>\n    <p>Instead, they will go to a fifth round in about a month’s time.</p>\n    <p>The Madrid meeting follows earlier talks in Geneva, London and Stockholm in recent months.</p>\n    <p>“We’re not going to talk about the commercial terms of the deal. It’s between two private parties, but the commercial terms have been agreed upon.”</p>\n    <p>He said the details would be ironed out when Trump speaks to China’s Xi on Friday, adding:</p>\n    <p>“We had very good discussions. We preferred to keep the discussions on TikTok, we will be holding trade negotiations in about a month again at a different location.”</p>\n    <p>Trump hints TikTok deal has finally been reached with China</p>\n    <p>Donald Trump has dropped a firm hint that the US and China have reached a deal about the future of TikTok.</p>\n    <p>Posting on Truth Social a few minutes ago, Trump declares that the meeting taking place between officials from the US and China about trade in Madrid had gone “VERY WELL”</p>\n    <p>Trump wrote:</p>\n    <p>The big Trade Meeting in Europe between The United States of America, and China, has gone VERY WELL! It will be concluding shortly. A deal was also reached on a “certain” company that young people in our Country very much wanted to save.</p>\n    <p>They will be very happy! I will be speaking to President Xi on Friday. The relationship remains a very strong one!!! President DJT</p>\n    <p>TikTok’s owner, Beijing-headquartered ByteDance, has faced a Wednesday deadline to find a buyer for the short video site’s US operations, or be banned in the country.</p>\n    <p>Trump has already extended that deadline several times, giving ByteDance more time to agree a deal with an American-backed owner that satisfies both the US and China.</p>\n    <p>Back in July, Trump claimed that the US “pretty much” had a deal on the sale of TikTok.</p>\n    <p>Risk assets have shown “remarkable resilience” in the last few months, defying the trade conflict and policy uncertainties, the Bank of International Settlements (BIS) has pointed out today.</p>\n    <p>In its latest quarterly review, BIS (known as the central bankers’ central bank) says markets have shrugged off trade concerns, and maintained “a risk-on tone”.</p>\n    <p>BIS says:</p>\n    <p>Despite short-lived bouts of volatility triggered by incoming data and political developments, market sentiment remained upbeat, defying mounting challenges, including unease over the longer-run fiscal outlook in several key jurisdictions.</p>\n    <p>BIS also cautions, though, that markets could be too relaxed.</p>\n    <p>Hyun Song Shin, head of the BIS’s monetary and economic department, told reporters that markets are “vulnerable to repricing from bad news,” Bloomberg reports.</p>\n    <p>He warned</p>\n    <p>“This very sanguine assessment seems to be disregarding some of the very real challenges in the real economy.”</p>\n    <p>Donald Trump has proposed that US companies should be relieved from the burden of reporting financial results each quarter.</p>\n    <p>Posting on Truth Social, Trump says:</p>\n    <p>Subject to SEC Approval, Companies and Corporations should no longer be forced to “Report” on a quarterly basis (Quarterly Reporting!), but rather to Report on a “Six (6) Month Basis.” This will save money, and allow managers to focus on properly running their companies.</p>\n    <p>Did you ever hear the statement that, “China has a 50 to 100 year view on management of a company, whereas we run our companies on a quarterly basis??? Not good!!!</p>\n    <p>Quarterly reporting does also give investors an up-to-date view of a company’s performance (and gives live-bloggers more to write about, which I’d say is “good!!!”).</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "chinese-economy-slows-amid-trump-trade-war-and-weaker-consumer-spendin",
    "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
    "category": "News",
    "subcategory": "Economy",
    "date": "2025-09-15",
    "excerpt": "China’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.",
    "cover": "https://i.guim.co.uk/img/media/316ecf4c7da2d379aa27bbaf0b8b048f0adf3185/130_0_3900_3120/master/3900.jpg?width=1600&quality=85&auto=format&fit=max&s=1600d6fca2760a8970b41d41aaf1e1c0e4",
    "source": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
    "source_domain": "theguardian.com",
    "source_name": "Theguardian",
    "author": "Amy Hawkins and agencies",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <p>China’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.</p>\n    <p>The disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.</p>\n    <p>Economists were split over whether policymakers should introduce more near-term fiscal support to hit their annual 5% growth target, with manufacturers awaiting further clarity on a US trade deal and domestic demand curbed by an uncertain job market and property crisis.</p>\n    <p>Industrial output grew by 5.2% year on year last month, National Bureau of Statistics data showed on Monday, the lowest reading since August 2024 and below the 5.7% rise in July. Retail sales, a gauge of consumption, expanded 3.4%, the slowest pace since November 2024, and cooling from a 3.7% rise in the previous month.</p>\n    <p>A spokesperson for China’s statistics bureau said on Monday that more efforts were needed to support China’s ailing property sector and that the “external environment is very severe”.</p>\n    <p>China’s economy remains heavily reliant on exports which have been dealt a blow by the trade war with the US. Although the two countries agreed a pause on tariffs until 10 November, China recorded a slump in US-bound exports last month. China’s exports to the US fell by 33.12% year on year in August, according to customs data. Overall exports increased by 4.4% in August.</p>\n    <p>“The activity data point to a further loss of momentum,” Zichun Huang, China economist at Capital <a href=\"https://www.theguardian.com/business/economics\">Economics</a>, wrote in a note. “While some of this reflects temporary weather-related disruptions, underlying growth is clearly sliding, raising pressure on policymakers to step in with additional support.”</p>\n    <p>Factory activity was hit by the hottest conditions since 1961 and the longest rainy season for the same period.</p>\n    <p>Authorities are leaning on manufacturers to find new markets to offset <a href=\"https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia\">Trump’s unpredictable tariff policies</a> and weak consumer spending.</p>\n    <p>Separate data this month showed factory owners have had some success diverting US-bound shipments to south-east Asia, Africa and Latin America, but the drag from the property crisis continues.</p>\n    <p>Lynn Song, the chief economist for Greater China at ING, suggested the weak data indicated “further stimulus support could be needed to ensure a strong finish to the year”.</p>\n    <p>She said: “While it is too early to gauge the impact of the consumer loan subsidies coming into effect in September, it is likely that more policy support is still needed, given the broader slowdown across the board.” Song said there was a “high possibility” of further interest rate cuts in coming weeks.</p>\n    <p>\n      <a href=\"#EmailSignup-skip-link-13\">skip past newsletter promotion</a>\n    </p>\n    <p>after newsletter promotion</p>\n    <p>However, Zhaopeng Xing, a senior China strategist at ANZ, said that while the data showed momentum in the world’s second-largest economy was weakening, it was not yet bad enough to trigger a new round of stimulus.</p>\n    <p>“Policies and measures to support service consumption are expected to offset the impact of aggregate demand this month,” he said, adding that an official crackdown on firms aggressively cutting prices made domestic demand appear worse than it was.</p>\n    <p>Chinese households, which have seen their wealth shrink in the property downturn, have tightened their purse strings as business confidence falters, dampening the jobs market.</p>\n    <p>Unemployment edged up to a six-month high of 5.3% in August, from 5.2% a month prior and 5% in June.</p>\n    <p>Meanwhile, new home prices fell by 0.3% last month from July and by 2.5% on an annual basis, a different NBS dataset showed.</p>\n    <p>\n      <i>Reuters and Agence France-Presse contributed to this report</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]