[
  {
    "slug": "charlie-kirk-suspect-linked-to-crime-scene-by-dna-says-fbi-chief",
    "title": "Charlie Kirk suspect linked to crime scene by DNA, says FBI chief",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "DNA on a towel wrapped around the suspected gun used to kill Charlie Kirk has been matched to the suspect in custody, the director of the FBI said on Monday.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ef56/live/249ea940-9242-11f0-a1c9-9feb11d883c1.jpg",
    "source": "https://www.bbc.com/news/articles/c203qgn61geo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Charlie Kirk suspect linked to crime scene by DNA, says FBI chief</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ef56/live/249ea940-9242-11f0-a1c9-9feb11d883c1.jpg.webp\" alt=\"Reuters/Cheney Orr FBI Director Kash Patel speaks during a press conference\"/>\n    <p>DNA on a towel wrapped around the suspected gun used to kill Charlie Kirk has been matched to the suspect in custody, the director of the FBI said on Monday.</p>\n    <p>Tyler Robinson, 22, was arrested over the death of the right-wing influencer at an event at Utah Valley University on Wednesday. A bolt-action rifle was recovered near the shooting, and a screwdriver was found on the roof from where the fatal shot was fired.</p>\n    <p>\"I can report today that the DNA hits from the towel that was wrapped around the firearm and the DNA on the screwdriver are positively processed for the suspect in custody,\" Kash Patel told Fox and Friends.</p>\n    <p>A formal charge is expected this week. A motive has yet to be determined.</p>\n    <p>The FBI director who has been facing scrutiny over his handling of the case, also referenced a note that was discovered at the suspects home, which vowed \"take out\" Kirk.</p>\n    <p>It's \"basically saying... 'I have the opportunity to take out Charlie Kirk', and I'm going to take it that note was written before the shooting,\" said Patel.</p>\n    <p>He added, \"even though it has been destroyed, we have found forensic evidence of the note\".</p>\n    <p>According to a Utah County Sheriff inmate booking sheet obtained by the BBC, Robinson is accused of aggravated murder, obstruction of justice, and felony discharge of a firearm.</p>\n    <p>The breakthrough comes after the governor of Utah, Spencer Cox, said on Sunday that Robinson - who had been persuaded to surrender by his father - had been refusing to co-operate with investigators and had not confessed to carrying out the shooting.</p>\n    <p>Cox added that Robinson's roommate and partner, who is believed to be transgender had been helping with the investigation.</p>\n    <p>Vice President JD Vance has announced he will host Monday's episode of Kirk's podcast in a tribute to his friend and long-time Trump ally.</p>\n    <p>Kirk grew to national prominence as a polarising figure in the US after helping found Turning Point USA, a right-wing youth political group, and used his audiences online to build support for often controversial talking points.</p>\n    <p>The father-of-two had been participating in the American Comeback Tour, visiting several college campuses across the US to debate college students when he was shot.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c203qgn61geo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "what-a-legend-duplantis-clears-6-30m-to-break-pole-vault-world-record",
    "title": "'What a legend!' - Duplantis clears 6.30m to break pole vault world record",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "There was an error",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8c8/live/2caddc10-923c-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/sport/athletics/videos/c237mlvl845o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>'What a legend!' Duplantis clears 6.30m to break world record</h1>\n    <h2>This content is not available in your location.</h2>\n    <p>There was an error</p>\n    <p>Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.</p>\n    <p>FOLLOW LIVE: <a href=\"https://www.bbc.com/sport/athletics/live/cgq42jv277jt\">World Athletics Championships</a></p>\n    <p>\n      <i>Available to UK users only.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/athletics/videos/c237mlvl845o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "i-m-just-a-mixed-race-kid-from-flats-in-kirkby-says-stephen-graham-in-",
    "title": "'I'm just a mixed-race kid from flats in Kirkby', says Stephen Graham in acceptance speech",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Actor Stephen Graham has described himself as \"just a mixed-race kid from Kirkby\" as he accepted an Emmy award for his starring role in the acclaimed Netflix series Adolescence.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9f76/live/4e797e50-921c-11f0-9626-27d4fe3cc3f8.jpg",
    "source": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>'I'm just a mixed-race kid from flats in Kirkby'</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9f76/live/4e797e50-921c-11f0-9626-27d4fe3cc3f8.jpg.webp\" alt=\"ALLISON DINNER/EPA/Shutterstock Stephen Graham has short hair and is wearing a black suit and black shirt. He is holding an Emmy award aloft with his right hand and had his left hand on his chest.\"/>\n    <p>Actor Stephen Graham has described himself as \"just a mixed-race kid from Kirkby\" as he accepted an Emmy award for his starring role in the acclaimed Netflix series Adolescence.</p>\n    <p>In his acceptance speech, the 52-year-old, who grew up in the Merseyside town, said: \"This kind of thing doesn't happen to a kid like me.\"</p>\n    <p>Graham played Eddie Miller in the series, which told the story of a teenage boy accused of killing a schoolmate.</p>\n    <p>The star, who was named outstanding lead actor, also paid tribute to his children and wife Hannah Walters, who he described as his \"rock\" and \"soulmate\".</p>\n    <p>The series <a href=\"https://www.bbc.co.uk/news/articles/cd72d98gj58o\">scooped six trophies</a> at the awards, including one for outstanding supporting actor won by Owen Cooper, who at just 15 became the youngest ever male Emmy winner, for his breakout role Adolescence.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b76b/live/054e2680-921d-11f0-9626-27d4fe3cc3f8.jpg.webp\" alt=\"Netflix A scene from Adolescence with Stephen Graham playing Eddie Miller\"/>\n    <p>In his speech, Graham said: \"This kind of thing doesn't happen to a kid like me. I'm just a mixed race kid from a block of flats in a place called Kirkby.</p>\n    <p>\"So for me, to be here today, in front of my peers and to be acknowledged by you is the utmost humbling thing I could ever imagine in my life, and it shows you that any dream is possible.</p>\n    <p>\"There's too many people to thank but I am going to thank my friends and family. Without you, none of this is possible.</p>\n    <p>\"Thank you for helping me with something that I can't do on my own.</p>\n    <p>\"Jack, everyone, Phil, everyone. I want to bring it to my dad for taking me to the video shop when I was a kid and kick-starting my education in film - Quarry Green video shop.</p>\n    <p>\"My kids Grace and Alfie and my adorable wife, who I love with every ounce of my being, you are my rock, you are my world, you are my soulmate and you know and I know, without you, I would be dead.</p>\n    <p>\"So from the bottom of my heart I love you with everything I have. Namaste everyone, thanks very much.\"</p>\n    <p>\n      <i>Listen to the best of </i>\n      <i>BBC Radio Merseyside on Sounds</i>\n      <i> and follow BBC Merseyside on </i>\n      <i>Facebook</i>\n      <i>, </i>\n      <i>X</i>\n      <i>, and </i>\n      <i>Instagram</i>\n      <i>. You can also send story ideas via Whatsapp to 0808 100 2230.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "adolescence-star-owen-cooper-makes-emmys-history-as-youngest-male-winn",
    "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "British actor Owen Cooper has become the youngest male ever to win a primetime Emmy Award, in a night dominated by Netflix's acclaimed drama Adolescence.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f3c/live/9d101b40-91d7-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<ul>\n      <li>Adolescence star Owen Cooper, 15, becomes the youngest ever male Emmy Award winner</li>\n      <li>The Netflix drama scoops four major awards, with Stephen Graham and Erin Doherty also winning</li>\n      <li>Cooper says \"I was nothing about three years ago, I'm here now\" in emotional speech</li>\n      <li>Elsewhere, The Studio breaks the record for most wins by a comedy for a single series</li>\n    </ul>\n<p>\n      <strong>British actor Owen Cooper has become the youngest male ever to win a primetime Emmy Award, in a night dominated by Netflix's acclaimed drama Adolescence. </strong>\n    </p>\n<p>Cooper, 15, was named best supporting actor in a limited series for his portrayal of a schoolboy accused of murdering a classmate.</p>\n<p>The four-part drama also won best limited series, as well as prizes for its directing and writing, and acting prizes for <strong>Stephen Graham</strong> and <strong>Erin Doherty</strong>.</p>\n<p>In his acceptance speech, Cooper said: \"Standing up here is just, wow, it's just so surreal.</p>\n<p>\"When I started these drama classes a couple of years back, I didn't expect to even be in the United States, never mind here.\"</p>\n<p>Cooper, who played teenager Jamie Miller, said: \"I think tonight proves if you listen, and you focus and you step out your comfort zone, you can achieve anything in life.</p>\n<p>\"Who cares if you get embarrassed? Anything can be possible. I was nothing about three years ago, I'm here now.\"</p>\n<p>He also thanked his family, co-stars, and the show's production team, adding: \"It may have my name on this award, but it really belongs to the people behind the camera.\"</p>\n<p>Cooper broke the record previously held by Scott Jacoby, who was 16 years old when he won a Primetime Emmy in 1973 for That Certain Summer.</p>\n<p>Roxana Zal remains the youngest acting winner overall. She was 14 when she won an Emmy in 1984 for Something About Amelia. Bindi Irwin is the youngest person to have won a Daytime Emmy, when she was nine.</p>\n<h2>'Any dream is possible' - Stephen Graham</h2>\n<p>Adolescence was widely praised by critics and viewers for its exploration of the impact of smartphones and social media on teenagers.</p>\n<p>In his acceptance speech for leading actor, Graham said: \"This kind of thing normally doesn't happen to a kid like me, I'm just a mixed-race kid from a block of flats in a place called Kirkby.</p>\n<p>\"So for me to be here today in front of my peers and be acknowledged by you is the most humbling thing I could ever imagine in my life, and it shows you that any dream is possible.\"</p>\n<p>Doherty, who played a child psychologist who works with Jamie, won best supporting actress in a limited series.</p>\n<p>The British actress joked she would be \"banging on about Owen Cooper and Adolescence for the rest of my life\".</p>\n<p>\"I'd love to mention every single person involved in making this show because it was the definition of a team effort,\" she added.</p>\n<p>Accepting the prize for outstanding writing earlier in the night, Graham said: \"We never expected our little programme to have such a big impact, but we're really grateful that it did.\"</p>\n<p>His co-writer <strong>Jack Thorne</strong> paid tribute to the show's young cast, telling them: \"You are the flame that proved young people are going to be OK.\"</p>\n<p>Earlier in the weekend, actor <a href=\"https://www.instagram.com/p/DOmESUWDUuO/?hl=en\">Jake Gyllenhaal surprised Cooper</a> during an interview, after the young actor previously described him as his hero. </p>\n<p>In a clip that went viral on social media, Gyllenhaal gave Cooper the \"lucky duck\" which had originally been given to him when he was nominated for an Oscar.</p>\n<h2>The Studio breaks comedy record</h2>\n<p>Other winners at the Emmys included Hollywood satire <strong>The Studio</strong>, which won several of the major comedy categories, including best actor for its star and creator <strong>Seth Rogen</strong>.</p>\n<p>The actor joked: \"I couldn't wrap my head around this happening, so I've prepared nothing.</p>\n<p>\"I never won anything in my life. When I was a kid I bought a used bowling trophy at an estate sale. This is really just so lovely.\"</p>\n<p>The Studio broke the record for the most wins by a comedy for a single series, winning 13 awards in total including those it took home at last weekend's Creative Arts Emmys.</p>\n<h2>Hacks and The Pitt stars triumph</h2>\n<p><strong>Jean Smart</strong> repeated her win for best leading actress in a comedy for her performance in the satirical <strong>Hacks</strong>.</p>\n<p>Her co-star <strong>Hannah Einbinder</strong> also won an acting prize for the first time, taking home best supporting actress in a comedy.</p>\n<p>Einbinder thanked Smart and the show's crew for \"changing my life in every conceivable way\".</p>\n<p>On a night were several celebrities made direct or indirect references to the Israel-Gaza war, Einbinder finished her speech by saying: \"Free Palestine.\"</p>\n<p>Medical drama <strong>The Pitt</strong> won the prestigious best drama series award, while its stars <strong>Katherine LaNasa</strong> and <strong>Noah Wyle</strong> were recognised with individual acting prizes.</p>\n<p>But there were also wins in the drama categories for sci-fi thriller <strong>Severance</strong>, with acting prizes awarded to <strong>Britt Lower</strong> and <strong>Tramell Tillman</strong>, who became the first black winner of best supporting actor in a drama.</p>\n<p>Tillman dedicated his award to his mother, who he said was his \"first acting coach\".</p>\n<p>\"Mama, you were there for me when no-one else was, and no-one else would show up,\" he said. \"Your love and kindness stays with me, and this is for you.\"</p>\n<h2>Departing Colbert's job plea</h2>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "watch-the-winning-speeches-in-two-minutes",
    "title": "Watch: The winning speeches - in two minutes",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The 77th Primetime Emmy Awards have taken place in Los Angeles on Sunday night, with shows The Studio, The Pit and Adolescence dominating the awards.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/83ae/live/3b4b4a00-920f-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>Watch: Winning moments from the 77th Emmy Awards</h1>\n    <p>The 77th Primetime Emmy Awards have taken place in Los Angeles on Sunday night, with shows The Studio, The Pit and Adolescence dominating the awards.</p>\n    <p>Owen Cooper became the youngest ever male Emmy winner at 15-years-old, for his breakout role in the Netflix miniseries Adolescence.</p>\n    <p>Seth Rogan's comedy series The Studio scooped up four Emmys, while The Pitt beat out the likes of Severance and The White Lotus to win Best Drama.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "everybody-wants-to-know-what-s-going-to-happen-summer-i-turned-pretty-",
    "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The Summer I Turned Pretty fans are preparing for this week's series three finale - and many are desperate to know how the season will end.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5109/live/c5452270-9157-11f0-9223-171c11f85051.jpg",
    "source": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "rights": "Unknown",
    "body": "<html>\n  <body>\n    <h1>The secrets began before I even auditioned, says The Summer I Turned Pretty actress</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5109/live/c5452270-9157-11f0-9223-171c11f85051.jpg.webp\" alt=\"BBC Corinna Brown is seen smiling widely in a portrait photograph. She is facing the camera and is wearing a grey jumper over a blue striped shirt\"/>\n    <p>The Summer I Turned Pretty fans are preparing for this week's series three finale - and many are desperate to know how the season will end.</p>\n    <p>The Amazon show has been a breakout hit for young viewers and the tech giant is taking no chances of spoiling the story.</p>\n    <p>For actress Corinna Brown, who plays Gemma, the secrecy began before she even auditioned.</p>\n    <p>\"There were codenames galore,\" she remembers. \"There was a codename for the title of the show, there was a codename for my character.</p>\n    <p>\"I thought up until maybe two days before we started shooting that my character was called Maeve.</p>\n    <p>\"Amazon are very good at keeping it a secret.\"</p>\n    <p>So keen are producers to prevent spoilers, BBC News is speaking to Brown under the condition she doesn't discuss the finale, which drops on Prime Video on Wednesday.</p>\n    <p>\n      <strong>Warning: The below may contain spoilers - especially if you haven't watched series three of the show</strong>\n    </p>\n    <p>Millions are gripped by the show's love triangle plot between Isabel 'Belly' Conklin, played by Lola Tung, and brothers Conrad and Jeremiah Fisher, played by Christopher Briney and Gavin Casalegno.</p>\n    <p>Among the obsessions for fans have been a tiny engagement ring, a two-tier mirror glaze dark chocolate cake with raspberries and <i>that</i> sensual<i> </i>peach scene.</p>\n    <p>Brown's character Gemma is one of Belly's new friends she meets after her move to Paris. So what was it like to be part of a cultural phenomenon?</p>\n    <p>\"It was so exciting because it's so highly anticipated and everybody wants to know what's going to happen,\" London-born Brown, 26, says.</p>\n    <p>\"The fan base are so passionate, which is something you don't always get.\"</p>\n    <p>She says she \"didn't really realise\" how big the fandom of the show was until its release.</p>\n    <p>\"So I think that was a good thing, to be fair, because otherwise, from the beginning, I would have been like: 'Oh my God'.\"</p>\n    <h2>'We all love a bit of romance'</h2>\n    <p>As the show's Paris-era was unlocked, viewers have been introduced to a new supporting cast in Belly's circle in the French capital, including Gemma, who like Belly, is new to Paris.</p>\n    <p>Brown describes her character as a \"kindred spirit\" to Belly.</p>\n    <p>They meet outside a nightclub, when Gemma is being bothered by a man. Belly steps in to help her out and the two become friends.</p>\n    <p>Brown says it is one of her favourite moments and shows \"women supporting each other\".</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/97fe/live/140f50c0-908a-11f0-b903-bb3f680f6a7f.jpg.webp\" alt=\"Getty Images Gavin Casalegno, Lola Tung and Christopher Briney pose on a red carpet promoting The Summer I Turned Pretty\"/>\n    <p>According to Amazon, this season's first episode drew in 25 million global viewers, a 40% increase on the previous season, with Prime Video saying it is its most-watched TV season among women aged 18-34.</p>\n    <p>Brown thinks the success of the show comes down to the writing by Jenny Han, who wrote the young adult (YA) romance books the TV series is based on.</p>\n    <p>\"She knows what she's doing. She's got everybody hooked from the books,\" Brown says.</p>\n    <p>\"It's lucky me to be a little part of that.\"</p>\n    <p>Brown feels another reason why the show resonates is \"because we all go through it\".</p>\n    <p>\"We go through friendship, heartache, love, confusion. For the audience that watch this show and love The Summer I Turned Pretty that is a big thing, it's a new thing, it forms so much of your life.</p>\n    <p>\"Being able to watch someone's else experience of that is helpful... and we all love a bit of romance,\" she says.</p>\n    <p>Beyond the traditional audience watching on screens, there are countless fan edits and reaction videos posted on social media, which Corinna says have been positive towards her character.</p>\n    <p>\"They've been lovely. I've only seen good things. They say they like Gemma giving her [Belly] straight advice.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0628/live/66a7ca90-917c-11f0-974d-05c67cdfea1c.jpg.webp\" alt=\"Prime Video A scene from The Summer I Turned Pretty - cast members sit around a table in a bar with drinks laid out\"/>\n    <p>Already beloved by YA fans for her turn as Tara Jones in Netflix-hit Heartstopper, Brown is no stranger to the world of teen romance adaptations.</p>\n    <p>\"With any show that's for a young audience, you have to have that awareness of the young minds that you're inspiring, shaping,\" Brown says.</p>\n    <p>\"And that's an honour in itself.\"</p>\n    <p>Amid all the buzz of the show, secrets are tightly guarded and with the finale about to drop we are not allowed to ask Brown what happens in it.</p>\n    <p>But we can't help but ask what feels to fans like the summer's most pressing question: <a href=\"https://www.bbc.co.uk/news/articles/cvgr8xy5dlro\">Are you team Conrad or team Jeremiah?</a></p>\n    <p>\"I'm going to keep my lips tight on that one,\" Brown says, smiling.</p>\n    <p>\"But what I will say is I am Team Gemma and Team Belly's friendship forever.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "local-sample-article",
    "title": "Local Sample Article",
    "category": "News",
    "subcategory": "",
    "date": "2025-09-15",
    "excerpt": "Sample description.",
    "cover": "assets/img/cover-fallback.jpg",
    "source": "https://example.com/sample-article",
    "author": "Creator Name",
    "rights": "Unknown",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://example.com/sample-article\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  }
]