[
  {
    "slug": "bbc-news-app",
    "title": "BBC News app",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The BBC News app is available for Android and iOS devices",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2cf6/live/d1e71250-9509-11ee-8df3-1d2983d8814f.png",
    "source": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>The BBC News app keeps you informed with live and breaking news you can trust</h1>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg\" alt=\"BBC News app\"/>\n    <p>The BBC News app is available for Android and iOS devices</p>\n    <p>\n      <strong>With the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.</strong>\n    </p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" alt=\"presentational grey line\"/>\n    <p><a href=\"https://bbcnews.onelink.me/eB56/6mc9icpm\">Click here, external</a> to download the BBC News app from the App Store for iPhone, iPad and iPod Touch.</p>\n    <p><a href=\"https://bbcnews.onelink.me/eB56/ser4scwo\">Click here, external</a> to download the BBC News app from Google Play for Android devices.</p>\n    <p>If you're outside the UK, you can download the BBC app <a href=\"https://bbc-global.onelink.me/Ezi6/2weoqgsp\">here, external</a>.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" alt=\"presentational grey line\"/>\n    <p>Features include:</p>\n    <ul>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">News, features and analysis</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Read top stories and breaking news</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Watch live and developing news coverage</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Get news and weather local to you</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Follow news that's important to you</p>\n      </li>\n      <li>\n        <p class=\"ssrcss-1q0x1qg-Paragraph e1jhz7w10\">Get alerts for top stories</p>\n      </li>\n    </ul>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" alt=\"Presentational white space\"/>\n    <p>We would like to know what you think of the new app - <a href=\"https://www.bbc.co.uk/send/u88080479\">click here</a> to give us your feedback.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" alt=\"Presentational white space\"/>\n    <p>\n      <i>Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.</i>\n    </p>\n    <p>\n      <i>If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.</i>\n    </p>\n    <p>\n      <i>The BBC does not charge you to access mobile content.</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "the-aristocrat-the-convict-and-the-missing-baby",
    "title": "The Aristocrat, the Convict and the Missing Baby",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Next",
    "cover": "https://ichef.bbci.co.uk/images/ic/240x135/p0lk7kzh.jpg",
    "source": "https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body><h1>The Big Cases - The Aristocrat, the Convict and the Missing Baby</h1><ul><li>Episodes</li></ul><h2>Episodes Episodes</h2><ul><li>The Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 mins</li><li>This episodeThe Aristocrat, the Convict and the Missing Baby</li><li>The Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 mins</li><li>The Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 mins</li><li>Neighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 mins</li><li>The Mistaken Identity MurdersThe shocking story of two innocent teenagers murdered in a case of mistaken identity.30 mins</li><li>Killed By Kids: The Machete MurderWhen kids kill. The shocking story of two 12 year olds, a machete and a brutal murder.26 mins</li><li>My Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 mins</li><li>Tortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 mins</li><li>Stabbed After SchoolThe shocking story of how a teenage relationship ended in murder.28 mins</li><li>Crushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 mins</li><li>The House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 mins</li><li>Killer In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 mins</li><li>The Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 mins</li><li>The Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.25 mins</li><li>The Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 mins</li><li>Held Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 mins</li><li>Killed In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 mins</li><li>The Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 mins</li><li>The Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 mins</li><li>Killed By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 mins</li><li>The Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 mins</li><li>The Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 mins</li><li>Deadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 mins</li><li>Unmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 mins</li><li>Killed on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 mins</li><li>The Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 mins</li><li>Killed on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 mins</li><li>The Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins</li><li>30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 mins</li><li>Caught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 mins</li><li>The Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 mins</li><li>Homegrown TerroristCould the Manchester Arena bombing have been stopped?24 mins</li><li>Twenty Minutes Of TerrorA gunman kills five people within minutes. Could the shootings have been prevented?20 mins</li><li>Found Under the FloorThe story of Bennylyn and Jellica who were murdered after starting a new life in the UK.23 mins</li><li>Groomed, Radicalised, GoneThe schoolgirl charged with terrorism, but found to have been exploited.14 mins</li></ul><h2>Pagination controls</h2>Previous<ul><li>1Page 1 of 2</li><li><a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954/the-big-cases-the-aristocrat-the-convict-and-the-missing-baby?seriesId=unsliced&amp;page=2\">2Page 2 of 2</a></li></ul><p><a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954/the-big-cases-the-aristocrat-the-convict-and-the-missing-baby?seriesId=unsliced&amp;page=2\">Next</a></p></body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/iplayer/episode/m001z954?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "epstein-victim-s-family-speaks-out-over-mandelson",
    "title": "Epstein Victim's Family Speaks Out Over Mandelson",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Epstein Victim's Family Speaks Out Over Mandelson",
    "cover": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "source": "https://www.bbc.co.uk/sounds/play/p0m2sd9g?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Newscast - Epstein Victim's Family Speaks Out Over Mandelson - BBC Sounds</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg\"/>\n    <h1>Newscast - Epstein Victim's Family Speaks Out Over Mandelson - BBC Sounds</h1>\n    <p>Epstein Victim's Family Speaks Out Over Mandelson</p>\n    <p>Virginia Giuffre's family says Mandelson should never have been appointed US ambassador.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.co.uk/sounds/play/p0m2sd9g?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "where-the-manchester-derby-was-won-and-lost-tactical-analysis",
    "title": "Where the Manchester derby was won and lost - tactical analysis",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Haaland scores twice as Man City cruise to win against Man Utd",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7b70/live/98b7cac0-9231-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/sport/football/articles/ckge4jpy4l5o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Haaland scores twice as Man City cruise to win against Man Utd</p>\n<ul>\n      <li>Published</li>\n    </ul>\n<p>\n      <strong>It was a Manchester derby to forget for Ruben Amorim's Manchester United, with defeat at the Etihad meaning the Portuguese's Premier League record now reads eight wins from 31 matches.</strong>\n    </p>\n<p>But was <a href=\"https://www.bbc.com/sport/football/live/c62q3y96n38t\">Sunday's 3-0 loss</a> a case of a faulty philosophy, individual mistakes, or an impressive performance from Manchester City?</p>\n<p>Here we analyse the game, focusing on both teams' tactics.</p>\n<h2>How City created a four v two in midfield</h2>\n<p>City focused much of their play down the left-hand side in the first half.</p>\n<p>Blues boss Pep Guardiola aimed to exploit weaknesses in United's defensive approach, with an eye on their back five, two central midfielders and the aggressive manner in which the wider centre-backs are asked to step out to press.</p>\n<p>The hosts' left-back - Nico O'Reilly - took a wider position on the touchline, aiming to draw United right wing-back Noussair Mazraoui towards him.</p>\n<p>Jeremy Doku - City's left winger - would ordinarily have been marked by Mazraoui, but as O'Reilly took the wide position, Doku was more central.</p>\n<p>That gave Mazraoui the difficult task of knowing who to pick up. His decision was to ignore Doku and instead defend the wide spaces - stepping up to press O'Reilly when the ball went to him.</p>\n<p>Doku's inside position ensured City had an overload around United's midfield.</p>\n<p>Rodri, Phil Foden (who had dropped deeper), Doku (who had moved inside) and Tijjani Reijnders formed a box around United's midfield duo.</p>\n<p>It was the same tactic <a href=\"https://www.bbc.com/sport/football/articles/c2djywy3754o\">Fulham used against United</a> earlier this season, when Alex Iwobi vacated his left-wing position to create an overload in midfield.</p>\n<p>O'Reilly stands on the touchline, Doku moves into midfield and City have an overload centrally</p>\n<h2>United's disjointed press</h2>\n<p>With Doku infield, it was Leny Yoro - United's right centre-back - who was tasked with pushing up aggressively on him.</p>\n<p>That is a difficult ask for a natural central defender, especially with Doku dropping as deep as his own half, and it was made more difficult as Foden also occupied those areas.</p>\n<p>Yoro's front-footed defending made the midfield battle a four against three - rather than four against two - at times, but he would often retreat when City's players moved deeper as he did not want to end up too far from his backline.</p>\n<p>By not committing entirely to backing up the press in a man-to-man fashion, United's press was disjointed - meaning City had a free man somewhere.</p>\n<p>United captain Bruno Fernandes touched on this after the match, admitting his team needed to be \"more brave with full pressure\" to prevent the opening goal.</p>\n<p>\"City take that risk against us - we need to do the same,\" he said.</p>\n<p>\"I was trying to press Rodri because the aim of the midfielders was for one to jump on Rodri, with one of the defenders on Foden.</p>\n<p>\"In the first moment, I can cover both but Leny comes up so I go more on Rodri. And Leny was going backwards because of a miscommunication and we end up giving too much space on the pitch.\"</p>\n<p>A team-wide man-to-man press would ensure easy passing options aren't available for the opposition.</p>\n<p>As Fernandes mentions, it was the job of one of the defenders - namely Yoro - to jump on Foden. But the clever positioning of O'Reilly and movement of Doku meant he was left in two minds.</p>\n<p>Foden was able to receive the ball under no pressure and carry it up the pitch - a situation that was replicated later in the game.</p>\n<p>Yoro was tasked with stepping up to press Foden but Doku's movement infield meant he had an extra player to pay attention to</p>\n<h2>City's clever use of pinning</h2>\n<p>City's use of pinning was particularly impressive.</p>\n<p>Pinning is the act of positioning a player in a certain area with the result an opponent also has to stay there.</p>\n<p>If a winger stands on the touchline next to the opposition full-back, for example, the defender is unlikely to leave that area as the attacker would be free. The winger has, therefore, 'pinned' the full-back.</p>\n<p>City used pinning throughout Sunday's game to make United's aggressive defending tactics weaker, and to open up space for their attackers.</p>\n<p>We've already spoken about how O'Reilly pinned Mazraoui to the touchline, leaving Doku free to move inside without being followed.</p>\n<p>On the other flank, we saw clever movement from Reijnders on to Luke Shaw that prevented him from leaving the back five. As a result, Doku's unorthodox positioning - having vacated his flank - allowed him to pick up the ball unopposed.</p>\n<p>Amorim asks his wide centre-backs to step out and apply pressure to the extra opposition player if United are outnumbered in midfield, but with Shaw stuck with Reijnders, City had Doku free.</p>\n<p>Given time, Doku was able to turn and drive with the ball and provided the assist for the first goal.</p>\n<p>With Shaw focused on Reijnders, Doku can receive the ball without pressure.</p>\n<h2>United's midfielders fail to track runners</h2>\n<p>For City's first goal, Fernandes and Manuel Ugarte were back in defensive positions, but the hosts were able to pick up the loose ball in the penalty area uncontested.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/football/articles/ckge4jpy4l5o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "caudery-suffers-injury-heartbreak-in-tokyo",
    "title": "Caudery suffers injury heartbreak in Tokyo",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Heartbreak as Caudery injured in pole vault warm up",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4ee4/live/66644e20-921a-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/sport/athletics/articles/cm285g99dyzo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Caudery suffers injury heartbreak in Tokyo</h1>\n    <p>Heartbreak as Caudery injured in pole vault warm up</p>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>Molly Caudery's bid for world pole vault gold was ruined by injury in Tokyo, where the brutal conditions led to Emile Cairess pulling out of the men's marathon less than three miles from the end of the race.</strong>\n    </p>\n    <p>Briton Caudery, the 2024 world indoor champion, rolled her ankle in the warm-up after she planted her left foot into the landing mat after a run-through.</p>\n    <p>The 25-year-old, who failed to qualify for the Olympic final last year, received medical attention and was given support from her fellow athletes as the realisation struck that her competition had ended before it had even begun.</p>\n    <p>Emotional, she covered her face with her hands as she was taken away from the track in a wheelchair shortly before the competition got under way.</p>\n    <p>\"Heartbroken... again,\" Caudery later wrote on social media.</p>\n    <p>British Para-athlete Stef Reid said on BBC TV: \"It is just a freak accident. She has done nothing wrong. To see it end like that, in tears, that is not how she wanted to come away from Tokyo.</p>\n    <p>\"She was coming here looking to have a redo of Paris. When it comes to athletics, these opportunities don't come around a lot.</p>\n    <p>\"The pole vault mats are meant to be soft, she must have caught her ankle at a terrible angle. It's devastating.\"</p>\n    <p>Five-time javelin global medallist Steve Backley said: \"It's just so frustrating for Molly.</p>\n    <p>\"It's something she will have done thousands of times in training, you run through and put your foot on an unstable surface. It's just one of those injuries that you won't see coming.\"</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published19 hours ago</li>\n        </ul>\n      </li>\n      <li>\n        <ul>\n          <li>Published22 hours ago</li>\n        </ul>\n      </li>\n    </ul>\n    <p>There was further injury heartbreak for Sarah Tait, who fell at a water jump less than two minutes into her women's 3,000m steeplechase heat.</p>\n    <p>The 24-year-old, who lowered her personal best by more than 30 seconds this year to make her first global championship, could not continue and departed in tears on a wheelchair.</p>\n    <p>\"Sarah is in the form of her life. She has done so well to make it to these championships. Sadly for her, that is a terrible way for it to end,\" said 1983 world 1500m champion Steve Cram.</p>\n    <p>British team-mate Elise Thorner qualified for Wednesday's 15-athlete final by finishing third in her heat.</p>\n    <h2>'I've not known conditions like it'</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1008/cpsprodpb/fb23/live/25819400-91e6-11f0-b2ad-6df457b08014.jpg\" alt=\"Great Britain's Emile Cairess competes in the men's marathon at the World Championships in Tokyo \"/>\n    <p>After injury ruled him out of this year's London Marathon, Emile Cairess had not competed over 26.2 miles since last summer's Olympics</p>\n    <p>With temperatures of about 30C accompanied by intense humidity continuing to pose a challenge to the athletes in the Japanese capital, Cairess was unable to complete the men's marathon.</p>\n    <p>The 27-year-old Briton, a medal contender after placing fourth at the Paris 2024 Olympics, stopped by the roadside with less than three of the 26.2 miles remaining and the lead group beginning to move out of reach.</p>\n    <p>\"I tried my best. I just got too hot, simple as that really. The conditions were so tough,\" said Cairess, who finished third in last year's London Marathon.</p>\n    <p>\"When I stopped, I just took ages to just feel all right again. I used all the stations to be diligent with the ice and the sponges. While it helped, it just still got too hot.</p>\n    <p>\"I did a decent amount of preparation for the conditions, as much as I could balancing it with training. I've not known conditions like it, but this is only my fourth marathon. I did the best I could.\"</p>\n    <p>The race was won in a thrilling sprint to the line, the second in as many days in the marathon events, as Tanzania's Alphonce Simbu pipped Germany's Amanal Petros to win his nation's first global title.</p>\n    <p>Both athletes were timed at two hours nine minutes 48 seconds but, after a photo finish, Simbu clinched gold by 0.03 seconds - the smallest winning margin in a marathon at a global championships and closer than the winning margins in Sunday's 100m finals.</p>\n    <p>'Have you ever seen anything like that?' Marathon ends in sprint finish thriller</p>\n    <h2>Injured Olympic 100m champion Alfred withdraws</h2>\n    <p>Olympic 100m champion Julien Alfred will not contest the women's 200m later this week after suffering a hamstring injury during the 100m final.</p>\n    <p>St Lucia's Alfred achieved bronze in the sport's blue riband event on this occasion, one year after winning her nation's first Olympic medals in Paris, where she also collected 200m silver.</p>\n    <p>But, in doing so, she sustained a grade one hamstring strain and has withdrawn from the championships.</p>\n    <p>Alfred's agent Henry Rolle told Jamaican News Centre: \"With that information, she will withdraw from the 200m as she won't be close to her regular self and we definitely won't put her in a position where she could damage herself even further.</p>\n    <p>\"Rehab has started and we look forward to 2026.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1056/cpsprodpb/4747/live/5b52a730-9214-11f0-b391-6936825093bd.jpg\" alt=\"World Athletics Championships 2025 medal table\"/>\n    <h2>Related topics</h2>\n    <ul>\n      <li>\n        <ul>\n          <li>Published20 hours ago</li>\n        </ul>\n        <graphic alt=\"Katarina Johnson-Thompson won heptathlon gold in Budapest in 2023\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/bd00/live/fe08ec60-874b-11f0-84c8-99de564f0440.jpg 976w\" width=\"1024\" height=\"575.8115799803729\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published7 days ago</li>\n        </ul>\n        <graphic alt=\"British 800m runners Georgia Hunter Bell, Keely Hodgkinson and Jemma Reekie \" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/2ae4/live/0d5ed760-835a-11f0-825f-ef3af8edf016.jpg 976w\" width=\"1376\" height=\"773.8073188946975\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/athletics/articles/cm285g99dyzo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "the-world-cup-s-final-four-and-how-england-can-beat-them",
    "title": "The World Cup's final four - and how England can beat them",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "England, Canada, New Zealand and France are ranked one to four in the world respectively",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6419/live/b5815d20-91a9-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/sport/rugby-union/articles/c3e7vxglv7wo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>The World Cup's final four - and how England can beat them</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/6419/live/b5815d20-91a9-11f0-84c8-99de564f0440.jpg\" alt=\"Braxton Sorensen-McGee and Pauline Bourdon-Sansus in a composite images\"/>\n    <p>England, Canada, New Zealand and France are ranked one to four in the world respectively</p>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>Two matches and three teams separate England from Rugby World Cup glory.</strong>\n    </p>\n    <p>The Red Roses will play France in Saturday's Rugby World Cup semi-final in Bristol, after Canada and New Zealand contest the other last-four match the previous evening.</p>\n    <p>After racking up winning margins in excess of 30 points in every match so far in the tournament, nerves and scorelines alike are expected to get tighter from this point on for England.</p>\n    <p>So, who are the other contenders for the crown?</p>\n    <h2>New Zealand</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/4760/live/34f1a3f0-91a8-11f0-9cd3-f59c04558629.jpg\" alt=\"Black Ferns\"/>\n    <p>New Zealand have won six of the seven Women's Rugby World Cup semi-finals they have contested</p>\n    <p>The six-time champions, as ever, seem to be timing their tilt to perfection.</p>\n    <p>The young talent of teenage superstar Braxton Sorensen-McGee, all-action flanker Jorja Miller and scrum-half Maia Joseph have refreshed a team that still contains the know-how of captain Ruahei Demant and living legend Portia Woodman-Wickliffe.</p>\n    <p>After their preparations for the last Rugby World Cup on home soil were disrupted by internal issues, coach Allan Bunting appears to have forged an impressive sense of collective purpose.</p>\n    <p>When it comes to New Zealand and the women's World Cup, there is a feeling of inevitability that bolsters their belief and undermines that of their rivals. England especially. The Red Roses have lost all five finals they have contested against New Zealand.</p>\n    <p>However, there are chinks in their armour.</p>\n    <p>New Zealand were troubled by South Africa's ultra-physical approach in the first half of their quarter-final, with the Springboks making metres with 15-player driving mauls and forward thrusts around the fringes.</p>\n    <p>England have the forward grunt to make similar inroads. Early on could be the time to make hay as well.</p>\n    <p>The win over South Africa was the second match that New Zealand have started slowly. Japan also caught the Black Ferns cold, exposing a narrow defence to score the first try before being blown away 62-19.</p>\n    <h2>Canada</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/a4e9/live/5aa10280-91a8-11f0-9cd3-f59c04558629.jpg\" alt=\"Canada clasp hands\"/>\n    <p>Canada held a fundraising drive titled Mission: Win Rugby World Cup to cover the cost of their pre-tournament training camp</p>\n    <p>Canada are closest to runaway world number ones England in the rankings.</p>\n    <p>They have embellished those spreadsheet credentials with their deeds on the pitch too. They beat New Zealand for the first time in their history last year, prevailing 22-19 to clinch the Pacific Four Series.</p>\n    <p>And they backed up that result with a 27-27 draw against the Black Ferns in Christchurch four months ago.</p>\n    <p>Almost half of their squad have honed their game in England's PWR and all of them are smart, all-court rugby players.</p>\n    <p>The back three of Julia Schell, Alysha Corrigan and Asia Hogan-Rochester work, outside a classy one-two punch centre combination of Alex Tessier and Florence Symonds.</p>\n    <p>Second row Sophie De Goede captains her country, just as both of her parents did. The 26-year-old Saracen, who has only recently recovered from a serious knee injury, was immense in the quarter-final win over Australia, kicking goals, pulling strings and popping up all over the pitch.</p>\n    <p>The dedicated training camp that a C$1m (£530,000) fundraising drive - titled Mission: Win Rugby World Cup – helped pay for has produced a more cohesive, connected group.</p>\n    <p>Head coach Kevin Rouet has accused his team of being \"too Canadian\" – lacking the killer instinct to put matches beyond teams.</p>\n    <p>Scotland have come closest to Canada so far in the tournament and England coach John Mitchell will have noted how Evie Gallagher and Fran McGhie both scored tries with cleverly angled runs, close to the breakdown.</p>\n    <h2>France</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/5931/live/95d36dc0-91a8-11f0-9cd3-f59c04558629.jpg\" alt=\"Joanna Grisez runs against Ireland\"/>\n    <p>Joanna Grisez streaked away for a breakaway score to break Irish hearts</p>\n    <p>Before England can contemplate either New Zealand or Canada, they must find a way past France.</p>\n    <p>Based on the way the Red Roses swatted aside France on their own turf in a 40-6 win in their final Rugby World Cup warm-up, that should be straightforward.</p>\n    <p>But France have a habit of raising their game for the big stage and a stomach for the fight.</p>\n    <p>They ran England to within a point in the final round of the Six Nations earlier this year, with a second-half comeback ending in <a href=\"https://www.bbc.com/sport/rugby-union/articles/c89g522dw72o\">a too-close-for-comfort 43-42 win for the Red Roses</a>.</p>\n    <p>Against Ireland in the quarter-finals, they succeeded where they failed at Allianz Stadium. France gave up 13 unanswered points to Ireland in the first half, but rallied in the second half to claim an 18-13 win.</p>\n    <p>Pauline Bourdon-Sansus is perhaps the finest scrum-half in the women's game and drove her team on with tempo from the base. Meanwhile, wings Kelly Arbey and Joanna Grisez have both scored superb tries against England in the past.</p>\n    <p>Whether France can hold their own up front is another thing. Five of England's six tries came from the forwards in the team's most recent meeting and France need a vast improvement to even have parity in the pack.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/rugby-union/articles/c3e7vxglv7wo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "uk-and-us-unveil-nuclear-energy-deal-ahead-of-trump-visit",
    "title": "UK and US unveil nuclear energy deal ahead of Trump visit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg",
    "source": "https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>UK and US unveil nuclear energy deal ahead of Trump visit</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg.webp\" alt=\"Getty Images An engineer with a fuel rod handling machine in a nuclear power station\"/>\n    <p>The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.</p>\n    <p>The agreement aims to generate thousands of jobs and strengthen Britain's energy security.</p>\n    <p>It is expected to be signed off during US President Donald Trump's state visit this week, with both sides hoping it will unlock billions in private investment.</p>\n    <p>However, the designs behind some of the deals are relatively new and it could take many years before the nuclear projects generate energy for homes and businesses.</p>\n    <p>The key focus of the so-called Atlantic Partnership for Advanced Nuclear Energy is to make it quicker for companies to build new nuclear power stations in both the UK and the US.</p>\n    <p>The hope is to halve the time it takes to gain regulatory approval for nuclear projects from up to four years to two.</p>\n    <p>In practice, it means that if a reactor has already passed safety checks in one country, that work can be used to support the work of the other.</p>\n    <p>The UK's nuclear programme already includes plans for small modular reactors (SMRs), which are a scaled-down version of larger plants. Britain's engineering firm Rolls Royce has been selected to design and build the first in the country.</p>\n    <p>One of the commercial deals set to be signed this week is with US nuclear group X-Energy and the UK's Centrica, which owns British Gas, to build up to 12 advanced modular reactors (AMRs) in Hartlepool.</p>\n    <p>Unlike SMRs, which are water-cooled nuclear reactors, advanced modular reactors use gases such as helium as a coolant.</p>\n    <p>There are very few AMRs in the world operating on a commercial basis such as China's HTR-PM reactor.</p>\n    <p>X-Energy wants to build one in the US but, after announcing a partnership with US chemicals and plastics giant Dow in 2021, it has taken until March this year to submit a construction permit application to the Nuclear Regulatory Commission for the project in Texas.</p>\n    <p>X-Energy has said it hopes the reactor at a Dow site could be a blueprint for others and \"manufacturers worldwide could replicate this model\".</p>\n    <p>The government said the Hartlepool deal has the potential to power 1.5 million homes and create up to 2,500 jobs.</p>\n    <p>Energy Secretary Ed Miliband said: \"Nuclear will power our homes with clean, homegrown energy and the private sector is building it in Britain, delivering growth and well-paid, skilled jobs for working people.\"</p>\n    <p>But Greenpeace questioned the UK's focus on nuclear power.</p>\n    <p>\"If these proposals for new reactors scattered around Britain really materialise, the net effect will be higher bills from nuclear's relentlessly spiralling costs, and more CO2 as we wait for the builders to overcome their inevitable construction delays,\" said Dr Douglas Parr, chief scientist for Greenpeace UK.</p>\n    <p>The cost of building large nuclear plants in the UK, such as Sizewell C in Suffolk, has jumped to £38bn from a previous estimate of £20bn. Centrica is one of the key investors in Sizewell C.</p>\n    <p>SMRs work on the same principle as large reactors, using a nuclear reaction to generate heat that produces electricity, but have around a third of the generating output.</p>\n    <p>The modular element means they could be built to order in factories - as a kit of parts - then transported and fitted together, like a flat-packed power station.</p>\n    <p>However, the SMR industry is still young, and many different designs are being investigated.</p>\n    <p>Centrica's chief executive Chris O'Shea told the BBC's Today programme that increased costs and delays \"can happen in all large projects\".</p>\n    <p>But he said: \"What you need to do is you need to do more than just one every 20 years in order to get better. So, the more you practice, the better you get which is why small and advanced modular reactors are particularly interesting because they'll be repetitive so you'll produce the same thing over and over again.</p>\n    <p>\"That should bring improvements both in terms of cost and schedule and reliability and cost as well.\"</p>\n    <p>Prime Minister Sir Keir Starmer has previously said he wants the UK to return <a href=\"https://www.bbc.co.uk/news/articles/c805mjxe2y9o\">to being \"one of the world leaders on nuclear\"</a>.</p>\n    <p>In the 1990s, nuclear power generated about 25% of the UK's electricity but that figure has fallen to around 15%, with no new power stations built since then and many of the country's ageing reactors due to be decommissioned over the next decade.</p>\n    <p>In November 2024, the UK and 30 other countries signed a global pledge to triple their nuclear capacity by 2050.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "charges-dropped-against-two-men-accused-of-spying-for-china",
    "title": "Charges dropped against two men accused of spying for China",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Charges dropped against two men accused of spying for China</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"AFP/GETTY Split picture showing the faces of Christopher Cash and Christopher Berry.\"/>\n    <p>Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.</p>\n    <p>Christopher Cash, 30, and Christopher Berry, 33, had previously denied the charges under the Official Secrets Act. Beijing has called the allegations \"malicious slander\".</p>\n    <p>The two men were accused of gathering and providing information prejudicial to the safety and interests of the state between 28 December 2021 and 3 February 2023.</p>\n    <p>Speaking outside the Old Bailey following the decision to cease legal proceedings on Monday, Mr Cash said he was \"relieved that justice has been served\".</p>\n    <p>He described the two years since his arrest as a \"nightmare\" and said he hoped \"lessons are learned from this sorry episode\".</p>\n    <p>Prosecutor Tom Little told the the court that his team would offer no evidence against the men and that \"we simply cannot continue to prosecute this case\".</p>\n    <p>The court heard that the Crown Prosecution Service had determined the evidence it had gathered did not meet the threshold to go to trial.<strong> </strong>The pair were due to appear at Woolwich Crown Court from 6 October.</p>\n    <p>The Home Office said it was \"disappointing that they will not face trial given the seriousness of the allegations\".</p>\n    <p>\"We will continue to use the full range of tools and powers to guard against malign activity,\" it added in a statement.</p>\n    <p>Mr Berry, a teacher from Witney in Oxfordshire, and Mr Cash, of Whitechapel in London, were arrested in March 2023 as part of an investigation that involved counter-terror police.</p>\n    <p>They were accused of collecting information which was \"calculated to be, might be, or were intended to be, directly or indirectly, useful to an enemy\".</p>\n    <p>It had been reported that Mr Cash was involved with Parliament's China Research Group (CRG).</p>\n    <p>He was understood to have had access to several Conservative MPs, reportedly including former security minister Tom Tugendhat and then-foreign affairs committee chairwoman Alicia Kearns.</p>\n    <p>Defending Mr Cash, Henry Blaxland KC said his client's colleagues at the CRG had \"expressed disbelief\" at his arrest.</p>\n    <p>\"We only hope that he will be able to rebuild his life,\" he added.</p>\n    <p>Mrs Justice Cheema-Grubb said she was \"quite satisfied\" and entered the two men into not guilty verdicts.</p>\n    <p>When they were charged, a Chinese embassy spokesperson said \"the claim that China is suspected of 'stealing British intelligence' is completely fabricated\".</p>\n    <p>They urged the UK \"to stop anti-China political manipulation and stop putting on such a self-staged political farce\".</p>\n    <p>The government has previously said Chinese spies were targeting UK officials across the political, defence and business sectors as part of an increasingly sophisticated espionage operation.</p>\n    <p>In December, senior judges <a href=\"https://www.bbc.co.uk/news/articles/cp9n4211zn3o\">upheld a decision</a> by MI5 to warn that an alleged Chinese agent, Christine Lee, had infiltrated Parliament and funded a Labour MP, among others.</p>\n    <p>The same month, Yang Tengbo was named as a Chinese businessman who had been banned from the UK for allegedly spying.</p>\n    <p>Both Ms Lee and Mr Yang have denied the accusations made against them.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "fourteen-nhs-trusts-maternity-care-to-be-investigated-over-failures",
    "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d206/live/2b7512f0-9205-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.</p>\n<p>The inquiries are part of a rapid review of maternity care in England that was announced in June.</p>\n<p>Health Secretary Wes Streeting said bereaved families had shown \"extraordinary courage\" in coming forward with issues dating back more than 15 years.</p>\n<p>Some of the families have severely criticised the review and Streeting's handling of it, describing the investigation as \"not fit for purpose\".</p>\n<p>The NHS trusts that will be examined are:</p>\n<ul>\n      <li>Blackpool Teaching Hospitals</li>\n      <li>Bradford Teaching Hospitals</li>\n      <li>University Hospitals of Leicester</li>\n      <li>Leeds Teaching Hospitals</li>\n      <li>Sandwell and West Birmingham</li>\n      <li>Gloucestershire Hospitals</li>\n      <li>Yeovil District Hospital</li>\n      <li>Oxford University Hospital</li>\n      <li>University Hospitals Sussex</li>\n      <li>Barking, Havering and Redbridge University Hospitals</li>\n      <li>Queen Elizabeth, Kings Lynn</li>\n      <li>University Hospitals of Morecambe Bay</li>\n      <li>East Kent Hospitals</li>\n      <li>Shrewsbury and Telford Hospital</li>\n    </ul>\n<p>Baroness Amos, who will chair the review, said she was committed to ensuring families affected by maternity care failures were heard and that the 14 investigations would lead to improvements nationwide.</p>\n<p>She told BBC Radio 4's Today programme that she hoped the review would help families \"get the justice that they want and that they deserve\".</p>\n<p>She added that the current situation - in which trusts had been investigated already and \"hundreds\" of recommendations made, yet fresh reviews were required - was \"completely unacceptable\".</p>\n<p>Improved maternity care may have prevented the deaths of over 800 babies lives in 2022-23, according to research by the baby loss charities Sands and Tommy's.</p>\n<p>Streeting opted for the rapid review instead of a national inquiry into maternity care, which many families have been calling for.</p>\n<p>The review was due to be completed by December, but will now not report until Spring 2026. Baroness Amos says she will aim to produce interim findings around Christmas.</p>\n<p>The review will examine the experience of families and staff within England's struggling maternity services and investigate why the recommendations from previous maternity inquiries in Morecambe Bay, East Kent, and Shrewsbury and Telford have not led to sustained improvements.</p>\n<p>Past inquiries have revealed issues including ignoring women's voices, poor leadership, a failure to learn from safety incidents and a toxic culture. Yet families are still repeatedly reporting substandard care.</p>\n<p>There will also be \"particular attention\" paid to examining why black and Asian families have noticeably poorer outcomes, Baroness Amos said.</p>\n<p>The Department of Health said the trusts had been chosen based on data analysis and the views of families, as well as to ensure a geographical and demographic mix.</p>\n<p>The Royal College of Obstetricians and Gynaecologists said the focus on these trusts would \"create real anxiety among women, families and staff\" at the 14 trusts.</p>\n<p>It added that the review would need to re-build a world class maternity system.</p>\n<p>\"Too many women and babies are not getting the safe, compassionate care they deserve and the maternity workforce is on its knees, with staff leaving the profession,\" said the college's president, Prof Ranee Thakar.</p>\n<p>The strongest criticism of the review, however, comes from the Maternity Safety Alliance (MSA) - a group of families harmed by poor maternity care in several NHS trusts across England.</p>\n<p>Having engaged in a number of meetings with the Department of Health in recent weeks, they said Streeting had \"broken promises\" over how the investigation would be run and what it would examine, and that they had been left feeling \"used\".</p>\n<p>They are particularly critical of the decision not to investigate the role of NHS regulators, such as the Care Quality Commission and NHS Resolution, the health service's insurance and litigation arm.</p>\n<p>\"The review seems to have already decided that all the responsibility for these 800 deaths a year lies squarely with NHS trusts and the clinicians who work in them,\" said Tom Hender, who lost his son Aubrey in 2022.</p>\n<p>\"That's just not true - the whole system is in crisis and we need a whole system approach.\"</p>\n<p>The MSA said the investigation was \"not fit for purpose\" and will not achieve what Streeting said it would, adding: \"It is clear that only a statutory public inquiry can end the crisis in maternity care.\"</p>\n<p>Baroness Amos said the terms of the review were extensive given its time frame and that regulatory bodies were \"not excluded\", but added: \"The kind of in-depth review that is being requested is not something that I am able to conduct.\"</p>\n<p>The two families who successfully campaigned for an investigation into maternity care in Shrewsbury and Telford are more positive about the review, describing it as \"an important and brave first step\".</p>\n<p>But the parents of Kate Stanton-Davies and Pippa Griffiths also said it would be \"safer\" if the review proceeded at a slower pace, adding that proper mental health support had to be provided to those families sharing their experiences.</p>\n<p>\"It's not enough to have a nominal support figure in the room and an email address for follow-up,\" they said in a statement.</p>\n<p>The ongoing challenges facing maternity services were highlighted last week.</p>\n<p>On Monday, a review of care at Gloucestershire Hospitals NHS trust found that the deaths of <a href=\"https://www.bbc.co.uk/news/articles/c3rvqd7v52ro\">nine babies</a> between 2020 and 2023 could have been prevented.  </p>\n<p>Then on Friday, a report found that NHS trusts rated over half their maternity and neonatal buildings as being unsatisfactory, with 7% saying they ran a serious risk of imminent breakdown.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "bloody-sunday-deaths-unnecessary-and-gratuitous-court-told",
    "title": "Bloody Sunday deaths 'unnecessary and gratuitous', court told",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The shooting dead of two men on Bloody Sunday was \"unnecessary and gratuitous\", the trial of a former British soldier has been told.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9cc/live/d57e7c70-299f-11ef-b3b8-ed2dd2d12607.jpg",
    "source": "https://www.bbc.com/news/articles/c79v8lddx0no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>The shooting dead of two men on Bloody Sunday was \"unnecessary and gratuitous\", the trial of a former British soldier has been told.</p>\n<p>Soldier F is accused of murdering James Wray, 22, and William McKinney, 26, as well as five counts of attempted murder in 1972.</p>\n<p>Thirteen people were shot dead by the Parachute Regiment when it opened fire on civil rights demonstrators in the Bogside area of Londonderry. About 15 others were wounded.</p>\n<p>The non-jury trial is taking place at Belfast Crown Court, where Soldier F is screened from public view by a black curtain around part of the dock.</p>\n<p>The former paratrooper, whose identity remains protected by a court order, has entered pleas of not guilty.</p>\n<p>He also denies the five counts of attempted murder.</p>\n<p>Soldier F is further accused of attempting to murder Patrick O'Donnell, Joseph Friel, Joe Mahon, Michael Quinn and an unknown person.</p>\n<p>Three of those he allegedly wounded will testify during the trial.</p>\n<h2>'Unjustified'</h2>\n<p>Prosecution lawyer Louis Mably KC said the shootings were \"unjustified\" and none of the victims posed any threat.</p>\n<p>\"They were unarmed and shot as they ran away.\"</p>\n<p>Mr Mably went on to allege that the soldiers who fired, including Soldier F, then gave a false account of what had happened.</p>\n<p>\"What they did was to falsely claims that the civilians they targeted were armed.</p>\n<p>\"It was demonstrably false.\"</p>\n<p>Mr Mably told the court Bloody Sunday had had a \"long lasting and profound effect\" on Northern Ireland.</p>\n<p>He said the trial would have a narrow and specific focus on events that took place in a courtyard in the Glenfada Park area of Derry's Bogside.</p>\n<p>Soldier F, he said, was \"part of a small group of soldiers who moved west from Rossville Street into that courtyard\".</p>\n<p>That group of soldiers, he added, opened fire \"with their self-loading rifles shooting at the civilians as they ran away\".</p>\n<p>\"And the result was the casualties that I've described, two deaths and four men wounded.\"</p>\n<p>He said the civilians in the courtyard were unarmed and \"did not pose a threat to the soldiers and nor could the soldiers have believed that they did\".</p>\n<p>The soldiers' statements would be subject to a hearsay application on Wednesday that would determine their admissibility, Mr Mably said.</p>\n<p>That hearing, he said, is the first \"substantive matter\" in the case.</p>\n<h2>'Disgraced British army'</h2>\n<p>Setting out the circumstances of the shootings in the courtyard at Glenfada Park, Mr Mably told the court those who had been shot had been hit in the back or side, as they headed towards an exit onto Abbey Street.</p>\n<p>The soldiers, who he described as \"unprofessional\", had lost control of themselves, he said.</p>\n<p>\"Shooting people as they ran away... an act which disgraced the British army,\" he said.</p>\n<p>Families and friends of those killed on Bloody Sunday as well as scores of supporters took part in a walk to the Royal Courts of Justice in Belfast on Monday, ahead of the opening of the trial.</p>\n<p>Those at the front of march carried a large banner saying: \"Towards Justice\".</p>\n<p>Tony Doherty, chair of the Bloody Sunday Trust, said: \"This day is a tribute to the strength of the families, whose indefatigable campaign for justice has made this happen.\"</p>\n<p>Speaking on behalf of the McKinney family before entering the court, John McKinney said it marked \"a momentous day in our battle to secure justice for our loved ones\".</p>\n<p>He said families had battled \"against the odds\" to get here.</p>\n<p>\"We will shortly occupy the courtroom with our heads held high and with the knowledge that regardless of the ultimate outcome that we are on the right side of history,\" he said.</p>\n<h2>Legacy process</h2>\n<p>Northern Ireland veterans commissioner David Johnstone claimed former soldiers were being subjected to \"wholesale demonisation\" as a result of the legacy process in Northern Ireland.</p>\n<p>Johnstone called for \"a fair and balanced\" legacy process.</p>\n<p>\"The vast majority, and this is important, the vast, vast majority of nearly 300,000 Armed Forces that served here in Northern Ireland during Op Banner (Operation Banner), did so with dignity, with restraint and with professionalism, working to protect communities and to prevent civil war here in this province,\" he said.</p>\n<p>He added that \"the stories of soldiers murdered by terrorists receive little media attention, and there's certainly no prospect of a public inquiry into their deaths\".</p>\n<p>Also speaking outside the court, TUV leader Jim Allister said he had stopped off on his way to London to \"show his support\" for veterans.</p>\n<p>The decision to charge Soldier F was taken by the Public Prosecution Service (PPS) in 2019.</p>\n<p>He was one of 18 former soldiers reported to the PPS as a result of a police investigation, which followed the public inquiry into Bloody Sunday conducted by Lord Saville.</p>\n<p>But he was the only one charged.</p>\n<p>Two years later, the PPS dropped the case after the collapse of the trial of two other veterans who had been accused of a 1972 murder in Belfast.</p>\n<p>But the prosecution resumed in 2022 after a legal challenge.</p>\n<p>The key evidence in the Soldier F case is statements given by other soldiers at the time of Bloody Sunday.</p>\n<p>The trial judge is likely to decide at an early stage if they are admissible.</p>\n<h2>Who is Soldier F?</h2>\n<ul>\n      <li>A former British soldier who served with the Army's Parachute Regiment in Northern Ireland during the Troubles</li>\n    </ul>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c79v8lddx0no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "killer-child-car-seats-still-on-sale-10-years-on",
    "title": "'Killer' child car seats still on sale 10 years on",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>'Killer' child car seats still on sale 10 years on</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"BBC Two unidentifiable people holding a child's car seat each. One on the left is orange and the other is blue. The seats are made of thin padded fabric without structure.\"/>\n    <p>Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.</p>\n    <p>Which? warned in 2014 the fabric seats were potentially dangerous to children due to safety defects and were illegal to use in the UK following tests by Surrey Trading Standards, which dubbed the products \"killers\".</p>\n    <p>Which? is urging parents not to be tempted into buying cheap seats after it found they are still being sold via online sites including Shein and eBay, both of which said they took safety very seriously.</p>\n    <p>Regulations state only EU-approved child car seats with R44 or R129 codes can be used in the UK.</p>\n    <p>Approved seats carry a clear orange label, on which the codes are printed, to indicate they have been put through EU safety testing and can therefore be legally sold on the UK market.</p>\n    <p>In 2014, Surrey Trading Standards tested a fabric seat which fell to pieces in a 30 mph accident. The crash test dummy of a three-year-old child was flung through the windscreen when the straps securing the seat failed.</p>\n    <p>Which? said families struggling with living costs could be tempted by the cheaper products, which cost as little as £12.50, compared to the more expensive ones that retail in excess of £80.</p>\n    <p>Stuart Howarth, a car seat safety advisor at Good Egg Safety, which campaigns on child safety, told BBC News he had seen a child using an unsafe seat that had \"no support to the body\" and \"no way of securing it to the car safely\".</p>\n    <p>\"It's just a lethal piece of material,\" he said.</p>\n    <p>\"You might as well just sit on a settee cushion and hope for the best.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7529/live/a7c0b5d0-8fc1-11f0-84c8-99de564f0440.jpg.webp\" alt=\"A rectangular orange label on a child's booster seat.\"/>\n    <p>Which? said it found more than a dozen listings of illegal car seats on websites such as eBay, Little Dreams, ManoMano, Shein and Wish.</p>\n    <p>One listing for a child's car seat on eBay warned against using it in cars despite the product being described as suitable.</p>\n    <p>The description in the listing read: \"It is best not to use it on high-speed cars.</p>\n    <p>\"We recommend that it be used in non-motorized products such as electric vehicles, two-wheelers... Because it is not a child safety seat that complies with traffic.\"</p>\n    <p>In response, eBay said consumer safety \"is a top priority\".</p>\n    <p>\"eBay swiftly removed the listings reported by Which? and the BBC and notified buyers,\" a spokesperson said</p>\n    <p>\"We have updated our existing measures accordingly and remain committed to preventing unsafe products from appearing on the site.\"</p>\n    <p>Which? said stricter rules were needed to \"impose a clear and robust duty on online marketplaces to prevent the sale of unsafe products\" and called for \"strong penalties and rigorous enforcement\".</p>\n    <p>Sue Davies, Which? head of consumer protection policy, said: \"It is appalling that these deadly car seats are reappearing on online marketplaces more than a decade after Which? first exposed them, but it is not surprising.\"</p>\n    <p>She said children's lives \"will be at risk\" until online retailers were forced to comply with product safety regulations.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e554/live/1c3d5cb0-8f04-11f0-84c8-99de564f0440.png.webp\" alt=\"Which? A screenshot of an eBay listing for a child's car seat.\"/>\n    <p>Which? advised families to look for retailers who can provide guidance and help fit the seat.</p>\n    <p>It suggested car seats should not be bought secondhand, as they might have been involved in an accident and damage to the seat may be unclear.</p>\n    <p>Janis James, chief executive of Good Egg Safety, urged parents not to \"skimp\" on cash when purchasing car seats for children.</p>\n    <p>In a statement, Shein said it was committed to \"offering safe and reliable products to its customers\".</p>\n    <p>The online retail giant said the product Which? found listed on its website had been \"mislabelled\" by a third-party seller and Shein had \"taken action against the seller\" after removing it from its platform.</p>\n    <p>It said vendors were required to comply with the company's rules and \"stringent safety standards and must also abide by the relevant laws and regulations of the markets where we operate\".</p>\n    <p>Little Dreams also told the BBC product safety was a \"top priority\".</p>\n    <p>ManoMano said its online marketplace was used by third party sellers to sell their own products.</p>\n    <p>It added: \"We rely on our sellers to provide a resolution to any product/fulfilment issues.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "strong-winds-sweeping-across-uk-but-why-isn-t-this-storm-amy",
    "title": "Strong winds sweeping across UK - but why isn't this Storm Amy?",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Strong winds sweeping across UK - but why isn't this Storm Amy?</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A windswept-looking woman holds an orange umbrella which has blown inside out with an urban street scene in the background.\"/>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.</strong>\n    </p>\n    <p>A gust of 78mph (125km/h) was recorded at Needles, Isle of Wight, on Sunday night with widespread windy conditions expected to continue until the evening.</p>\n    <p>This is causing some travel disruption including the <a href=\"https://www.bbc.com/news/articles/cpvlr98m39do\">closure of the M48 Severn Bridge</a>.</p>\n    <p>However - contrary to some media reports - this weather system is not a named storm.</p>\n    <h2>Yellow wind warning for England and Wales</h2>\n    <p>The Met Office warning covers all of Wales and most of England - away from the far north - and is valid until 1800 on Monday.</p>\n    <p>Wind gusts of 45-55mph (72-89km/h) will continue to affect many inland areas with gusts of 60-70mph (97-113km/h) likely around exposed coasts and over hills.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1800/cpsprodpb/50e1/live/2bf53b40-920c-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A weather map showing the area covered by a yellow warning - all of Wales and most of England, away from the far north. The warning is valid until 18:00 on Monday.\"/>\n    <p>There is a risk of disruption on the roads and at airports, while <a href=\"https://www.nationalrail.co.uk/service-disruptions/poor-weather-20250911/\">Network Rail, external</a> is warning of possible delays on railways.</p>\n    <p>Large waves are expected around the coasts and some power cuts are possible.</p>\n    <p>The weather is expected to calm down during Monday evening as the strongest winds begin to ease.</p>\n    <p>Heavy rain also features with downpours across many northern and western parts of the UK.</p>\n    <h2>Why is this not a named storm?</h2>\n    <p>Some media reports, as well as posts on social media, are suggesting that this is Storm Amy - the first named storm of the UK season.</p>\n    <p>That is not the case.</p>\n    <p>The Met Office <a href=\"https://www.bbc.com/weather/articles/cwy54xllpyno\">names storms</a> in conjunction with the Irish and Dutch weather services based on how significant the impacts are forecast to be.</p>\n    <p>A storm is typically named if it is expected to be bad enough to warrant an amber or red weather warning, and that looks very unlikely this time.</p>\n    <p>When this area of low pressure first appeared on weather charts several days ago it did seem possible that it could be strong enough to be named.</p>\n    <p>However, as the forecast became firmer it looked less and less likely that there would be significant impacts.</p>\n    <p>Storm Amy is going to keep us waiting a while longer.</p>\n    <h2>Will there be a September storm?</h2>\n    <p>The UK had its <a href=\"https://www.bbc.com/weather/articles/c1kz18d3wjro\">hottest summer on record</a> but there is no doubt that the start of meteorological autumn has brought a big change.</p>\n    <p>The <a href=\"https://www.bbc.com/weather/av/54682820\">jet stream</a> has dropped southwards sending wind and rain-bearing weather systems on a beeline for our shores.</p>\n    <p>That has made it a wet September so far, especially in southern and western parts of the country where some places have already recorded more than their average rainfall for the whole month.</p>\n    <p>However, there is no suggestion that <a href=\"https://www.bbc.com/weather/articles/cyvj2lm2p14o\">hosepipe bans</a> and water restrictions will be lifted yet.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/f230/live/a0b35080-9215-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A row of beach huts with pebbles in front and a large puddle in the foreground, with a blue sky and white clouds overhead\"/>\n    <p>Parts of southern England have already seen one and a half times their typical September rainfall</p>\n    <p>The forecast for this week remains very unsettled.</p>\n    <p>After a calmer Tuesday with sunshine for many, Wednesday is expected to bring heavy rain in many areas.</p>\n    <p>Winds will also strengthen during midweek, particularly in the north of the UK with the chance of gales in northern Scotland by Thursday.</p>\n    <p>There is considerable uncertainty about exactly how this weather system will develop.</p>\n    <p>So while it does not currently look likely that this will be a named storm, it is worth staying in touch with the details on the BBC Weather <a href=\"https://www.bbc.com/weather\">website</a> and <a href=\"https://www.bbc.com/weather/articles/cwy00j3yj4eo\">app</a>.</p>\n    <p>Warmer weather could briefly develop at the end of the week, especially in England and Wales, with possible highs of 24C (75F) in the south-east on Friday.</p>\n    <p>Although northerly winds are expected to develop over the weekend bringing a return of cooler conditions - and probably more rain.</p>\n    <p>Some computer models do suggest a chance of higher pressure and drier weather towards the end of the month but this is by no means certain.</p>\n    <p>As we moved deeper into autumn you can keep an eye on the longer-term weather prospects with our <a href=\"https://www.bbc.com/weather/articles/c1ee0klzvneo\">monthly outlook</a>.</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published24 August</li>\n        </ul>\n        <graphic alt=\"A woman holds an umbrella to shelter from the Sun as she walks down a street. Some people are visible in the background, along with an old-fashioned red telephone box\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 976w\" width=\"3840\" height=\"2160.054657253473\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published4 days ago</li>\n        </ul>\n        <graphic alt=\"Satellite image of the tropical Atlantic showing areas of cloud but no tropical storms or hurricanes\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1536/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 976w\" width=\"1536\" height=\"864\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published5 December 2024</li>\n        </ul>\n        <graphic alt=\"Rows of static caravans standing in flood water\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 976w\" width=\"3840\" height=\"2161.029453817558\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "netanyahu-does-not-rule-out-further-strikes-on-hamas-leaders",
    "title": "Netanyahu does not rule out further strikes on Hamas leaders",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Netanyahu refuses to rule out further strikes on Hamas leaders Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b5f6/live/46f38540-920d-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Netanyahu refuses to rule out further strikes on Hamas leaders Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Netanyahu does not rule out further strikes on Hamas leaders 1 hour ago Share Save Tom Bennett Jerusalem Share Save Israel Prime Minister's Office Israeli Prime Minister Benjamin Netanyahu has not ruled out further strikes on Hamas leaders following last week's attack in Qatar, saying they would not have immunity \"wherever they are\". Speaking at a joint press conference with US Secretary of State Marco Rubio in Jerusalem, Netanyahu said every country had the right \"to defend itself beyond its borders\". Israel's decision to target senior Hamas leaders in Qatar - a close US ally - drew international outrage and criticism from US President Donald Trump. Hamas said six people were killed but that its leaders survived. When pressed on whether the US had any involvement in the strike, Netanyahu told journalists: \"We did it on our own. Period.\" The meeting between Rubio and Netanyahu comes as Arab leaders hold a summit in a show of support for Qatar. Its prime minister urged the international community to stop applying \"double standards\" and to punish Israel. In response to a question from the BBC about whether Israel's strike had damaged US relations in the region, Rubio said Washington maintained \"strong relationships with our Gulf allies\". Qatar hosts a major US airbase and has played a key role in brokering diplomatic efforts to end the war in Gaza, serving as a mediator of indirect negotiations between Hamas and Israel. CCTV captures moment of Israeli attack on Hamas leaders in Doha On Sunday, Netanyahu told reporters that the US-Israel relationship was as \"durable as the stones in the Western Wall\" while he and Rubio made a short visit to the holy site in Jerusalem's Old City. During the trip - on which they were accompanied by US ambassador to Israel Mike Huckabee - Rubio wrote a note and placed it into the wall, a traditional ritual performed by visitors. The men ignored reporters' questions focusing on Israel's strikes in Qatar. Also thought to have been discussed by Netanyahu and Rubio are Israeli military plans to seize Gaza City and Israel's continued expansion of settlements in the occupied West Bank. Over the weekend, the Israeli military pressed ahead with the demolition of residential buildings in Gaza City, and - according to local media - is now poised to begin ground operations in the Western neighbourhoods of the city. It has demanded that Gaza City's residents leave and head south to a central area of the strip. The Israel Defense Forces (IDF) estimate about 250,000 Palestinians have fled, though hundreds of thousands are believed to remain in the area. Some say they cannot afford to go south, while others say southern Gaza is not safe as Israel has carried out air strikes there too. Some have said they attempted to go south but were unable to pitch their tents, so returned to Gaza City. Netanyahu and Rubio's meeting comes ahead of a UN General Assembly session next week, at which some leading US allies - including the UK, France, Canada, Australia and Belgium - are expected to recognise the State of Palestine. This expected recognition has intensified debate within Israel around the future of the West Bank, with more hardline elements of the government insisting annexation is the only way to prevent a Palestinian state. In late August, the Israeli government gave final approval for the E1 settlement project east of Jerusalem, which would, in effect, split the West Bank in two - dividing the Palestinian populations in the north and south. Signing an agreement to press ahead with E1 last Thursday, Netanyahu said: \"We are going to fulfil our promise that there will be no Palestinian state. This place belongs to us.\" Earlier this month, Israel's far-right Finance Minister Bezalel Smotrich unveiled his proposal for the annexation of approximately four-fifths of the West Bank. Israel has built about 160 settlements housing 700,000 Jews since it occupied the West Bank and East Jerusalem - land Palestinians want, along with Gaza, for a hoped-for future state - during the 1967 Middle East war. An estimated 3.3 million Palestinians live alongside them. The settlements are illegal under international law. On Monday evening, Rubio is set to visit the City of David archaeological park, which was established by a settler organisation in the Palestinian neighbourhood of Silwan, in occupied East Jerusalem. He will attend the inauguration of the \"Pilgrimage Road\", a tunnel excavated underneath Palestinian homes that is said to mark the route of a Roman-era street taken by pilgrims to the Biblical temple that once stood on the site known to Jews as the Temple Mount and to Muslims as al-Haram al-Sharif (Noble Sanctuary). Critics say the City of David park is an attempt to politicise archaeology, at the expense of Palestinian residents. More on this story Qatar hosts Arab-Islamic emergency summit over Israeli strike on Doha Rubio in Israel as IDF destroys more Gaza…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "prince-harry-says-his-conscience-is-clear-over-royal-revelations",
    "title": "Prince Harry says his 'conscience is clear' over Royal revelations",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Prince Harry says his 'conscience is clear' over Royal revelations Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Eng…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/172b/live/646f0aa0-9216-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Prince Harry says his 'conscience is clear' over Royal revelations Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Prince Harry says his 'conscience is clear' over Royal revelations 1 hour ago Share Save Paul Glynn Culture reporter Share Save Getty Images The Duke of Sussex has said his \"conscience is clear\" following his revealing memoir Spare, and that he did not air his \"dirty linen in public.\" Prince Harry and his wife, the Duchess of Sussex, stepped back from official royal duties in 2020 , and he also spoke publicly about difficulties with family relationships to US talk show host Oprah Winfrey the following year. Speaking to the Guardian while on a trip to Kyiv, Ukraine, he said: \"I don't believe that I aired my dirty laundry in public. It was a difficult message, but I did it in the best way possible. My conscience is clear.\" His comments came just days after a short meeting with his father , King Charles, their first meeting in over a year. It was the first time the pair had met since February 2024. The prince, who also appeared with his wife in the 2022 Netflix series Harry and Meghan, also spoke about his upcoming legal case against the Daily Mail's publisher, Associated Newspapers, at the High Court in London. He is suing them over allegations of phone-hacking and other unlawful information gathering along with Sir Elton John, Baroness Lawrence and other public figures. Associated Newspapers has denied claims that it hacked phones, calling them \"preposterous smears\". \"It is not about revenge, it is about accountability,\" said the Prince, who now lives in the US but returned to the UK last week to attend a series of events related to causes he supports. Underlining his \"love\" for the UK, he suggested he would like to return home to see his family more often. He added that for the coming year, \"the focus really has to be on my dad.\" Reuters Prince Harry laid a wreath in Maidan Square in the centre of Kyiv The aim of Prince Harry's visit to the Ukrainian capital was to promote the work of his Invictus Games Foundation and to celebrate the recovery and rehabilitation of thousands of veterans who have suffered life-changing injuries since the war with Russia began three years ago. \"Nobody should feel embarrassed or ashamed about their disabilities,\" he said. \"It's about flipping from sympathy to admiration and respect.\" After having laid a wreath in memory of the dead, he described the conflict as \"all so unnecessary.\" His work for Invictus, he said, had helped to give him a renewed \"purpose\" after his military career ended, adding that it \"saved me\". He spoke to the British newspaper about the cost of war and how he boxes to relieve stress - punching a punch bag - as well as his portrayal in the media. He stressed that while he felt he had been \"destroyed by certain members of the British press\", he also still felt a lot of love from the British public. In January, the publisher of the Sun newspaper agreed to pay \"substantial damages\" and apologised to him settle a long-running legal battle over claims of unlawful intrusion into his life. He told The Guardian some events of the last four years have been \"very stressful\" and he had been \"finding out certain things that have really, really hurt.\" Prince Harry makes surprise Ukraine visit to support war wounded Harry makes sensational claims in new memoir Why did Harry and Meghan leave the Royal family? Harry's tea with Charles could be small but significant step to reconciliation Prince Harry meets King Charles for first time in more than a year Harry v the tabloids. What next, if anything? UK Royal Family Prince Harry, Duke of Sussex Related Donald Trump's UK state visit is this week - here's what we know Windsor businesses hope Trump trip boosts trade Mandelson should never have been ambassador, says Epstein victim's family More from the BBC 2 days ago Prince Harry makes surprise Ukraine visit to support war wounded The Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia. 2 days ago 4 days ago Weekly quiz: What was wrong with this medal? How much attention did you pay to what happened in the world over the past seven days? 4 days ago 4 days ago Why did Harry and Meghan leave the Royal family? The Duke and Duchess of Sussex have signed a number of commercial deals since stepping down as senior Royals. 4 days ago 4 days ago Harry's tea with Charles could be small but significant step to reconciliation The king and his son have met in person for the first time since February 2024 - but the clues a reunion was nearing have been there, writes senior royal correspondent Daniela Relph. 4 days ago 5 days ago Prince Harry meets King Charles for first time in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "boss-of-degrading-sex-trade-ring-in-dubai-s-glamour-districts-unmasked",
    "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c16/live/c327cfd0-919b-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC 14 hours ago Share Save Runako Celina BBC Eye Investigations Share Save Watch: Charles Mwesigwa - known locally as Abbey - says his women are \"open-minded\" Warning: Contains disturbing content and graphic descriptions of sexual acts A man running a sex ring operating out of Dubai's most glamorous neighbourhoods, and exploiting vulnerable women, has been identified by a BBC investigation. Charles Mwesigwa, who says he is a former London bus driver, told our undercover reporter he could provide women for a sex party at a starting price of $1,000 (£740), adding that many can do \"pretty much everything\" clients want them to. Rumours of wild sex parties in the UAE emirate have circulated for years. The hashtag #Dubaiportapotty, which has been viewed more than 450 million times on TikTok, links to parodies and speculative exposés of women accused of being money-hungry influencers secretly funding their lifestyles by fulfilling the most excessive of sexual requests. Our BBC World Service investigation was told the reality is even darker. Young Ugandan women told us they had not expected to have to undertake sex work for Mr Mwesigwa. In some cases, they believed they were travelling to the UAE to work in places like supermarkets or hotels. At least one of Mr Mwesigwa's clients regularly asks to defecate on the women, according to \"Mia\", whose name we have changed to protect her identity, and who says she was trapped by Mr Mwesigwa's network. Mr Mwesigwa denies the allegations. He says he helps women find accommodation through landlords, and that women follow him to parties because of his wealthy Dubai contacts. We have also discovered that two women linked to Mr Mwesigwa have died, having fallen from high-rise apartments. Although their deaths were ruled as suicides, their friends and family feel the police should have investigated further. Mr Mwesigwa said the incidents were investigated by the Dubai police and asked us to contact them for information. They did not reply to our request. Outside of the UK you can watch on YouTube One of the women who lost her life, Monic Karungi, arrived in Dubai from western Uganda. She found herself sharing a flat with dozens of other women working for Mr Mwesigwa, according to one of the women, who we are calling Keira, who says she lived with Monic there in 2022. \"[His] place was like a market… There were like 50 girls. She was not happy because what she expected is not what she got,\" Keira told us. Monic thought the job in Dubai was going to be in a supermarket, according to her sister Rita. \"He [Mr Mwesigwa] was violent when I told him I wanted to go back home,\" says Mia, who also knew Monic in Dubai. She says that, when she first arrived, he told her she already owed him £2,000 ($2,711) and that within two weeks that debt had doubled. \"Money for air tickets, for your visa, for where you're sleeping, food,\" says Mia. \"That means you have to work hard, hard, hard, pleading for men to come and sleep [with] you.\" Monic owed Mr Mwesigwa more than $27,000 (£19,918) after several weeks, according to what a relative of hers we are calling Michael says she told him. He adds that he received tearful voice notes from her. Family handout Monic grew up with 10 siblings in rural Uganda Mia told us that clients were mostly white Europeans, and included men with extreme fetishes. \"There's this one client, he poops on girls. He poops and he tells them to eat the shit,\" she explained quietly. Another woman we are calling Lexi, who says she was tricked by a different network, echoed Mia's story, saying \"porta potty\" requests were frequent. \"There was a client who said: 'We pay you 15,000 Arab Emirates Dirham ($4,084, £3,013) to gang-rape you, pee in your face, beat you, and add in 5,000 ($1,361, £1,004)'\" for being recorded eating faeces. Her experiences have led her to believe there is a racial element to this extreme fetish. \"Every time I said that I wouldn't want to do that, it seemed to get them more interested. They want somebody who is going to cry and scream and run. And that somebody [in their eyes] should be a black person.\" Lexi says she tried to get help from the only people she thought could intervene - the police. But she says they told her: \"You Africans cause problems for each other. We don't want to get involved. And they would hang up.\" We put this allegation to the Dubai police and they did not reply. Lexi eventually escaped back to Uganda and now helps to rescue and support women in similar situations. Warsan Tower in Dubai, from which Monic Karungi fell in May 2022 Finding Charles Mwesigwa wasn't easy. We could only…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "in-pictures-best-looks-from-the-emmys-red-carpet-in-la",
    "title": "In pictures: Best looks from the Emmys red carpet in LA",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Emmys red carpet: Sydney Sweeney, Jenna Ortega and Selena Gomez Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Englan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/91c5/live/cf399320-9219-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Emmys red carpet: Sydney Sweeney, Jenna Ortega and Selena Gomez Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Sydney Sweeney and Lisa from Blackpink walk Emmys red carpet 13 hours ago Share Save Steven McIntosh Entertainment reporter Share Save Watch: Best looks from the Emmys red carpet Sydney Sweeney, Jenna Ortega, Selena Gomez and Lisa from Blackpink were among the stars walking the red carpet ahead of the Emmy Awards. The ceremony took place on Sunday at the Peacock Theatre in Los Angeles, rewarding the best TV shows of the past 12 months. Adolescence star Owen Cooper makes Emmys history at 15 Cash for speeches and big wins for The Pitt and The Studio - 7 Emmys highlights The winners and nominations in full Here are just a few of the stars who posed for pictures ahead of television's biggest night: Getty Images Lisa, from K-pop girlband Blackpink, made her acting debut in The White Lotus Getty Images Wednesday star Jenny Ortega Getty Images Severance director Ben Stiller pictured with his wife, actress Christine Taylor Getty Images Euphoria star Sydney Sweeney was one of the presenters at the ceremony Getty Images The White Lotus star Aimee Lou Wood Getty Images Abbott Elementary creator and star Quinta Brunson Getty Images Disclaimer star Cate Blanchett Getty Images L-R: Adolescence stars Stephen Graham, Ashley Walters, Owen Cooper, Christine Tremarco and Erin Doherty Getty Images The White Lotus star Walton Goggins Getty Images Only Murders In The Building star Selena Gomez Getty Images The Penguin star Colin Farrell, pictured with his son Henry Getty Images The Last of Us star Pedro Pascal Getty Images The Studio star Catherine O'Hara Getty Images Black Mirror's Charlie Brooker and executive producer Jessica Rhoades Getty Images The Four Seasons star Colman Domingo Getty Images The Studio star Chase Sui Getty Images Presumed Innocent star Jake Gyllenhaal Getty Images Severance actress Dichen Lachman Getty Images Carrie Coon of The White Lotus Getty Images Hacks star Jean Smart Getty Images Shabana Azeez from The Pitt Getty Images Nobody Wants This star Kristen Bell Getty Images Hacks star Hannah Einbinder Getty Images Harrison Ford, star of Shrinking, with his wife Calista Flockhart Getty Images Sam Nivola of the White Lotus Getty Images Shrinking star Brett Goldstein Getty Images The White Lotus star and former Emmy winner Jennifer Coolidge Getty Images Adam Brody from Nobody Wants This Getty Images Presumed Innocent star Ruth Negga Getty Images Abbott Elementary's William Stanford Davis Getty Images The Late Show host Stephen Colbert, pictured with his wife Evelyn McGee-Colbert Getty Images The Traitors USA host Alan Cumming Getty Images Director Taika Waititi with his wife, singer Rita Ora Getty Images Actress Scarlett Johansson with her husband, Saturday Night Live star Colin Jost Getty Images Hacks star Megan Stalter was one of several stars referencing the Israel-Gaza war, carrying a bag with the slogan \"Cease Fire\" Getty Images Monsters: The Lyle and Erik Menendez Story star Javier Bardem wore a keffiyeh scarf as he voiced support for Palestinians Getty Images The White Lotus actress Parker Posey Getty Images Real Housewives star Phaedra Parks Adolescence star Owen Cooper makes Emmys history Emmy Awards 2025: The winners and nominations in full How Adolescence pulled off an Emmys sweep Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights Television Related Adolescence Emmys haul 'left no time to go to loo' Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info BBC.com Help & FAQs Content Index Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "history-making-wins-and-heartfelt-thank-yous-highlights-from-the-cerem",
    "title": "History-making wins and heartfelt thank yous - highlights from the ceremony in LA",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Emmys highlights: Cash for speeches and big wins for The Pitt and The Studio Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Po…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5215/live/5933bed0-9214-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Emmys highlights: Cash for speeches and big wins for The Pitt and The Studio Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights 5 hours ago Share Save Nardine Saad Los Angeles Share Save Watch: Key winning moments from the 77th Emmy Awards The 77th Primetime Emmys Awards generated another slate of viral moments, from cash awards for short speeches to history-making wins and heartfelt thank yous. This year's big winners of the night were HBO's medical drama The Pitt, Apple TV+'s Hollywood satire The Studio and Netflix's chilling psychological miniseries Adolescence. Tramell Tillman made history as the first black man ever to win an Emmy for supporting actor in a drama series. The Late Show host Stephen Colbert pulled off a big win after his fellow nominees in the talk show category rallied behind him following his show's abrupt cancellation. And awards night host Nate Bargatze implored winners to keep their long-winded speeches snappy with a running gag that saw his charity donation docked if speech-givers went over their allotted time. Here's a look at this year's big moments from the ceremony at the Peacock Theater in downtown Los Angeles. Adolescence sweeps its category Getty Images Stephen Graham and Jack Thorne's drama about a 13-year-old boy accused of murder dominated the miniseries category with wins for best series and for stars Owen Cooper and supporting actress Erin Doherty. Cooper, 15, made Emmys history as the youngest supporting actor to win his category, and delivered a heart-warming acceptance speech after giving presenter Sydney Sweeney a shy hug. \"It means so much to me, my family, people back home. So, you know, it's just, yeah, it just means a lot to me,\" Cooper said backstage after his win. Backstage, director Philip Barantini told reporters that they made the show in Yorkshire with the hope it would \"spark a bit of a conversation in the UK\" where knife crime has become a big issue, but added he could not have predicted its global success. The Studio wins big Getty Images The Studio actors Dewayne Perkins, Keyla Monterroso Mejia, Kathryn Hahn, Chase Sui Wonders, Seth Rogen, Ike Barinholtz and Bryan Cranston The Hollywood satire Seth Rogen co-created and stars in picked up several awards, completing an impressive run in its first season. Rogen, who arrived backstage unable to carry all the trophies he had acquired, joked: it's \"getting embarrassing\". Alas, he did not thank his fictional right-hand man Sal Saperstein in his acceptance speech. Emmy Awards 2025: The winners and nominations in full Sydney Sweeney and Lisa from Blackpink walk Emmys red carpet Adolescence star Owen Cooper makes Emmys history The Pitt bests Severance Getty Images Katherine LaNasa and Noah Wyle at the 77th Primetime Emmy Awards It came down to Severance's battle of the mind and The Pitt's battle of the heart in the best drama series category, with HBO's medical drama besting the top nominee. The Pitt took home two major Emmy awards in a row, winning outstanding drama series and Noah Wyle winning best lead actor in a drama series, who called his win \"a dream\". \"I want to dedicate this, on behalf of everyone, to all the healthcare workers, front-line first responders. Respect them, protect them, trust them,\" show creator R Scott Gemmill said while accepting the award for best drama. Before that, Katherine LaNasa also won the award for best supporting drama actress for her portrayal of a charge nurse, Dana, in the show. Host Nate Bargatze keeps speeches in check with a cheque Getty Images Emmys host Nate Bargatze kept a running tally of donations to the Boys and Girls Club of North America throughout the show First-time host Nate Bargatze, known for his family-friendly humour, knocked it out of the park with his idea to keep winner speeches short: He started off the night with a $100,000 (£73,630) pledge to the Boys and Girls Club of North America that would be docked $1,000 for every second someone went over. \"It's hard. It's tough. It's brutal. I can't change it. This is a game I made up and these are the rules,\" he said in his opening monologue after explaining the idea. The \"game\" ran throughout the telecast, with most winners ignoring it or promising to make up for how much money they lost the club. The check-ins throughout the night made for a consistent running gag. The Studio star Seth Rogen kicked off the speeches and kept it speedy due to his shock at the win, adding another $6,000 to the roster. But his successor, The Pitt star Katherine LaNasa greatly overran, and had what Bargatze called \"a very expensive wave\" that lost the club several thousands of dollars. During a mid-show check-in the total was down to -$26,000 and Bargatze quipped that he's \"actually making money\". But with Hollywood's love of a happy ending, Bargatze closed the show by pledging $250,000 and that network CBS would add…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "i-m-just-a-mixed-race-kid-from-flats-in-kirkby-says-stephen-graham-in-",
    "title": "'I'm just a mixed-race kid from flats in Kirkby', says Stephen Graham in acceptance speech",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Stephen Graham: 'I'm just a mixed-race kid from flats in Kirkby' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Engla…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9f76/live/4e797e50-921c-11f0-9626-27d4fe3cc3f8.jpg",
    "source": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Stephen Graham: 'I'm just a mixed-race kid from flats in Kirkby' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live 'I'm just a mixed-race kid from flats in Kirkby' 3 hours ago Share Save Jenny Coleman North West Share Save ALLISON DINNER/EPA/Shutterstock Stephen Graham was named outstanding lead actor for his role in the hit Netflix series Actor Stephen Graham has described himself as \"just a mixed-race kid from Kirkby\" as he accepted an Emmy award for his starring role in the acclaimed Netflix series Adolescence. In his acceptance speech, the 52-year-old, who grew up in the Merseyside town, said: \"This kind of thing doesn't happen to a kid like me.\" Graham played Eddie Miller in the series, which told the story of a teenage boy accused of killing a schoolmate. The star, who was named outstanding lead actor, also paid tribute to his children and wife Hannah Walters, who he described as his \"rock\" and \"soulmate\". The series scooped six trophies at the awards, including one for outstanding supporting actor won by Owen Cooper, who at just 15 became the youngest ever male Emmy winner, for his breakout role Adolescence. Netflix Stephen Graham played Eddie Miller, the father of a 13-year-old boy accused of murder In his speech, Graham said: \"This kind of thing doesn't happen to a kid like me. I'm just a mixed race kid from a block of flats in a place called Kirkby. \"So for me, to be here today, in front of my peers and to be acknowledged by you is the utmost humbling thing I could ever imagine in my life, and it shows you that any dream is possible. \"There's too many people to thank but I am going to thank my friends and family. Without you, none of this is possible. \"Thank you for helping me with something that I can't do on my own. \"Jack, everyone, Phil, everyone. I want to bring it to my dad for taking me to the video shop when I was a kid and kick-starting my education in film - Quarry Green video shop. \"My kids Grace and Alfie and my adorable wife, who I love with every ounce of my being, you are my rock, you are my world, you are my soulmate and you know and I know, without you, I would be dead. \"So from the bottom of my heart I love you with everything I have. Namaste everyone, thanks very much.\" Listen to the best of BBC Radio Merseyside on Sounds and follow BBC Merseyside on Facebook , X , and Instagram . You can also send story ideas via Whatsapp to 0808 100 2230. More on this story How Adolescence pulled off an Emmys sweep Netflix's Adolescence makes UK TV ratings history Knowsley Kirkby Related New pavilion honours pioneer of women's football Driver dies in motorway car fire Watchdog probes foodbank over use of funds More from the BBC 2 days ago Golf club upgrade prompts nine weeks of roadworks Drivers have complained of \"gridlock\" around the works close to Kirkby Golf Club. 2 days ago 3 days ago Driver charged after man dies in burning car John Butler, 31, faces a charge of causing death by dangerous driving after the M52 incident. 3 days ago 28 Aug 2025 Man to cycle 200 miles for domestic abuse charity Mickey Burns aims to cycle more than 200 miles through the night for a Liverpool-based charity. 28 Aug 2025 21 Jul 2025 £1m spent trying to save dangerous flats The cash from tenants and taxpayers has been spent trying to fix Beech Rise and Willow Rise. 21 Jul 2025 18 Jul 2025 Man charged with murder of dad shot on doorstep Ryan Walsh-Westhead, 24, is arrested exactly one year on from the murder of Rikki Berry in Kirkby. 18 Jul 2025 British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info BBC.com Help & FAQs Content Index Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "adolescence-star-owen-cooper-makes-emmys-history-as-youngest-male-winn",
    "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Adolescence star Owen Cooper makes Emmys history as youngest ever male winner Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f3c/live/9d101b40-91d7-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Adolescence star Owen Cooper makes Emmys history as youngest ever male winner Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Adolescence star Owen Cooper makes Emmys history at 15 10 hours ago Share Save Steven McIntosh Entertainment reporter Share Save Watch: Key winning moments from the 77th Emmy Awards Adolescence star Owen Cooper, 15, becomes the youngest ever male Emmy Award winner The Netflix drama scoops four major awards, with Stephen Graham and Erin Doherty also winning Cooper says \"I was nothing about three years ago, I'm here now\" in emotional speech Elsewhere, The Studio breaks the record for most wins by a comedy for a single series British actor Owen Cooper has become the youngest male ever to win a primetime Emmy Award, in a night dominated by Netflix's acclaimed drama Adolescence. Cooper, 15, was named best supporting actor in a limited series for his portrayal of a schoolboy accused of murdering a classmate. The four-part drama also won best limited series, as well as prizes for its directing and writing, and acting prizes for Stephen Graham and Erin Doherty . In his acceptance speech, Cooper said: \"Standing up here is just, wow, it's just so surreal. \"When I started these drama classes a couple of years back, I didn't expect to even be in the United States, never mind here.\" The winners and nominations in full Cash for speeches and big wins for The Pitt and The Studio - 7 Emmys highlights How Adolescence pulled off an Emmys sweep In pictures: Sydney Sweeney, Jenna Ortega and Selena Gomez on red carpet Cooper, who played teenager Jamie Miller, said: \"I think tonight proves if you listen, and you focus and you step out your comfort zone, you can achieve anything in life. \"Who cares if you get embarrassed? Anything can be possible. I was nothing about three years ago, I'm here now.\" He also thanked his family, co-stars, and the show's production team, adding: \"It may have my name on this award, but it really belongs to the people behind the camera.\" Getty Images Cooper, 15, described his record-breaking win as \"surreal\" Cooper broke the record previously held by Scott Jacoby, who was 16 years old when he won a Primetime Emmy in 1973 for That Certain Summer. Roxana Zal remains the youngest acting winner overall. She was 14 when she won an Emmy in 1984 for Something About Amelia. Bindi Irwin is the youngest person to have won a Daytime Emmy, when she was nine. Getty Images Erin Doherty said making Adolescence had been \"the definition of a team effort\" 'Any dream is possible' - Stephen Graham Adolescence was widely praised by critics and viewers for its exploration of the impact of smartphones and social media on teenagers. In his acceptance speech for leading actor, Graham said: \"This kind of thing normally doesn't happen to a kid like me, I'm just a mixed-race kid from a block of flats in a place called Kirkby. \"So for me to be here today in front of my peers and be acknowledged by you is the most humbling thing I could ever imagine in my life, and it shows you that any dream is possible.\" Doherty, who played a child psychologist who works with Jamie, won best supporting actress in a limited series. The British actress joked she would be \"banging on about Owen Cooper and Adolescence for the rest of my life\". \"I'd love to mention every single person involved in making this show because it was the definition of a team effort,\" she added. Getty Images Stephen Graham won best lead actor in a limited series, as well as a prize for co-writing the drama Accepting the prize for outstanding writing earlier in the night, Graham said: \"We never expected our little programme to have such a big impact, but we're really grateful that it did.\" His co-writer Jack Thorne paid tribute to the show's young cast, telling them: \"You are the flame that proved young people are going to be OK.\" Earlier in the weekend, actor Jake Gyllenhaal surprised Cooper during an interview, after the young actor previously described him as his hero. In a clip that went viral on social media, Gyllenhaal gave Cooper the \"lucky duck\" which had originally been given to him when he was nominated for an Oscar. Watch: Owen Cooper's co-stars on his Adolescence audition and being in the spotlight so young (April 2025) The Studio breaks comedy record Other winners at the Emmys included Hollywood satire The Studio , which won several of the major comedy categories, including best actor for its star and creator Seth Rogen . The actor joked: \"I couldn't wrap my head around this happening, so I've prepared nothing. \"I never won anything in my life. When I was a kid I bought a used bowling trophy at an estate sale. This is really just so lovely.\" The Studio broke the record for the most wins by a comedy for a single series, winning…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "watch-the-winning-speeches-in-two-minutes",
    "title": "Watch: The winning speeches - in two minutes",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Watch: Key winning moments from the 77th Emmy Awards Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Irelan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/83ae/live/3b4b4a00-920f-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Watch: Key winning moments from the 77th Emmy Awards Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Watch: Winning moments from the 77th Emmy Awards The 77th Primetime Emmy Awards have taken place in Los Angeles on Sunday night, with shows The Studio, The Pit and Adolescence dominating the awards. Owen Cooper became the youngest ever male Emmy winner at 15-years-old, for his breakout role in the Netflix miniseries Adolescence. Seth Rogan's comedy series The Studio scooped up four Emmys, while The Pitt beat out the likes of Severance and The White Lotus to win Best Drama. 6 hours ago Emmy Awards United States Share Save 'No doubt' Russia will cross Nato border if Ukraine falls, former US VP says Former US Vice-President Mike Pence calls for security guarantees in Ukraine to help deliver “just and lasting peace”. 6 Sep 2025 US & Canada Watch: What's in the 'missing minute' of Epstein's jail video? The US House Oversight Committee has released new surveillance footage recorded hours before the convicted paedophile's death. 5 Sep 2025 US & Canada Watch: Ex-VP Mike Pence says he has 'great concerns' over Trump's tariffs In an interview with BBC Newsnight, the former vice-president to Donald Trump said he would like to see negotiations to lower the levies. 5 Sep 2025 US & Canada Angola: The notorious prison being used in Trump's immigration crackdown The new detention facility inside the prison is designed to hold more than 400 undocumented immigrants convicted of serious crimes. 5 Sep 2025 US & Canada Watch: Moment teen reels in 'once-in-a-lifetime' huge halibut Jackson Denio, a 13-year-old from New Hampshire, might have set the world record for the largest catch of a halibut fish. 5 Sep 2025 US & Canada UK online speech laws 'not a good thing', says Trump The US president made the remarks during a dinner hosting prominent tech leaders at the White House. 5 Sep 2025 US & Canada Can Trump send National Guard troops to Chicago? Trump has said \"we're going in\", when asked about sending National Guard troops to Chicago, but does he have the power to do this? 4 Sep 2025 US & Canada Watch: Key moments from RFK Jr's heated Senate hearing The US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention. 4 Sep 2025 US & Canada Watch: Epstein accusers speak outside US Capitol The group said they are making their own list of Jeffrey Epstein's associates and called for the release of all files related to the investigation. 3 Sep 2025 US & Canada Wildfire ravages historic California gold rush town destroying homes A fast-moving wildfire scorched the historic gold rush town of Chinese Camp destroying at least five homes and prompting evacuations. 3 Sep 2025 US & Canada Watch: Fountains of lava shoot into the air as Kilauea erupts The molten magma streamed down one of the world’s most active volcanoes and put on another fiery show on the Island of Hawaii. 3 Sep 2025 US & Canada 'I would feel more worried' - Chicagoans on Trump's plan to deploy troops President Donald Trump says he will send the National Guard to Chicago to help fight crime but has not specified when that could occur. 3 Sep 2025 US & Canada Watch: Moment police device breaks off fleeing car's rear axle Officers in Michigan were responding to reports of a stolen vehicle, when they deployed a grappler device around one of the car's tires. 2 Sep 2025 US & Canada Trump addresses online health rumours in Oval Office In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend. 2 Sep 2025 US & Canada 'We love you, you will always be with us', says father of Minneapolis shooting victim Fletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis. 28 Aug 2025 US & Canada Watch: Timelapse shows massive clouds of smoke from California wildfire The Garnet wildfire in Fresno County has scorched nearly 14,000 acres (5,665 hectares) and remains uncontained. 28 Aug 2025 US & Canada Watch: BBC interviews man who helped rescue children from gunfire The BBC's Tom Bateman spoke with Patrick Scallen who lives near the Annunciation Church and ran towards the sound of gunfire. 28 Aug 2025 US & Canada Watch: Moment pilot is rescued after emergency water landing New drone video shows rescuers rushing to the small plane off the coast of North Carolina and extracting the pilot in less than 30 seconds. 28 Aug 2025 US & Canada Watch: How the Catholic school shooting unfolded in Minneapolis Two children, aged eight and 10, have been killed and 17 other people injured following a shooting during Mass. 27 Aug 2025 US & Canada Watch: SpaceX Starship completes successful test flight Elon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "everybody-wants-to-know-what-s-going-to-happen-summer-i-turned-pretty-",
    "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The Summer I Turned Pretty actress on secrecy around Amazon hit Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Englan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5109/live/c5452270-9157-11f0-9223-171c11f85051.jpg",
    "source": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>The Summer I Turned Pretty actress on secrecy around Amazon hit Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The secrets began before I even auditioned, says The Summer I Turned Pretty actress 14 hours ago Share Save Lola Schroer BBC News Share Save BBC \"It's lucky me to be a little part of that,\" says Corinna Brown of the show The Summer I Turned Pretty fans are preparing for this week's series three finale - and many are desperate to know how the season will end. The Amazon show has been a breakout hit for young viewers and the tech giant is taking no chances of spoiling the story. For actress Corinna Brown, who plays Gemma, the secrecy began before she even auditioned. \"There were codenames galore,\" she remembers. \"There was a codename for the title of the show, there was a codename for my character. \"I thought up until maybe two days before we started shooting that my character was called Maeve. \"Amazon are very good at keeping it a secret.\" So keen are producers to prevent spoilers, BBC News is speaking to Brown under the condition she doesn't discuss the finale, which drops on Prime Video on Wednesday. Warning: The below may contain spoilers - especially if you haven't watched series three of the show Millions are gripped by the show's love triangle plot between Isabel 'Belly' Conklin, played by Lola Tung, and brothers Conrad and Jeremiah Fisher, played by Christopher Briney and Gavin Casalegno. Among the obsessions for fans have been a tiny engagement ring, a two-tier mirror glaze dark chocolate cake with raspberries and that sensual peach scene. Brown's character Gemma is one of Belly's new friends she meets after her move to Paris. So what was it like to be part of a cultural phenomenon? \"It was so exciting because it's so highly anticipated and everybody wants to know what's going to happen,\" London-born Brown, 26, says. \"The fan base are so passionate, which is something you don't always get.\" She says she \"didn't really realise\" how big the fandom of the show was until its release. \"So I think that was a good thing, to be fair, because otherwise, from the beginning, I would have been like: 'Oh my God'.\" 'We all love a bit of romance' As the show's Paris-era was unlocked, viewers have been introduced to a new supporting cast in Belly's circle in the French capital, including Gemma, who like Belly, is new to Paris. Brown describes her character as a \"kindred spirit\" to Belly. They meet outside a nightclub, when Gemma is being bothered by a man. Belly steps in to help her out and the two become friends. Brown says it is one of her favourite moments and shows \"women supporting each other\". Getty Images Gavin Casalegno, Lola Tung and Christopher Briney are the lead actors in the show According to Amazon, this season's first episode drew in 25 million global viewers, a 40% increase on the previous season, with Prime Video saying it is its most-watched TV season among women aged 18-34. Brown thinks the success of the show comes down to the writing by Jenny Han, who wrote the young adult (YA) romance books the TV series is based on. \"She knows what she's doing. She's got everybody hooked from the books,\" Brown says. \"It's lucky me to be a little part of that.\" Brown feels another reason why the show resonates is \"because we all go through it\". \"We go through friendship, heartache, love, confusion. For the audience that watch this show and love The Summer I Turned Pretty that is a big thing, it's a new thing, it forms so much of your life. \"Being able to watch someone's else experience of that is helpful... and we all love a bit of romance,\" she says. Beyond the traditional audience watching on screens, there are countless fan edits and reaction videos posted on social media, which Corinna says have been positive towards her character. \"They've been lovely. I've only seen good things. They say they like Gemma giving her [Belly] straight advice.\" Prime Video According to Amazon, this season's first episode drew in 25 million global viewers Already beloved by YA fans for her turn as Tara Jones in Netflix-hit Heartstopper, Brown is no stranger to the world of teen romance adaptations. \"With any show that's for a young audience, you have to have that awareness of the young minds that you're inspiring, shaping,\" Brown says. \"And that's an honour in itself.\" Amid all the buzz of the show, secrets are tightly guarded and with the finale about to drop we are not allowed to ask Brown what happens in it. But we can't help but ask what feels to fans like the summer's most pressing question: Are you team Conrad or team Jeremiah? \"I'm going to keep my lips tight on that one,\" Brown says, smiling. \"But what I will say is I am Team Gemma and Team Belly's friendship…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "strictly-star-dani-dyer-on-why-she-d-like-to-pull-dad-danny-up-on-the-",
    "title": "Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Strictly stars on sexy costumes, the Strictly curse and feeling 'overwhelmed' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0316/live/fd5726f0-8efe-11f0-ad1d-477615c292d0.jpg",
    "source": "https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Strictly stars on sexy costumes, the Strictly curse and feeling 'overwhelmed' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor 7 hours ago Share Save Emma Saunders Culture reporter Share Save PA Media Dyer notes this is \"one of the biggest show's I've done since Love Island\" in 2018 It's that time again. The nights are drawing in, the tans are fading and we all need a bit of sparkle in our lives as we head into autumn. Never fear, Strictly Come Dancing is back with its 23rd series, with 15 new contestants ready to dust off their dancing shoes. Following last year's controversies relating to the behaviour of some professional dancers , plus a recently launched investigation into alleged drug use by two of the show's stars and an unnamed star being arrested on suspicion of rape (it is understood the development is not related to the upcoming series), BBC bosses will be keen for fans and media to return to talking about the show itself. With that in mind, the press gathered for an annual event which gives journalists a chance to speak to all the contestants ahead of the show launch (well, almost all, more on that later). Here's all the behind-the-scenes gossip we found out from the likes of Dani Dyer, Vicky Pattison and Jimmy Floyd Hasselbaink. This year's Strictly contestants are glammed up and ready to go On being 'Strictified' One of the big attractions for most celebrity contestants on the show is the chance to glam up to the max every Saturday night. Former Love Island star Dani Dyer says she's game for any dance costume. \"I can't wait to be a bit sexy, I've been a mum... my oldest is four... am I sexy?,\" she giggles. \"On Love Island I never wore the thong bikinis and now I'm like 'Why didn't I do that?\" Dani in a carnival thong number for the samba? You heard it here first. La Voix says: \"The main reason we're doing this is it's like a free bootcamp!\" La Voix, who competed in the 2024 series of RuPaul's Drag Race UK, arrives at the press event in full make-up with trademark coiffured hair-do. How on earth can you \"Strictify\" a drag performer? \"I might be the only one that dresses down on a live show! I want the full Strictly experience. They're going to take it to the next level. They have already – I've been lucky enough to have seen my first dress. \"The glamour is wonderful, I feel like I'm living my dream. I don't want to do the dancing, just the dressing up bit!\" Keeping control of the nerves Vicky Pattison first found fame on reality show Geordie Shore Former Geordie Shore star and podcast host Vicky Pattison has always been very open about her struggles with anxiety, recently revealing on her podcast Get A Grip that she had gone back to therapy to deal with Strictly nerves. \"Everyone's handling me with kid gloves at the moment, I keep getting loads of cuddles off everyone. \"I'm scared, a little bit overwhelmed. I think it's because I've wanted to do this show for so long, I'm a big fan. I'm desperate to make the most of it... but I'm worried I'll get in my own head.\" But support from the likes of former contestants Pete Wicks and her podcast co-host Angela Scanlon is helping. \"With Pete, our careers, there's a lot of parallels, we both come from reality TV and there's this common misconception that we're not very talented or capable of anything. I would really like to change that narrative. Pete just said be yourself. \"I just need to get a handle on myself and put my big girl pants on. I'll kick myself if I'm in my own head the whole time and I don't enjoy it. I think I'm putting a lot of pressure on myself.\" Social media star George Clarke says the nerves haven't hit him - yet. \"I don't really get nervous until it's just about to happen, which is nice, until it's just about to happen! Nice build-up and then a breakdown in the dressing room!\" Model, actress and influencer Ellie Goldstein says she's \"excited and nervous but nerves are good. I'm so competitive, I want to win!\" And Dani's famous dad Danny Dyer will be cheering her on. \"Dad is so excited for me, he loves the show. He came to support when Rose Ayling Ellis (his on-screen daughter in EastEnders) was doing it and it was emotional then. He loves a dance himself. I should get him up!\" The Strictly curse PA Media Jimmy Floyd Hasselbaink played for teams such as Chelsea and Leeds and the Netherlands national team and has managed clubs including QPR and Northampton Town None of the contestants seemed bothered about the so-called Strictly curse, which refers to several former contestants who were already in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  },
  {
    "slug": "my-wife-died-giving-birth-after-trump-cut-funding-to-our-clinic",
    "title": "'My wife died giving birth after Trump cut funding to our clinic'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "BBC investigates Afghan maternal deaths after US aid cuts Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. I…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d10a/live/fec88e30-8fe3-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>BBC investigates Afghan maternal deaths after US aid cuts Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live 'My wife died giving birth after Trump cut funding to our clinic' 16 hours ago Share Save Yogita Limaye South Asia and Afghanistan correspondent Share Save Aakriti Thapar / BBC When Shahnaz went into labour, her husband Abdul called a taxi to take them to the only medical facility accessible to them. \"She was in a lot pain,\" he says. A 20-minute drive away, the clinic was in Shesh Pol village in Afghanistan's north-eastern Badakhshan province. It was where their two older children were born. Abdul sat next to Shahnaz comforting her as they drove over gravel tracks to reach help. \"But when we reached the clinic, we saw that it was closed. I didn't know it had shut down,\" he said, his face crumpling with agony. Warning: Readers may find some details in this article distressing. The clinic in Shesh Pol is one of more than 400 medical facilities that closed down in Afghanistan, one of the world's poorest countries, after the Trump administration cut nearly all US aid to the country earlier this year, in a drastic and abrupt move following the dismantling of the US Agency for International Development (USAID). A single-storey structure with four small rooms, white paint peeling off its walls, the Shesh Pol clinic has USAID posters tacked up everywhere with information and guidance for pregnant women and new mothers. Aakriti Thapar / BBC Shesh Pol maternity clinic is one of hundreds of medical facilities forced to close as a result of US aid cuts in Afghanistan It doesn't look like much but in Badakhshan's mountainous, unforgiving terrain, where a lack of access has been a major reason for historically high maternal mortality rates, the clinic was a critical lifeline, part of a wider programme implemented during the tenure of the US-backed government in the country, to reduce maternal and newborn deaths. It had a trained midwife who assisted around 25-30 deliveries every month. It had a stock of medicines and injections, and it also provided basic healthcare services. Other medical facilities are simply too far from Abdul's village, and it was not without risk for Shahnaz to travel on bumpy roads. Abdul also didn't have money to pay for a longer journey - renting the taxi cost 1,000 Afghani ($14.65; £12.70), roughly a quarter of his monthly income as a labourer. So they decided to return home. \"But the baby was coming and we had to stop by the side of the road,\" Abdul said. Shahnaz delivered their baby girl in the car. Shortly after, she died, bleeding profusely. A few hours later, before she could be named, their baby also died. Aakriti Thapar / BBC Abdul spoke to the BBC about the traumatic deaths of his wife and newborn baby, who are buried in Shesh Pol \"I wept and screamed. My wife and child could've been saved if the clinic was open,\" said Abdul. \"We had a hard life, but we were living it together. I was always happy when I was with her.\" He doesn't even have a photo of Shahnaz to hold on to. There's no certainty the mother and baby would've survived if they'd been treated at the clinic, but without it, they didn't stand a chance, underlining the undeniable impact of US aid cuts in Afghanistan. For decades, America has been the largest donor to Afghanistan, and in 2024, US funds made up a staggering 43% of all aid coming into the country. The Trump administration has justified withdrawing it, saying there were \"credible and longstanding concerns that funding was benefiting terrorist groups, including... the Taliban\", who govern the country. The US government further added that they had reports stating that at least $11m were \"being siphoned or enriching the Taliban\". The report that the US State Department referenced was made by the Special Inspector General for Afghanistan Reconstruction (SIGAR). It said that $10.9m of US taxpayer money had been paid to the Taliban-controlled government by partners of USAID in \"taxes, fees, duties, or utilities\". The Taliban government denies that aid money was going into their hands. \"This allegation is not true. The aid is given to the UN, and through them to NGOs in provinces. They identify who needs the aid, and they distribute it themselves. The government is not involved,\" said Suhail Shaheen, the head of the Taliban's political office in Doha. BBC visits closed down US-backed clinic in Afghanistan after aid cuts The Taliban government's policies, especially its restrictions on women, the harshest in the world, have meant that after four years in power, it is still not recognised by most of the world. It's also a key reason donors have been increasingly walking away from the country. The US insists no one has died because of aid cuts. Shahnaz and her baby's deaths are not recorded anywhere. Neither are countless others. The BBC has documented at least half a dozen first-hand, devastating accounts…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>",
    "rights": "BBC News"
  }
]
