[
  {
    "slug": "uk-and-us-unveil-nuclear-energy-deal-ahead-of-trump-visit",
    "title": "UK and US unveil nuclear energy deal ahead of Trump visit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg",
    "source": "https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>UK and US unveil nuclear energy deal ahead of Trump visit</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b16a/live/2adbb5f0-9201-11f0-a4c2-47171ae8fffb.jpg.webp\" alt=\"Getty Images An engineer with a fuel rod handling machine in a nuclear power station\"/>\n    <p>The UK and US are set to sign an agreement focused on accelerating the development of nuclear power.</p>\n    <p>The agreement aims to generate thousands of jobs and strengthen Britain's energy security.</p>\n    <p>It is expected to be signed off during US President Donald Trump's state visit this week, with both sides hoping it will unlock billions in private investment.</p>\n    <p>However, the designs behind some of the deals are relatively new and it could take many years before the nuclear projects generate energy for homes and businesses.</p>\n    <p>The key focus of the so-called Atlantic Partnership for Advanced Nuclear Energy is to make it quicker for companies to build new nuclear power stations in both the UK and the US.</p>\n    <p>The hope is to halve the time it takes to gain regulatory approval for nuclear projects from up to four years to two.</p>\n    <p>In practice, it means that if a reactor has already passed safety checks in one country, that work can be used to support the work of the other.</p>\n    <p>The UK's nuclear programme already includes plans for small modular reactors (SMRs), which are a scaled-down version of larger plants. Britain's engineering firm Rolls Royce has been selected to design and build the first in the country.</p>\n    <p>One of the commercial deals set to be signed this week is with US nuclear group X-Energy and the UK's Centrica, which owns British Gas, to build up to 12 advanced modular reactors (AMRs) in Hartlepool.</p>\n    <p>Unlike SMRs, which are water-cooled nuclear reactors, advanced modular reactors use gases such as helium as a coolant.</p>\n    <p>There are very few AMRs in the world operating on a commercial basis such as China's HTR-PM reactor.</p>\n    <p>X-Energy wants to build one in the US but, after announcing a partnership with US chemicals and plastics giant Dow in 2021, it has taken until March this year to submit a construction permit application to the Nuclear Regulatory Commission for the project in Texas.</p>\n    <p>X-Energy has said it hopes the reactor at a Dow site could be a blueprint for others and \"manufacturers worldwide could replicate this model\".</p>\n    <p>The government said the Hartlepool deal has the potential to power 1.5 million homes and create up to 2,500 jobs.</p>\n    <p>Energy Secretary Ed Miliband said: \"Nuclear will power our homes with clean, homegrown energy and the private sector is building it in Britain, delivering growth and well-paid, skilled jobs for working people.\"</p>\n    <p>But Greenpeace questioned the UK's focus on nuclear power.</p>\n    <p>\"If these proposals for new reactors scattered around Britain really materialise, the net effect will be higher bills from nuclear's relentlessly spiralling costs, and more CO2 as we wait for the builders to overcome their inevitable construction delays,\" said Dr Douglas Parr, chief scientist for Greenpeace UK.</p>\n    <p>The cost of building large nuclear plants in the UK, such as Sizewell C in Suffolk, has jumped to £38bn from a previous estimate of £20bn. Centrica is one of the key investors in Sizewell C.</p>\n    <p>SMRs work on the same principle as large reactors, using a nuclear reaction to generate heat that produces electricity, but have around a third of the generating output.</p>\n    <p>The modular element means they could be built to order in factories - as a kit of parts - then transported and fitted together, like a flat-packed power station.</p>\n    <p>However, the SMR industry is still young, and many different designs are being investigated.</p>\n    <p>Centrica's chief executive Chris O'Shea told the BBC's Today programme that increased costs and delays \"can happen in all large projects\".</p>\n    <p>But he said: \"What you need to do is you need to do more than just one every 20 years in order to get better. So, the more you practice, the better you get which is why small and advanced modular reactors are particularly interesting because they'll be repetitive so you'll produce the same thing over and over again.</p>\n    <p>\"That should bring improvements both in terms of cost and schedule and reliability and cost as well.\"</p>\n    <p>Prime Minister Sir Keir Starmer has previously said he wants the UK to return <a href=\"https://www.bbc.co.uk/news/articles/c805mjxe2y9o\">to being \"one of the world leaders on nuclear\"</a>.</p>\n    <p>In the 1990s, nuclear power generated about 25% of the UK's electricity but that figure has fallen to around 15%, with no new power stations built since then and many of the country's ageing reactors due to be decommissioned over the next decade.</p>\n    <p>In November 2024, the UK and 30 other countries signed a global pledge to triple their nuclear capacity by 2050.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgzevzwxwro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "charges-dropped-against-two-men-accused-of-spying-for-china",
    "title": "Charges dropped against two men accused of spying for China",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Charges dropped against two men accused of spying for China</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c8b9/live/fe9d1660-921d-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"AFP/GETTY Split picture showing the faces of Christopher Cash and Christopher Berry.\"/>\n    <p>Prosecutors have dropped charges against two men, including a former parliamentary researcher, who had been accused of spying for China.</p>\n    <p>Christopher Cash, 30, and Christopher Berry, 33, had previously denied the charges under the Official Secrets Act. Beijing has called the allegations \"malicious slander\".</p>\n    <p>The two men were accused of gathering and providing information prejudicial to the safety and interests of the state between 28 December 2021 and 3 February 2023.</p>\n    <p>Speaking outside the Old Bailey following the decision to cease legal proceedings on Monday, Mr Cash said he was \"relieved that justice has been served\".</p>\n    <p>He described the two years since his arrest as a \"nightmare\" and said he hoped \"lessons are learned from this sorry episode\".</p>\n    <p>Prosecutor Tom Little told the the court that his team would offer no evidence against the men and that \"we simply cannot continue to prosecute this case\".</p>\n    <p>The court heard that the Crown Prosecution Service had determined the evidence it had gathered did not meet the threshold to go to trial.<strong> </strong>The pair were due to appear at Woolwich Crown Court from 6 October.</p>\n    <p>The Home Office said it was \"disappointing that they will not face trial given the seriousness of the allegations\".</p>\n    <p>\"We will continue to use the full range of tools and powers to guard against malign activity,\" it added in a statement.</p>\n    <p>Mr Berry, a teacher from Witney in Oxfordshire, and Mr Cash, of Whitechapel in London, were arrested in March 2023 as part of an investigation that involved counter-terror police.</p>\n    <p>They were accused of collecting information which was \"calculated to be, might be, or were intended to be, directly or indirectly, useful to an enemy\".</p>\n    <p>It had been reported that Mr Cash was involved with Parliament's China Research Group (CRG).</p>\n    <p>He was understood to have had access to several Conservative MPs, reportedly including former security minister Tom Tugendhat and then-foreign affairs committee chairwoman Alicia Kearns.</p>\n    <p>Defending Mr Cash, Henry Blaxland KC said his client's colleagues at the CRG had \"expressed disbelief\" at his arrest.</p>\n    <p>\"We only hope that he will be able to rebuild his life,\" he added.</p>\n    <p>Mrs Justice Cheema-Grubb said she was \"quite satisfied\" and entered the two men into not guilty verdicts.</p>\n    <p>When they were charged, a Chinese embassy spokesperson said \"the claim that China is suspected of 'stealing British intelligence' is completely fabricated\".</p>\n    <p>They urged the UK \"to stop anti-China political manipulation and stop putting on such a self-staged political farce\".</p>\n    <p>The government has previously said Chinese spies were targeting UK officials across the political, defence and business sectors as part of an increasingly sophisticated espionage operation.</p>\n    <p>In December, senior judges <a href=\"https://www.bbc.co.uk/news/articles/cp9n4211zn3o\">upheld a decision</a> by MI5 to warn that an alleged Chinese agent, Christine Lee, had infiltrated Parliament and funded a Labour MP, among others.</p>\n    <p>The same month, Yang Tengbo was named as a Chinese businessman who had been banned from the UK for allegedly spying.</p>\n    <p>Both Ms Lee and Mr Yang have denied the accusations made against them.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cpd94le39e7o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "fourteen-nhs-trusts-maternity-care-to-be-investigated-over-failures",
    "title": "Fourteen NHS trusts' maternity care to be investigated over 'failures'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d206/live/2b7512f0-9205-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Fourteen NHS trusts are to have their maternity services examined over what has been described as \"failures in the system\", the government has said.</p>\n<p>The inquiries are part of a rapid review of maternity care in England that was announced in June.</p>\n<p>Health Secretary Wes Streeting said bereaved families had shown \"extraordinary courage\" in coming forward with issues dating back more than 15 years.</p>\n<p>Some of the families have severely criticised the review and Streeting's handling of it, describing the investigation as \"not fit for purpose\".</p>\n<p>The NHS trusts that will be examined are:</p>\n<ul>\n      <li>Blackpool Teaching Hospitals</li>\n      <li>Bradford Teaching Hospitals</li>\n      <li>University Hospitals of Leicester</li>\n      <li>Leeds Teaching Hospitals</li>\n      <li>Sandwell and West Birmingham</li>\n      <li>Gloucestershire Hospitals</li>\n      <li>Yeovil District Hospital</li>\n      <li>Oxford University Hospital</li>\n      <li>University Hospitals Sussex</li>\n      <li>Barking, Havering and Redbridge University Hospitals</li>\n      <li>Queen Elizabeth, Kings Lynn</li>\n      <li>University Hospitals of Morecambe Bay</li>\n      <li>East Kent Hospitals</li>\n      <li>Shrewsbury and Telford Hospital</li>\n    </ul>\n<p>Baroness Amos, who will chair the review, said she was committed to ensuring families affected by maternity care failures were heard and that the 14 investigations would lead to improvements nationwide.</p>\n<p>She told BBC Radio 4's Today programme that she hoped the review would help families \"get the justice that they want and that they deserve\".</p>\n<p>She added that the current situation - in which trusts had been investigated already and \"hundreds\" of recommendations made, yet fresh reviews were required - was \"completely unacceptable\".</p>\n<p>Improved maternity care may have prevented the deaths of over 800 babies lives in 2022-23, according to research by the baby loss charities Sands and Tommy's.</p>\n<p>Streeting opted for the rapid review instead of a national inquiry into maternity care, which many families have been calling for.</p>\n<p>The review was due to be completed by December, but will now not report until Spring 2026. Baroness Amos says she will aim to produce interim findings around Christmas.</p>\n<p>The review will examine the experience of families and staff within England's struggling maternity services and investigate why the recommendations from previous maternity inquiries in Morecambe Bay, East Kent, and Shrewsbury and Telford have not led to sustained improvements.</p>\n<p>Past inquiries have revealed issues including ignoring women's voices, poor leadership, a failure to learn from safety incidents and a toxic culture. Yet families are still repeatedly reporting substandard care.</p>\n<p>There will also be \"particular attention\" paid to examining why black and Asian families have noticeably poorer outcomes, Baroness Amos said.</p>\n<p>The Department of Health said the trusts had been chosen based on data analysis and the views of families, as well as to ensure a geographical and demographic mix.</p>\n<p>The Royal College of Obstetricians and Gynaecologists said the focus on these trusts would \"create real anxiety among women, families and staff\" at the 14 trusts.</p>\n<p>It added that the review would need to re-build a world class maternity system.</p>\n<p>\"Too many women and babies are not getting the safe, compassionate care they deserve and the maternity workforce is on its knees, with staff leaving the profession,\" said the college's president, Prof Ranee Thakar.</p>\n<p>The strongest criticism of the review, however, comes from the Maternity Safety Alliance (MSA) - a group of families harmed by poor maternity care in several NHS trusts across England.</p>\n<p>Having engaged in a number of meetings with the Department of Health in recent weeks, they said Streeting had \"broken promises\" over how the investigation would be run and what it would examine, and that they had been left feeling \"used\".</p>\n<p>They are particularly critical of the decision not to investigate the role of NHS regulators, such as the Care Quality Commission and NHS Resolution, the health service's insurance and litigation arm.</p>\n<p>\"The review seems to have already decided that all the responsibility for these 800 deaths a year lies squarely with NHS trusts and the clinicians who work in them,\" said Tom Hender, who lost his son Aubrey in 2022.</p>\n<p>\"That's just not true - the whole system is in crisis and we need a whole system approach.\"</p>\n<p>The MSA said the investigation was \"not fit for purpose\" and will not achieve what Streeting said it would, adding: \"It is clear that only a statutory public inquiry can end the crisis in maternity care.\"</p>\n<p>Baroness Amos said the terms of the review were extensive given its time frame and that regulatory bodies were \"not excluded\", but added: \"The kind of in-depth review that is being requested is not something that I am able to conduct.\"</p>\n<p>The two families who successfully campaigned for an investigation into maternity care in Shrewsbury and Telford are more positive about the review, describing it as \"an important and brave first step\".</p>\n<p>But the parents of Kate Stanton-Davies and Pippa Griffiths also said it would be \"safer\" if the review proceeded at a slower pace, adding that proper mental health support had to be provided to those families sharing their experiences.</p>\n<p>\"It's not enough to have a nominal support figure in the room and an email address for follow-up,\" they said in a statement.</p>\n<p>The ongoing challenges facing maternity services were highlighted last week.</p>\n<p>On Monday, a review of care at Gloucestershire Hospitals NHS trust found that the deaths of <a href=\"https://www.bbc.co.uk/news/articles/c3rvqd7v52ro\">nine babies</a> between 2020 and 2023 could have been prevented.  </p>\n<p>Then on Friday, a report found that NHS trusts rated over half their maternity and neonatal buildings as being unsatisfactory, with 7% saying they ran a serious risk of imminent breakdown.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckg6xj1vz70o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "bloody-sunday-deaths-unnecessary-and-gratuitous-court-told",
    "title": "Bloody Sunday deaths 'unnecessary and gratuitous', court told",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The shooting dead of two men on Bloody Sunday was \"unnecessary and gratuitous\", the trial of a former British soldier has been told.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9cc/live/d57e7c70-299f-11ef-b3b8-ed2dd2d12607.jpg",
    "source": "https://www.bbc.com/news/articles/c79v8lddx0no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>The shooting dead of two men on Bloody Sunday was \"unnecessary and gratuitous\", the trial of a former British soldier has been told.</p>\n<p>Soldier F is accused of murdering James Wray, 22, and William McKinney, 26, as well as five counts of attempted murder in 1972.</p>\n<p>Thirteen people were shot dead by the Parachute Regiment when it opened fire on civil rights demonstrators in the Bogside area of Londonderry. About 15 others were wounded.</p>\n<p>The non-jury trial is taking place at Belfast Crown Court, where Soldier F is screened from public view by a black curtain around part of the dock.</p>\n<p>The former paratrooper, whose identity remains protected by a court order, has entered pleas of not guilty.</p>\n<p>He also denies the five counts of attempted murder.</p>\n<p>Soldier F is further accused of attempting to murder Patrick O'Donnell, Joseph Friel, Joe Mahon, Michael Quinn and an unknown person.</p>\n<p>Three of those he allegedly wounded will testify during the trial.</p>\n<h2>'Unjustified'</h2>\n<p>Prosecution lawyer Louis Mably KC said the shootings were \"unjustified\" and none of the victims posed any threat.</p>\n<p>\"They were unarmed and shot as they ran away.\"</p>\n<p>Mr Mably went on to allege that the soldiers who fired, including Soldier F, then gave a false account of what had happened.</p>\n<p>\"What they did was to falsely claims that the civilians they targeted were armed.</p>\n<p>\"It was demonstrably false.\"</p>\n<p>Mr Mably told the court Bloody Sunday had had a \"long lasting and profound effect\" on Northern Ireland.</p>\n<p>He said the trial would have a narrow and specific focus on events that took place in a courtyard in the Glenfada Park area of Derry's Bogside.</p>\n<p>Soldier F, he said, was \"part of a small group of soldiers who moved west from Rossville Street into that courtyard\".</p>\n<p>That group of soldiers, he added, opened fire \"with their self-loading rifles shooting at the civilians as they ran away\".</p>\n<p>\"And the result was the casualties that I've described, two deaths and four men wounded.\"</p>\n<p>He said the civilians in the courtyard were unarmed and \"did not pose a threat to the soldiers and nor could the soldiers have believed that they did\".</p>\n<p>The soldiers' statements would be subject to a hearsay application on Wednesday that would determine their admissibility, Mr Mably said.</p>\n<p>That hearing, he said, is the first \"substantive matter\" in the case.</p>\n<h2>'Disgraced British army'</h2>\n<p>Setting out the circumstances of the shootings in the courtyard at Glenfada Park, Mr Mably told the court those who had been shot had been hit in the back or side, as they headed towards an exit onto Abbey Street.</p>\n<p>The soldiers, who he described as \"unprofessional\", had lost control of themselves, he said.</p>\n<p>\"Shooting people as they ran away... an act which disgraced the British army,\" he said.</p>\n<p>Families and friends of those killed on Bloody Sunday as well as scores of supporters took part in a walk to the Royal Courts of Justice in Belfast on Monday, ahead of the opening of the trial.</p>\n<p>Those at the front of march carried a large banner saying: \"Towards Justice\".</p>\n<p>Tony Doherty, chair of the Bloody Sunday Trust, said: \"This day is a tribute to the strength of the families, whose indefatigable campaign for justice has made this happen.\"</p>\n<p>Speaking on behalf of the McKinney family before entering the court, John McKinney said it marked \"a momentous day in our battle to secure justice for our loved ones\".</p>\n<p>He said families had battled \"against the odds\" to get here.</p>\n<p>\"We will shortly occupy the courtroom with our heads held high and with the knowledge that regardless of the ultimate outcome that we are on the right side of history,\" he said.</p>\n<h2>Legacy process</h2>\n<p>Northern Ireland veterans commissioner David Johnstone claimed former soldiers were being subjected to \"wholesale demonisation\" as a result of the legacy process in Northern Ireland.</p>\n<p>Johnstone called for \"a fair and balanced\" legacy process.</p>\n<p>\"The vast majority, and this is important, the vast, vast majority of nearly 300,000 Armed Forces that served here in Northern Ireland during Op Banner (Operation Banner), did so with dignity, with restraint and with professionalism, working to protect communities and to prevent civil war here in this province,\" he said.</p>\n<p>He added that \"the stories of soldiers murdered by terrorists receive little media attention, and there's certainly no prospect of a public inquiry into their deaths\".</p>\n<p>Also speaking outside the court, TUV leader Jim Allister said he had stopped off on his way to London to \"show his support\" for veterans.</p>\n<p>The decision to charge Soldier F was taken by the Public Prosecution Service (PPS) in 2019.</p>\n<p>He was one of 18 former soldiers reported to the PPS as a result of a police investigation, which followed the public inquiry into Bloody Sunday conducted by Lord Saville.</p>\n<p>But he was the only one charged.</p>\n<p>Two years later, the PPS dropped the case after the collapse of the trial of two other veterans who had been accused of a 1972 murder in Belfast.</p>\n<p>But the prosecution resumed in 2022 after a legal challenge.</p>\n<p>The key evidence in the Soldier F case is statements given by other soldiers at the time of Bloody Sunday.</p>\n<p>The trial judge is likely to decide at an early stage if they are admissible.</p>\n<h2>Who is Soldier F?</h2>\n<ul>\n      <li>A former British soldier who served with the Army's Parachute Regiment in Northern Ireland during the Troubles</li>\n    </ul>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c79v8lddx0no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "killer-child-car-seats-still-on-sale-10-years-on",
    "title": "'Killer' child car seats still on sale 10 years on",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>'Killer' child car seats still on sale 10 years on</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4187/live/6d25a890-8fc1-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"BBC Two unidentifiable people holding a child's car seat each. One on the left is orange and the other is blue. The seats are made of thin padded fabric without structure.\"/>\n    <p>Lethal children's car seats are still appearing for sale on online marketplaces a decade after concerns were first raised by trading standards officers and a well-known consumer group.</p>\n    <p>Which? warned in 2014 the fabric seats were potentially dangerous to children due to safety defects and were illegal to use in the UK following tests by Surrey Trading Standards, which dubbed the products \"killers\".</p>\n    <p>Which? is urging parents not to be tempted into buying cheap seats after it found they are still being sold via online sites including Shein and eBay, both of which said they took safety very seriously.</p>\n    <p>Regulations state only EU-approved child car seats with R44 or R129 codes can be used in the UK.</p>\n    <p>Approved seats carry a clear orange label, on which the codes are printed, to indicate they have been put through EU safety testing and can therefore be legally sold on the UK market.</p>\n    <p>In 2014, Surrey Trading Standards tested a fabric seat which fell to pieces in a 30 mph accident. The crash test dummy of a three-year-old child was flung through the windscreen when the straps securing the seat failed.</p>\n    <p>Which? said families struggling with living costs could be tempted by the cheaper products, which cost as little as £12.50, compared to the more expensive ones that retail in excess of £80.</p>\n    <p>Stuart Howarth, a car seat safety advisor at Good Egg Safety, which campaigns on child safety, told BBC News he had seen a child using an unsafe seat that had \"no support to the body\" and \"no way of securing it to the car safely\".</p>\n    <p>\"It's just a lethal piece of material,\" he said.</p>\n    <p>\"You might as well just sit on a settee cushion and hope for the best.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7529/live/a7c0b5d0-8fc1-11f0-84c8-99de564f0440.jpg.webp\" alt=\"A rectangular orange label on a child's booster seat.\"/>\n    <p>Which? said it found more than a dozen listings of illegal car seats on websites such as eBay, Little Dreams, ManoMano, Shein and Wish.</p>\n    <p>One listing for a child's car seat on eBay warned against using it in cars despite the product being described as suitable.</p>\n    <p>The description in the listing read: \"It is best not to use it on high-speed cars.</p>\n    <p>\"We recommend that it be used in non-motorized products such as electric vehicles, two-wheelers... Because it is not a child safety seat that complies with traffic.\"</p>\n    <p>In response, eBay said consumer safety \"is a top priority\".</p>\n    <p>\"eBay swiftly removed the listings reported by Which? and the BBC and notified buyers,\" a spokesperson said</p>\n    <p>\"We have updated our existing measures accordingly and remain committed to preventing unsafe products from appearing on the site.\"</p>\n    <p>Which? said stricter rules were needed to \"impose a clear and robust duty on online marketplaces to prevent the sale of unsafe products\" and called for \"strong penalties and rigorous enforcement\".</p>\n    <p>Sue Davies, Which? head of consumer protection policy, said: \"It is appalling that these deadly car seats are reappearing on online marketplaces more than a decade after Which? first exposed them, but it is not surprising.\"</p>\n    <p>She said children's lives \"will be at risk\" until online retailers were forced to comply with product safety regulations.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e554/live/1c3d5cb0-8f04-11f0-84c8-99de564f0440.png.webp\" alt=\"Which? A screenshot of an eBay listing for a child's car seat.\"/>\n    <p>Which? advised families to look for retailers who can provide guidance and help fit the seat.</p>\n    <p>It suggested car seats should not be bought secondhand, as they might have been involved in an accident and damage to the seat may be unclear.</p>\n    <p>Janis James, chief executive of Good Egg Safety, urged parents not to \"skimp\" on cash when purchasing car seats for children.</p>\n    <p>In a statement, Shein said it was committed to \"offering safe and reliable products to its customers\".</p>\n    <p>The online retail giant said the product Which? found listed on its website had been \"mislabelled\" by a third-party seller and Shein had \"taken action against the seller\" after removing it from its platform.</p>\n    <p>It said vendors were required to comply with the company's rules and \"stringent safety standards and must also abide by the relevant laws and regulations of the markets where we operate\".</p>\n    <p>Little Dreams also told the BBC product safety was a \"top priority\".</p>\n    <p>ManoMano said its online marketplace was used by third party sellers to sell their own products.</p>\n    <p>It added: \"We rely on our sellers to provide a resolution to any product/fulfilment issues.\"</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c8643d1p85zo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "strong-winds-sweeping-across-uk-but-why-isn-t-this-storm-amy",
    "title": "Strong winds sweeping across UK - but why isn't this Storm Amy?",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Strong winds sweeping across UK - but why isn't this Storm Amy?</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/3e81/live/da307300-9207-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A windswept-looking woman holds an orange umbrella which has blown inside out with an urban street scene in the background.\"/>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>A Met Office yellow warning for strong winds is in force across the southern half of the UK on Monday as an area of low pressure passes close by.</strong>\n    </p>\n    <p>A gust of 78mph (125km/h) was recorded at Needles, Isle of Wight, on Sunday night with widespread windy conditions expected to continue until the evening.</p>\n    <p>This is causing some travel disruption including the <a href=\"https://www.bbc.com/news/articles/cpvlr98m39do\">closure of the M48 Severn Bridge</a>.</p>\n    <p>However - contrary to some media reports - this weather system is not a named storm.</p>\n    <h2>Yellow wind warning for England and Wales</h2>\n    <p>The Met Office warning covers all of Wales and most of England - away from the far north - and is valid until 1800 on Monday.</p>\n    <p>Wind gusts of 45-55mph (72-89km/h) will continue to affect many inland areas with gusts of 60-70mph (97-113km/h) likely around exposed coasts and over hills.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1800/cpsprodpb/50e1/live/2bf53b40-920c-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A weather map showing the area covered by a yellow warning - all of Wales and most of England, away from the far north. The warning is valid until 18:00 on Monday.\"/>\n    <p>There is a risk of disruption on the roads and at airports, while <a href=\"https://www.nationalrail.co.uk/service-disruptions/poor-weather-20250911/\">Network Rail, external</a> is warning of possible delays on railways.</p>\n    <p>Large waves are expected around the coasts and some power cuts are possible.</p>\n    <p>The weather is expected to calm down during Monday evening as the strongest winds begin to ease.</p>\n    <p>Heavy rain also features with downpours across many northern and western parts of the UK.</p>\n    <h2>Why is this not a named storm?</h2>\n    <p>Some media reports, as well as posts on social media, are suggesting that this is Storm Amy - the first named storm of the UK season.</p>\n    <p>That is not the case.</p>\n    <p>The Met Office <a href=\"https://www.bbc.com/weather/articles/cwy54xllpyno\">names storms</a> in conjunction with the Irish and Dutch weather services based on how significant the impacts are forecast to be.</p>\n    <p>A storm is typically named if it is expected to be bad enough to warrant an amber or red weather warning, and that looks very unlikely this time.</p>\n    <p>When this area of low pressure first appeared on weather charts several days ago it did seem possible that it could be strong enough to be named.</p>\n    <p>However, as the forecast became firmer it looked less and less likely that there would be significant impacts.</p>\n    <p>Storm Amy is going to keep us waiting a while longer.</p>\n    <h2>Will there be a September storm?</h2>\n    <p>The UK had its <a href=\"https://www.bbc.com/weather/articles/c1kz18d3wjro\">hottest summer on record</a> but there is no doubt that the start of meteorological autumn has brought a big change.</p>\n    <p>The <a href=\"https://www.bbc.com/weather/av/54682820\">jet stream</a> has dropped southwards sending wind and rain-bearing weather systems on a beeline for our shores.</p>\n    <p>That has made it a wet September so far, especially in southern and western parts of the country where some places have already recorded more than their average rainfall for the whole month.</p>\n    <p>However, there is no suggestion that <a href=\"https://www.bbc.com/weather/articles/cyvj2lm2p14o\">hosepipe bans</a> and water restrictions will be lifted yet.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/f230/live/a0b35080-9215-11f0-85c7-5bdf6c05d36f.jpg\" alt=\"A row of beach huts with pebbles in front and a large puddle in the foreground, with a blue sky and white clouds overhead\"/>\n    <p>Parts of southern England have already seen one and a half times their typical September rainfall</p>\n    <p>The forecast for this week remains very unsettled.</p>\n    <p>After a calmer Tuesday with sunshine for many, Wednesday is expected to bring heavy rain in many areas.</p>\n    <p>Winds will also strengthen during midweek, particularly in the north of the UK with the chance of gales in northern Scotland by Thursday.</p>\n    <p>There is considerable uncertainty about exactly how this weather system will develop.</p>\n    <p>So while it does not currently look likely that this will be a named storm, it is worth staying in touch with the details on the BBC Weather <a href=\"https://www.bbc.com/weather\">website</a> and <a href=\"https://www.bbc.com/weather/articles/cwy00j3yj4eo\">app</a>.</p>\n    <p>Warmer weather could briefly develop at the end of the week, especially in England and Wales, with possible highs of 24C (75F) in the south-east on Friday.</p>\n    <p>Although northerly winds are expected to develop over the weekend bringing a return of cooler conditions - and probably more rain.</p>\n    <p>Some computer models do suggest a chance of higher pressure and drier weather towards the end of the month but this is by no means certain.</p>\n    <p>As we moved deeper into autumn you can keep an eye on the longer-term weather prospects with our <a href=\"https://www.bbc.com/weather/articles/c1ee0klzvneo\">monthly outlook</a>.</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published24 August</li>\n        </ul>\n        <graphic alt=\"A woman holds an umbrella to shelter from the Sun as she walks down a street. Some people are visible in the background, along with an old-fashioned red telephone box\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5a96/live/16b88100-6d5a-11f0-8b42-cf5ae7bf0dcf.jpg 976w\" width=\"3840\" height=\"2160.054657253473\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published4 days ago</li>\n        </ul>\n        <graphic alt=\"Satellite image of the tropical Atlantic showing areas of cloud but no tropical storms or hurricanes\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1536/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/fe83/live/05b25f80-8e4c-11f0-b199-41ee52afc86b.png 976w\" width=\"1536\" height=\"864\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published5 December 2024</li>\n        </ul>\n        <graphic alt=\"Rows of static caravans standing in flood water\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4a88/live/dea38140-b2ef-11ef-aff0-072ce821b6ab.jpg 976w\" width=\"3840\" height=\"2161.029453817558\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/weather/articles/c4gwrg7ep58o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "netanyahu-does-not-rule-out-further-strikes-on-hamas-leaders",
    "title": "Netanyahu does not rule out further strikes on Hamas leaders",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Netanyahu refuses to rule out further strikes on Hamas leaders Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b5f6/live/46f38540-920d-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Netanyahu refuses to rule out further strikes on Hamas leaders Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Netanyahu does not rule out further strikes on Hamas leaders 1 hour ago Share Save Tom Bennett Jerusalem Share Save Israel Prime Minister's Office Israeli Prime Minister Benjamin Netanyahu has not ruled out further strikes on Hamas leaders following last week's attack in Qatar, saying they would not have immunity \"wherever they are\". Speaking at a joint press conference with US Secretary of State Marco Rubio in Jerusalem, Netanyahu said every country had the right \"to defend itself beyond its borders\". Israel's decision to target senior Hamas leaders in Qatar - a close US ally - drew international outrage and criticism from US President Donald Trump. Hamas said six people were killed but that its leaders survived. When pressed on whether the US had any involvement in the strike, Netanyahu told journalists: \"We did it on our own. Period.\" The meeting between Rubio and Netanyahu comes as Arab leaders hold a summit in a show of support for Qatar. Its prime minister urged the international community to stop applying \"double standards\" and to punish Israel. In response to a question from the BBC about whether Israel's strike had damaged US relations in the region, Rubio said Washington maintained \"strong relationships with our Gulf allies\". Qatar hosts a major US airbase and has played a key role in brokering diplomatic efforts to end the war in Gaza, serving as a mediator of indirect negotiations between Hamas and Israel. CCTV captures moment of Israeli attack on Hamas leaders in Doha On Sunday, Netanyahu told reporters that the US-Israel relationship was as \"durable as the stones in the Western Wall\" while he and Rubio made a short visit to the holy site in Jerusalem's Old City. During the trip - on which they were accompanied by US ambassador to Israel Mike Huckabee - Rubio wrote a note and placed it into the wall, a traditional ritual performed by visitors. The men ignored reporters' questions focusing on Israel's strikes in Qatar. Also thought to have been discussed by Netanyahu and Rubio are Israeli military plans to seize Gaza City and Israel's continued expansion of settlements in the occupied West Bank. Over the weekend, the Israeli military pressed ahead with the demolition of residential buildings in Gaza City, and - according to local media - is now poised to begin ground operations in the Western neighbourhoods of the city. It has demanded that Gaza City's residents leave and head south to a central area of the strip. The Israel Defense Forces (IDF) estimate about 250,000 Palestinians have fled, though hundreds of thousands are believed to remain in the area. Some say they cannot afford to go south, while others say southern Gaza is not safe as Israel has carried out air strikes there too. Some have said they attempted to go south but were unable to pitch their tents, so returned to Gaza City. Netanyahu and Rubio's meeting comes ahead of a UN General Assembly session next week, at which some leading US allies - including the UK, France, Canada, Australia and Belgium - are expected to recognise the State of Palestine. This expected recognition has intensified debate within Israel around the future of the West Bank, with more hardline elements of the government insisting annexation is the only way to prevent a Palestinian state. In late August, the Israeli government gave final approval for the E1 settlement project east of Jerusalem, which would, in effect, split the West Bank in two - dividing the Palestinian populations in the north and south. Signing an agreement to press ahead with E1 last Thursday, Netanyahu said: \"We are going to fulfil our promise that there will be no Palestinian state. This place belongs to us.\" Earlier this month, Israel's far-right Finance Minister Bezalel Smotrich unveiled his proposal for the annexation of approximately four-fifths of the West Bank. Israel has built about 160 settlements housing 700,000 Jews since it occupied the West Bank and East Jerusalem - land Palestinians want, along with Gaza, for a hoped-for future state - during the 1967 Middle East war. An estimated 3.3 million Palestinians live alongside them. The settlements are illegal under international law. On Monday evening, Rubio is set to visit the City of David archaeological park, which was established by a settler organisation in the Palestinian neighbourhood of Silwan, in occupied East Jerusalem. He will attend the inauguration of the \"Pilgrimage Road\", a tunnel excavated underneath Palestinian homes that is said to mark the route of a Roman-era street taken by pilgrims to the Biblical temple that once stood on the site known to Jews as the Temple Mount and to Muslims as al-Haram al-Sharif (Noble Sanctuary). Critics say the City of David park is an attempt to politicise archaeology, at the expense of Palestinian residents. More on this story Qatar hosts Arab-Islamic emergency summit over Israeli strike on Doha Rubio in Israel as IDF destroys more Gaza…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/czxw4xkxg51o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "prince-harry-says-his-conscience-is-clear-over-royal-revelations",
    "title": "Prince Harry says his 'conscience is clear' over Royal revelations",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Prince Harry says his 'conscience is clear' over Royal revelations Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Eng…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/172b/live/646f0aa0-9216-11f0-85c7-5bdf6c05d36f.jpg",
    "source": "https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Prince Harry says his 'conscience is clear' over Royal revelations Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Prince Harry says his 'conscience is clear' over Royal revelations 1 hour ago Share Save Paul Glynn Culture reporter Share Save Getty Images The Duke of Sussex has said his \"conscience is clear\" following his revealing memoir Spare, and that he did not air his \"dirty linen in public.\" Prince Harry and his wife, the Duchess of Sussex, stepped back from official royal duties in 2020 , and he also spoke publicly about difficulties with family relationships to US talk show host Oprah Winfrey the following year. Speaking to the Guardian while on a trip to Kyiv, Ukraine, he said: \"I don't believe that I aired my dirty laundry in public. It was a difficult message, but I did it in the best way possible. My conscience is clear.\" His comments came just days after a short meeting with his father , King Charles, their first meeting in over a year. It was the first time the pair had met since February 2024. The prince, who also appeared with his wife in the 2022 Netflix series Harry and Meghan, also spoke about his upcoming legal case against the Daily Mail's publisher, Associated Newspapers, at the High Court in London. He is suing them over allegations of phone-hacking and other unlawful information gathering along with Sir Elton John, Baroness Lawrence and other public figures. Associated Newspapers has denied claims that it hacked phones, calling them \"preposterous smears\". \"It is not about revenge, it is about accountability,\" said the Prince, who now lives in the US but returned to the UK last week to attend a series of events related to causes he supports. Underlining his \"love\" for the UK, he suggested he would like to return home to see his family more often. He added that for the coming year, \"the focus really has to be on my dad.\" Reuters Prince Harry laid a wreath in Maidan Square in the centre of Kyiv The aim of Prince Harry's visit to the Ukrainian capital was to promote the work of his Invictus Games Foundation and to celebrate the recovery and rehabilitation of thousands of veterans who have suffered life-changing injuries since the war with Russia began three years ago. \"Nobody should feel embarrassed or ashamed about their disabilities,\" he said. \"It's about flipping from sympathy to admiration and respect.\" After having laid a wreath in memory of the dead, he described the conflict as \"all so unnecessary.\" His work for Invictus, he said, had helped to give him a renewed \"purpose\" after his military career ended, adding that it \"saved me\". He spoke to the British newspaper about the cost of war and how he boxes to relieve stress - punching a punch bag - as well as his portrayal in the media. He stressed that while he felt he had been \"destroyed by certain members of the British press\", he also still felt a lot of love from the British public. In January, the publisher of the Sun newspaper agreed to pay \"substantial damages\" and apologised to him settle a long-running legal battle over claims of unlawful intrusion into his life. He told The Guardian some events of the last four years have been \"very stressful\" and he had been \"finding out certain things that have really, really hurt.\" Prince Harry makes surprise Ukraine visit to support war wounded Harry makes sensational claims in new memoir Why did Harry and Meghan leave the Royal family? Harry's tea with Charles could be small but significant step to reconciliation Prince Harry meets King Charles for first time in more than a year Harry v the tabloids. What next, if anything? UK Royal Family Prince Harry, Duke of Sussex Related Donald Trump's UK state visit is this week - here's what we know Windsor businesses hope Trump trip boosts trade Mandelson should never have been ambassador, says Epstein victim's family More from the BBC 2 days ago Prince Harry makes surprise Ukraine visit to support war wounded The Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia. 2 days ago 4 days ago Weekly quiz: What was wrong with this medal? How much attention did you pay to what happened in the world over the past seven days? 4 days ago 4 days ago Why did Harry and Meghan leave the Royal family? The Duke and Duchess of Sussex have signed a number of commercial deals since stepping down as senior Royals. 4 days ago 4 days ago Harry's tea with Charles could be small but significant step to reconciliation The king and his son have met in person for the first time since February 2024 - but the clues a reunion was nearing have been there, writes senior royal correspondent Daniela Relph. 4 days ago 5 days ago Prince Harry meets King Charles for first time in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cg7d27l929mo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "boss-of-degrading-sex-trade-ring-in-dubai-s-glamour-districts-unmasked",
    "title": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c16/live/c327cfd0-919b-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Boss of degrading sex-trade ring in Dubai's glamour districts unmasked by BBC 14 hours ago Share Save Runako Celina BBC Eye Investigations Share Save Watch: Charles Mwesigwa - known locally as Abbey - says his women are \"open-minded\" Warning: Contains disturbing content and graphic descriptions of sexual acts A man running a sex ring operating out of Dubai's most glamorous neighbourhoods, and exploiting vulnerable women, has been identified by a BBC investigation. Charles Mwesigwa, who says he is a former London bus driver, told our undercover reporter he could provide women for a sex party at a starting price of $1,000 (£740), adding that many can do \"pretty much everything\" clients want them to. Rumours of wild sex parties in the UAE emirate have circulated for years. The hashtag #Dubaiportapotty, which has been viewed more than 450 million times on TikTok, links to parodies and speculative exposés of women accused of being money-hungry influencers secretly funding their lifestyles by fulfilling the most excessive of sexual requests. Our BBC World Service investigation was told the reality is even darker. Young Ugandan women told us they had not expected to have to undertake sex work for Mr Mwesigwa. In some cases, they believed they were travelling to the UAE to work in places like supermarkets or hotels. At least one of Mr Mwesigwa's clients regularly asks to defecate on the women, according to \"Mia\", whose name we have changed to protect her identity, and who says she was trapped by Mr Mwesigwa's network. Mr Mwesigwa denies the allegations. He says he helps women find accommodation through landlords, and that women follow him to parties because of his wealthy Dubai contacts. We have also discovered that two women linked to Mr Mwesigwa have died, having fallen from high-rise apartments. Although their deaths were ruled as suicides, their friends and family feel the police should have investigated further. Mr Mwesigwa said the incidents were investigated by the Dubai police and asked us to contact them for information. They did not reply to our request. Outside of the UK you can watch on YouTube One of the women who lost her life, Monic Karungi, arrived in Dubai from western Uganda. She found herself sharing a flat with dozens of other women working for Mr Mwesigwa, according to one of the women, who we are calling Keira, who says she lived with Monic there in 2022. \"[His] place was like a market… There were like 50 girls. She was not happy because what she expected is not what she got,\" Keira told us. Monic thought the job in Dubai was going to be in a supermarket, according to her sister Rita. \"He [Mr Mwesigwa] was violent when I told him I wanted to go back home,\" says Mia, who also knew Monic in Dubai. She says that, when she first arrived, he told her she already owed him £2,000 ($2,711) and that within two weeks that debt had doubled. \"Money for air tickets, for your visa, for where you're sleeping, food,\" says Mia. \"That means you have to work hard, hard, hard, pleading for men to come and sleep [with] you.\" Monic owed Mr Mwesigwa more than $27,000 (£19,918) after several weeks, according to what a relative of hers we are calling Michael says she told him. He adds that he received tearful voice notes from her. Family handout Monic grew up with 10 siblings in rural Uganda Mia told us that clients were mostly white Europeans, and included men with extreme fetishes. \"There's this one client, he poops on girls. He poops and he tells them to eat the shit,\" she explained quietly. Another woman we are calling Lexi, who says she was tricked by a different network, echoed Mia's story, saying \"porta potty\" requests were frequent. \"There was a client who said: 'We pay you 15,000 Arab Emirates Dirham ($4,084, £3,013) to gang-rape you, pee in your face, beat you, and add in 5,000 ($1,361, £1,004)'\" for being recorded eating faeces. Her experiences have led her to believe there is a racial element to this extreme fetish. \"Every time I said that I wouldn't want to do that, it seemed to get them more interested. They want somebody who is going to cry and scream and run. And that somebody [in their eyes] should be a black person.\" Lexi says she tried to get help from the only people she thought could intervene - the police. But she says they told her: \"You Africans cause problems for each other. We don't want to get involved. And they would hang up.\" We put this allegation to the Dubai police and they did not reply. Lexi eventually escaped back to Uganda and now helps to rescue and support women in similar situations. Warsan Tower in Dubai, from which Monic Karungi fell in May 2022 Finding Charles Mwesigwa wasn't easy. We could only…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2r9y3kxy9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "in-pictures-best-looks-from-the-emmys-red-carpet-in-la",
    "title": "In pictures: Best looks from the Emmys red carpet in LA",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Emmys red carpet: Sydney Sweeney, Jenna Ortega and Selena Gomez Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Englan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/91c5/live/cf399320-9219-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Emmys red carpet: Sydney Sweeney, Jenna Ortega and Selena Gomez Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Sydney Sweeney and Lisa from Blackpink walk Emmys red carpet 13 hours ago Share Save Steven McIntosh Entertainment reporter Share Save Watch: Best looks from the Emmys red carpet Sydney Sweeney, Jenna Ortega, Selena Gomez and Lisa from Blackpink were among the stars walking the red carpet ahead of the Emmy Awards. The ceremony took place on Sunday at the Peacock Theatre in Los Angeles, rewarding the best TV shows of the past 12 months. Adolescence star Owen Cooper makes Emmys history at 15 Cash for speeches and big wins for The Pitt and The Studio - 7 Emmys highlights The winners and nominations in full Here are just a few of the stars who posed for pictures ahead of television's biggest night: Getty Images Lisa, from K-pop girlband Blackpink, made her acting debut in The White Lotus Getty Images Wednesday star Jenny Ortega Getty Images Severance director Ben Stiller pictured with his wife, actress Christine Taylor Getty Images Euphoria star Sydney Sweeney was one of the presenters at the ceremony Getty Images The White Lotus star Aimee Lou Wood Getty Images Abbott Elementary creator and star Quinta Brunson Getty Images Disclaimer star Cate Blanchett Getty Images L-R: Adolescence stars Stephen Graham, Ashley Walters, Owen Cooper, Christine Tremarco and Erin Doherty Getty Images The White Lotus star Walton Goggins Getty Images Only Murders In The Building star Selena Gomez Getty Images The Penguin star Colin Farrell, pictured with his son Henry Getty Images The Last of Us star Pedro Pascal Getty Images The Studio star Catherine O'Hara Getty Images Black Mirror's Charlie Brooker and executive producer Jessica Rhoades Getty Images The Four Seasons star Colman Domingo Getty Images The Studio star Chase Sui Getty Images Presumed Innocent star Jake Gyllenhaal Getty Images Severance actress Dichen Lachman Getty Images Carrie Coon of The White Lotus Getty Images Hacks star Jean Smart Getty Images Shabana Azeez from The Pitt Getty Images Nobody Wants This star Kristen Bell Getty Images Hacks star Hannah Einbinder Getty Images Harrison Ford, star of Shrinking, with his wife Calista Flockhart Getty Images Sam Nivola of the White Lotus Getty Images Shrinking star Brett Goldstein Getty Images The White Lotus star and former Emmy winner Jennifer Coolidge Getty Images Adam Brody from Nobody Wants This Getty Images Presumed Innocent star Ruth Negga Getty Images Abbott Elementary's William Stanford Davis Getty Images The Late Show host Stephen Colbert, pictured with his wife Evelyn McGee-Colbert Getty Images The Traitors USA host Alan Cumming Getty Images Director Taika Waititi with his wife, singer Rita Ora Getty Images Actress Scarlett Johansson with her husband, Saturday Night Live star Colin Jost Getty Images Hacks star Megan Stalter was one of several stars referencing the Israel-Gaza war, carrying a bag with the slogan \"Cease Fire\" Getty Images Monsters: The Lyle and Erik Menendez Story star Javier Bardem wore a keffiyeh scarf as he voiced support for Palestinians Getty Images The White Lotus actress Parker Posey Getty Images Real Housewives star Phaedra Parks Adolescence star Owen Cooper makes Emmys history Emmy Awards 2025: The winners and nominations in full How Adolescence pulled off an Emmys sweep Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights Television Related Adolescence Emmys haul 'left no time to go to loo' Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info BBC.com Help & FAQs Content Index Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c79vdz35v0po?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "history-making-wins-and-heartfelt-thank-yous-highlights-from-the-cerem",
    "title": "History-making wins and heartfelt thank yous - highlights from the ceremony in LA",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Emmys highlights: Cash for speeches and big wins for The Pitt and The Studio Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Po…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5215/live/5933bed0-9214-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Emmys highlights: Cash for speeches and big wins for The Pitt and The Studio Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Cash for speeches and big wins for The Pitt and The Studio - Emmys highlights 5 hours ago Share Save Nardine Saad Los Angeles Share Save Watch: Key winning moments from the 77th Emmy Awards The 77th Primetime Emmys Awards generated another slate of viral moments, from cash awards for short speeches to history-making wins and heartfelt thank yous. This year's big winners of the night were HBO's medical drama The Pitt, Apple TV+'s Hollywood satire The Studio and Netflix's chilling psychological miniseries Adolescence. Tramell Tillman made history as the first black man ever to win an Emmy for supporting actor in a drama series. The Late Show host Stephen Colbert pulled off a big win after his fellow nominees in the talk show category rallied behind him following his show's abrupt cancellation. And awards night host Nate Bargatze implored winners to keep their long-winded speeches snappy with a running gag that saw his charity donation docked if speech-givers went over their allotted time. Here's a look at this year's big moments from the ceremony at the Peacock Theater in downtown Los Angeles. Adolescence sweeps its category Getty Images Stephen Graham and Jack Thorne's drama about a 13-year-old boy accused of murder dominated the miniseries category with wins for best series and for stars Owen Cooper and supporting actress Erin Doherty. Cooper, 15, made Emmys history as the youngest supporting actor to win his category, and delivered a heart-warming acceptance speech after giving presenter Sydney Sweeney a shy hug. \"It means so much to me, my family, people back home. So, you know, it's just, yeah, it just means a lot to me,\" Cooper said backstage after his win. Backstage, director Philip Barantini told reporters that they made the show in Yorkshire with the hope it would \"spark a bit of a conversation in the UK\" where knife crime has become a big issue, but added he could not have predicted its global success. The Studio wins big Getty Images The Studio actors Dewayne Perkins, Keyla Monterroso Mejia, Kathryn Hahn, Chase Sui Wonders, Seth Rogen, Ike Barinholtz and Bryan Cranston The Hollywood satire Seth Rogen co-created and stars in picked up several awards, completing an impressive run in its first season. Rogen, who arrived backstage unable to carry all the trophies he had acquired, joked: it's \"getting embarrassing\". Alas, he did not thank his fictional right-hand man Sal Saperstein in his acceptance speech. Emmy Awards 2025: The winners and nominations in full Sydney Sweeney and Lisa from Blackpink walk Emmys red carpet Adolescence star Owen Cooper makes Emmys history The Pitt bests Severance Getty Images Katherine LaNasa and Noah Wyle at the 77th Primetime Emmy Awards It came down to Severance's battle of the mind and The Pitt's battle of the heart in the best drama series category, with HBO's medical drama besting the top nominee. The Pitt took home two major Emmy awards in a row, winning outstanding drama series and Noah Wyle winning best lead actor in a drama series, who called his win \"a dream\". \"I want to dedicate this, on behalf of everyone, to all the healthcare workers, front-line first responders. Respect them, protect them, trust them,\" show creator R Scott Gemmill said while accepting the award for best drama. Before that, Katherine LaNasa also won the award for best supporting drama actress for her portrayal of a charge nurse, Dana, in the show. Host Nate Bargatze keeps speeches in check with a cheque Getty Images Emmys host Nate Bargatze kept a running tally of donations to the Boys and Girls Club of North America throughout the show First-time host Nate Bargatze, known for his family-friendly humour, knocked it out of the park with his idea to keep winner speeches short: He started off the night with a $100,000 (£73,630) pledge to the Boys and Girls Club of North America that would be docked $1,000 for every second someone went over. \"It's hard. It's tough. It's brutal. I can't change it. This is a game I made up and these are the rules,\" he said in his opening monologue after explaining the idea. The \"game\" ran throughout the telecast, with most winners ignoring it or promising to make up for how much money they lost the club. The check-ins throughout the night made for a consistent running gag. The Studio star Seth Rogen kicked off the speeches and kept it speedy due to his shock at the win, adding another $6,000 to the roster. But his successor, The Pitt star Katherine LaNasa greatly overran, and had what Bargatze called \"a very expensive wave\" that lost the club several thousands of dollars. During a mid-show check-in the total was down to -$26,000 and Bargatze quipped that he's \"actually making money\". But with Hollywood's love of a happy ending, Bargatze closed the show by pledging $250,000 and that network CBS would add…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cj9zep0y7reo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "i-m-just-a-mixed-race-kid-from-flats-in-kirkby-says-stephen-graham-in-",
    "title": "'I'm just a mixed-race kid from flats in Kirkby', says Stephen Graham in acceptance speech",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Stephen Graham: 'I'm just a mixed-race kid from flats in Kirkby' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Engla…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9f76/live/4e797e50-921c-11f0-9626-27d4fe3cc3f8.jpg",
    "source": "https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Stephen Graham: 'I'm just a mixed-race kid from flats in Kirkby' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live 'I'm just a mixed-race kid from flats in Kirkby' 3 hours ago Share Save Jenny Coleman North West Share Save ALLISON DINNER/EPA/Shutterstock Stephen Graham was named outstanding lead actor for his role in the hit Netflix series Actor Stephen Graham has described himself as \"just a mixed-race kid from Kirkby\" as he accepted an Emmy award for his starring role in the acclaimed Netflix series Adolescence. In his acceptance speech, the 52-year-old, who grew up in the Merseyside town, said: \"This kind of thing doesn't happen to a kid like me.\" Graham played Eddie Miller in the series, which told the story of a teenage boy accused of killing a schoolmate. The star, who was named outstanding lead actor, also paid tribute to his children and wife Hannah Walters, who he described as his \"rock\" and \"soulmate\". The series scooped six trophies at the awards, including one for outstanding supporting actor won by Owen Cooper, who at just 15 became the youngest ever male Emmy winner, for his breakout role Adolescence. Netflix Stephen Graham played Eddie Miller, the father of a 13-year-old boy accused of murder In his speech, Graham said: \"This kind of thing doesn't happen to a kid like me. I'm just a mixed race kid from a block of flats in a place called Kirkby. \"So for me, to be here today, in front of my peers and to be acknowledged by you is the utmost humbling thing I could ever imagine in my life, and it shows you that any dream is possible. \"There's too many people to thank but I am going to thank my friends and family. Without you, none of this is possible. \"Thank you for helping me with something that I can't do on my own. \"Jack, everyone, Phil, everyone. I want to bring it to my dad for taking me to the video shop when I was a kid and kick-starting my education in film - Quarry Green video shop. \"My kids Grace and Alfie and my adorable wife, who I love with every ounce of my being, you are my rock, you are my world, you are my soulmate and you know and I know, without you, I would be dead. \"So from the bottom of my heart I love you with everything I have. Namaste everyone, thanks very much.\" Listen to the best of BBC Radio Merseyside on Sounds and follow BBC Merseyside on Facebook , X , and Instagram . You can also send story ideas via Whatsapp to 0808 100 2230. More on this story How Adolescence pulled off an Emmys sweep Netflix's Adolescence makes UK TV ratings history Knowsley Kirkby Related New pavilion honours pioneer of women's football Driver dies in motorway car fire Watchdog probes foodbank over use of funds More from the BBC 2 days ago Golf club upgrade prompts nine weeks of roadworks Drivers have complained of \"gridlock\" around the works close to Kirkby Golf Club. 2 days ago 3 days ago Driver charged after man dies in burning car John Butler, 31, faces a charge of causing death by dangerous driving after the M52 incident. 3 days ago 28 Aug 2025 Man to cycle 200 miles for domestic abuse charity Mickey Burns aims to cycle more than 200 miles through the night for a Liverpool-based charity. 28 Aug 2025 21 Jul 2025 £1m spent trying to save dangerous flats The cash from tenants and taxpayers has been spent trying to fix Beech Rise and Willow Rise. 21 Jul 2025 18 Jul 2025 Man charged with murder of dad shot on doorstep Ryan Walsh-Westhead, 24, is arrested exactly one year on from the murder of Rikki Berry in Kirkby. 18 Jul 2025 British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather BBC Shop BritBox BBC in other languages Follow BBC on: Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Contact the BBC Advertise with us Do not share or sell my info BBC.com Help & FAQs Content Index Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cx2rjgdwweyo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "adolescence-star-owen-cooper-makes-emmys-history-as-youngest-male-winn",
    "title": "Adolescence star Owen Cooper makes Emmys history as youngest male winner",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Adolescence star Owen Cooper makes Emmys history as youngest ever male winner Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f3c/live/9d101b40-91d7-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Adolescence star Owen Cooper makes Emmys history as youngest ever male winner Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Adolescence star Owen Cooper makes Emmys history at 15 10 hours ago Share Save Steven McIntosh Entertainment reporter Share Save Watch: Key winning moments from the 77th Emmy Awards Adolescence star Owen Cooper, 15, becomes the youngest ever male Emmy Award winner The Netflix drama scoops four major awards, with Stephen Graham and Erin Doherty also winning Cooper says \"I was nothing about three years ago, I'm here now\" in emotional speech Elsewhere, The Studio breaks the record for most wins by a comedy for a single series British actor Owen Cooper has become the youngest male ever to win a primetime Emmy Award, in a night dominated by Netflix's acclaimed drama Adolescence. Cooper, 15, was named best supporting actor in a limited series for his portrayal of a schoolboy accused of murdering a classmate. The four-part drama also won best limited series, as well as prizes for its directing and writing, and acting prizes for Stephen Graham and Erin Doherty . In his acceptance speech, Cooper said: \"Standing up here is just, wow, it's just so surreal. \"When I started these drama classes a couple of years back, I didn't expect to even be in the United States, never mind here.\" The winners and nominations in full Cash for speeches and big wins for The Pitt and The Studio - 7 Emmys highlights How Adolescence pulled off an Emmys sweep In pictures: Sydney Sweeney, Jenna Ortega and Selena Gomez on red carpet Cooper, who played teenager Jamie Miller, said: \"I think tonight proves if you listen, and you focus and you step out your comfort zone, you can achieve anything in life. \"Who cares if you get embarrassed? Anything can be possible. I was nothing about three years ago, I'm here now.\" He also thanked his family, co-stars, and the show's production team, adding: \"It may have my name on this award, but it really belongs to the people behind the camera.\" Getty Images Cooper, 15, described his record-breaking win as \"surreal\" Cooper broke the record previously held by Scott Jacoby, who was 16 years old when he won a Primetime Emmy in 1973 for That Certain Summer. Roxana Zal remains the youngest acting winner overall. She was 14 when she won an Emmy in 1984 for Something About Amelia. Bindi Irwin is the youngest person to have won a Daytime Emmy, when she was nine. Getty Images Erin Doherty said making Adolescence had been \"the definition of a team effort\" 'Any dream is possible' - Stephen Graham Adolescence was widely praised by critics and viewers for its exploration of the impact of smartphones and social media on teenagers. In his acceptance speech for leading actor, Graham said: \"This kind of thing normally doesn't happen to a kid like me, I'm just a mixed-race kid from a block of flats in a place called Kirkby. \"So for me to be here today in front of my peers and be acknowledged by you is the most humbling thing I could ever imagine in my life, and it shows you that any dream is possible.\" Doherty, who played a child psychologist who works with Jamie, won best supporting actress in a limited series. The British actress joked she would be \"banging on about Owen Cooper and Adolescence for the rest of my life\". \"I'd love to mention every single person involved in making this show because it was the definition of a team effort,\" she added. Getty Images Stephen Graham won best lead actor in a limited series, as well as a prize for co-writing the drama Accepting the prize for outstanding writing earlier in the night, Graham said: \"We never expected our little programme to have such a big impact, but we're really grateful that it did.\" His co-writer Jack Thorne paid tribute to the show's young cast, telling them: \"You are the flame that proved young people are going to be OK.\" Earlier in the weekend, actor Jake Gyllenhaal surprised Cooper during an interview, after the young actor previously described him as his hero. In a clip that went viral on social media, Gyllenhaal gave Cooper the \"lucky duck\" which had originally been given to him when he was nominated for an Oscar. Watch: Owen Cooper's co-stars on his Adolescence audition and being in the spotlight so young (April 2025) The Studio breaks comedy record Other winners at the Emmys included Hollywood satire The Studio , which won several of the major comedy categories, including best actor for its star and creator Seth Rogen . The actor joked: \"I couldn't wrap my head around this happening, so I've prepared nothing. \"I never won anything in my life. When I was a kid I bought a used bowling trophy at an estate sale. This is really just so lovely.\" The Studio broke the record for the most wins by a comedy for a single series, winning…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c75qdg41qv2o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "watch-the-winning-speeches-in-two-minutes",
    "title": "Watch: The winning speeches - in two minutes",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Watch: Key winning moments from the 77th Emmy Awards Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Irelan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/83ae/live/3b4b4a00-920f-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Watch: Key winning moments from the 77th Emmy Awards Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Watch: Winning moments from the 77th Emmy Awards The 77th Primetime Emmy Awards have taken place in Los Angeles on Sunday night, with shows The Studio, The Pit and Adolescence dominating the awards. Owen Cooper became the youngest ever male Emmy winner at 15-years-old, for his breakout role in the Netflix miniseries Adolescence. Seth Rogan's comedy series The Studio scooped up four Emmys, while The Pitt beat out the likes of Severance and The White Lotus to win Best Drama. 6 hours ago Emmy Awards United States Share Save 'No doubt' Russia will cross Nato border if Ukraine falls, former US VP says Former US Vice-President Mike Pence calls for security guarantees in Ukraine to help deliver “just and lasting peace”. 6 Sep 2025 US & Canada Watch: What's in the 'missing minute' of Epstein's jail video? The US House Oversight Committee has released new surveillance footage recorded hours before the convicted paedophile's death. 5 Sep 2025 US & Canada Watch: Ex-VP Mike Pence says he has 'great concerns' over Trump's tariffs In an interview with BBC Newsnight, the former vice-president to Donald Trump said he would like to see negotiations to lower the levies. 5 Sep 2025 US & Canada Angola: The notorious prison being used in Trump's immigration crackdown The new detention facility inside the prison is designed to hold more than 400 undocumented immigrants convicted of serious crimes. 5 Sep 2025 US & Canada Watch: Moment teen reels in 'once-in-a-lifetime' huge halibut Jackson Denio, a 13-year-old from New Hampshire, might have set the world record for the largest catch of a halibut fish. 5 Sep 2025 US & Canada UK online speech laws 'not a good thing', says Trump The US president made the remarks during a dinner hosting prominent tech leaders at the White House. 5 Sep 2025 US & Canada Can Trump send National Guard troops to Chicago? Trump has said \"we're going in\", when asked about sending National Guard troops to Chicago, but does he have the power to do this? 4 Sep 2025 US & Canada Watch: Key moments from RFK Jr's heated Senate hearing The US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention. 4 Sep 2025 US & Canada Watch: Epstein accusers speak outside US Capitol The group said they are making their own list of Jeffrey Epstein's associates and called for the release of all files related to the investigation. 3 Sep 2025 US & Canada Wildfire ravages historic California gold rush town destroying homes A fast-moving wildfire scorched the historic gold rush town of Chinese Camp destroying at least five homes and prompting evacuations. 3 Sep 2025 US & Canada Watch: Fountains of lava shoot into the air as Kilauea erupts The molten magma streamed down one of the world’s most active volcanoes and put on another fiery show on the Island of Hawaii. 3 Sep 2025 US & Canada 'I would feel more worried' - Chicagoans on Trump's plan to deploy troops President Donald Trump says he will send the National Guard to Chicago to help fight crime but has not specified when that could occur. 3 Sep 2025 US & Canada Watch: Moment police device breaks off fleeing car's rear axle Officers in Michigan were responding to reports of a stolen vehicle, when they deployed a grappler device around one of the car's tires. 2 Sep 2025 US & Canada Trump addresses online health rumours in Oval Office In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend. 2 Sep 2025 US & Canada 'We love you, you will always be with us', says father of Minneapolis shooting victim Fletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis. 28 Aug 2025 US & Canada Watch: Timelapse shows massive clouds of smoke from California wildfire The Garnet wildfire in Fresno County has scorched nearly 14,000 acres (5,665 hectares) and remains uncontained. 28 Aug 2025 US & Canada Watch: BBC interviews man who helped rescue children from gunfire The BBC's Tom Bateman spoke with Patrick Scallen who lives near the Annunciation Church and ran towards the sound of gunfire. 28 Aug 2025 US & Canada Watch: Moment pilot is rescued after emergency water landing New drone video shows rescuers rushing to the small plane off the coast of North Carolina and extracting the pilot in less than 30 seconds. 28 Aug 2025 US & Canada Watch: How the Catholic school shooting unfolded in Minneapolis Two children, aged eight and 10, have been killed and 17 other people injured following a shooting during Mass. 27 Aug 2025 US & Canada Watch: SpaceX Starship completes successful test flight Elon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/videos/c1jzxjgx7r9o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "everybody-wants-to-know-what-s-going-to-happen-summer-i-turned-pretty-",
    "title": "'Everybody wants to know what's going to happen' - Summer I Turned Pretty star on the finale of the breakout TV hit",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "The Summer I Turned Pretty actress on secrecy around Amazon hit Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Englan…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5109/live/c5452270-9157-11f0-9223-171c11f85051.jpg",
    "source": "https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>The Summer I Turned Pretty actress on secrecy around Amazon hit Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The secrets began before I even auditioned, says The Summer I Turned Pretty actress 14 hours ago Share Save Lola Schroer BBC News Share Save BBC \"It's lucky me to be a little part of that,\" says Corinna Brown of the show The Summer I Turned Pretty fans are preparing for this week's series three finale - and many are desperate to know how the season will end. The Amazon show has been a breakout hit for young viewers and the tech giant is taking no chances of spoiling the story. For actress Corinna Brown, who plays Gemma, the secrecy began before she even auditioned. \"There were codenames galore,\" she remembers. \"There was a codename for the title of the show, there was a codename for my character. \"I thought up until maybe two days before we started shooting that my character was called Maeve. \"Amazon are very good at keeping it a secret.\" So keen are producers to prevent spoilers, BBC News is speaking to Brown under the condition she doesn't discuss the finale, which drops on Prime Video on Wednesday. Warning: The below may contain spoilers - especially if you haven't watched series three of the show Millions are gripped by the show's love triangle plot between Isabel 'Belly' Conklin, played by Lola Tung, and brothers Conrad and Jeremiah Fisher, played by Christopher Briney and Gavin Casalegno. Among the obsessions for fans have been a tiny engagement ring, a two-tier mirror glaze dark chocolate cake with raspberries and that sensual peach scene. Brown's character Gemma is one of Belly's new friends she meets after her move to Paris. So what was it like to be part of a cultural phenomenon? \"It was so exciting because it's so highly anticipated and everybody wants to know what's going to happen,\" London-born Brown, 26, says. \"The fan base are so passionate, which is something you don't always get.\" She says she \"didn't really realise\" how big the fandom of the show was until its release. \"So I think that was a good thing, to be fair, because otherwise, from the beginning, I would have been like: 'Oh my God'.\" 'We all love a bit of romance' As the show's Paris-era was unlocked, viewers have been introduced to a new supporting cast in Belly's circle in the French capital, including Gemma, who like Belly, is new to Paris. Brown describes her character as a \"kindred spirit\" to Belly. They meet outside a nightclub, when Gemma is being bothered by a man. Belly steps in to help her out and the two become friends. Brown says it is one of her favourite moments and shows \"women supporting each other\". Getty Images Gavin Casalegno, Lola Tung and Christopher Briney are the lead actors in the show According to Amazon, this season's first episode drew in 25 million global viewers, a 40% increase on the previous season, with Prime Video saying it is its most-watched TV season among women aged 18-34. Brown thinks the success of the show comes down to the writing by Jenny Han, who wrote the young adult (YA) romance books the TV series is based on. \"She knows what she's doing. She's got everybody hooked from the books,\" Brown says. \"It's lucky me to be a little part of that.\" Brown feels another reason why the show resonates is \"because we all go through it\". \"We go through friendship, heartache, love, confusion. For the audience that watch this show and love The Summer I Turned Pretty that is a big thing, it's a new thing, it forms so much of your life. \"Being able to watch someone's else experience of that is helpful... and we all love a bit of romance,\" she says. Beyond the traditional audience watching on screens, there are countless fan edits and reaction videos posted on social media, which Corinna says have been positive towards her character. \"They've been lovely. I've only seen good things. They say they like Gemma giving her [Belly] straight advice.\" Prime Video According to Amazon, this season's first episode drew in 25 million global viewers Already beloved by YA fans for her turn as Tara Jones in Netflix-hit Heartstopper, Brown is no stranger to the world of teen romance adaptations. \"With any show that's for a young audience, you have to have that awareness of the young minds that you're inspiring, shaping,\" Brown says. \"And that's an honour in itself.\" Amid all the buzz of the show, secrets are tightly guarded and with the finale about to drop we are not allowed to ask Brown what happens in it. But we can't help but ask what feels to fans like the summer's most pressing question: Are you team Conrad or team Jeremiah? \"I'm going to keep my lips tight on that one,\" Brown says, smiling. \"But what I will say is I am Team Gemma and Team Belly's friendship…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cewnkld78qqo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "strictly-star-dani-dyer-on-why-she-d-like-to-pull-dad-danny-up-on-the-",
    "title": "Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Strictly stars on sexy costumes, the Strictly curse and feeling 'overwhelmed' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK P…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0316/live/fd5726f0-8efe-11f0-ad1d-477615c292d0.jpg",
    "source": "https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Strictly stars on sexy costumes, the Strictly curse and feeling 'overwhelmed' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Strictly star Dani Dyer on why she'd like to pull dad Danny up on the dancefloor 7 hours ago Share Save Emma Saunders Culture reporter Share Save PA Media Dyer notes this is \"one of the biggest show's I've done since Love Island\" in 2018 It's that time again. The nights are drawing in, the tans are fading and we all need a bit of sparkle in our lives as we head into autumn. Never fear, Strictly Come Dancing is back with its 23rd series, with 15 new contestants ready to dust off their dancing shoes. Following last year's controversies relating to the behaviour of some professional dancers , plus a recently launched investigation into alleged drug use by two of the show's stars and an unnamed star being arrested on suspicion of rape (it is understood the development is not related to the upcoming series), BBC bosses will be keen for fans and media to return to talking about the show itself. With that in mind, the press gathered for an annual event which gives journalists a chance to speak to all the contestants ahead of the show launch (well, almost all, more on that later). Here's all the behind-the-scenes gossip we found out from the likes of Dani Dyer, Vicky Pattison and Jimmy Floyd Hasselbaink. This year's Strictly contestants are glammed up and ready to go On being 'Strictified' One of the big attractions for most celebrity contestants on the show is the chance to glam up to the max every Saturday night. Former Love Island star Dani Dyer says she's game for any dance costume. \"I can't wait to be a bit sexy, I've been a mum... my oldest is four... am I sexy?,\" she giggles. \"On Love Island I never wore the thong bikinis and now I'm like 'Why didn't I do that?\" Dani in a carnival thong number for the samba? You heard it here first. La Voix says: \"The main reason we're doing this is it's like a free bootcamp!\" La Voix, who competed in the 2024 series of RuPaul's Drag Race UK, arrives at the press event in full make-up with trademark coiffured hair-do. How on earth can you \"Strictify\" a drag performer? \"I might be the only one that dresses down on a live show! I want the full Strictly experience. They're going to take it to the next level. They have already – I've been lucky enough to have seen my first dress. \"The glamour is wonderful, I feel like I'm living my dream. I don't want to do the dancing, just the dressing up bit!\" Keeping control of the nerves Vicky Pattison first found fame on reality show Geordie Shore Former Geordie Shore star and podcast host Vicky Pattison has always been very open about her struggles with anxiety, recently revealing on her podcast Get A Grip that she had gone back to therapy to deal with Strictly nerves. \"Everyone's handling me with kid gloves at the moment, I keep getting loads of cuddles off everyone. \"I'm scared, a little bit overwhelmed. I think it's because I've wanted to do this show for so long, I'm a big fan. I'm desperate to make the most of it... but I'm worried I'll get in my own head.\" But support from the likes of former contestants Pete Wicks and her podcast co-host Angela Scanlon is helping. \"With Pete, our careers, there's a lot of parallels, we both come from reality TV and there's this common misconception that we're not very talented or capable of anything. I would really like to change that narrative. Pete just said be yourself. \"I just need to get a handle on myself and put my big girl pants on. I'll kick myself if I'm in my own head the whole time and I don't enjoy it. I think I'm putting a lot of pressure on myself.\" Social media star George Clarke says the nerves haven't hit him - yet. \"I don't really get nervous until it's just about to happen, which is nice, until it's just about to happen! Nice build-up and then a breakdown in the dressing room!\" Model, actress and influencer Ellie Goldstein says she's \"excited and nervous but nerves are good. I'm so competitive, I want to win!\" And Dani's famous dad Danny Dyer will be cheering her on. \"Dad is so excited for me, he loves the show. He came to support when Rose Ayling Ellis (his on-screen daughter in EastEnders) was doing it and it was emotional then. He loves a dance himself. I should get him up!\" The Strictly curse PA Media Jimmy Floyd Hasselbaink played for teams such as Chelsea and Leeds and the Netherlands national team and has managed clubs including QPR and Northampton Town None of the contestants seemed bothered about the so-called Strictly curse, which refers to several former contestants who were already in…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c33r4j2elldo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "my-wife-died-giving-birth-after-trump-cut-funding-to-our-clinic",
    "title": "'My wife died giving birth after Trump cut funding to our clinic'",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "BBC investigates Afghan maternal deaths after US aid cuts Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. I…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d10a/live/fec88e30-8fe3-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>BBC investigates Afghan maternal deaths after US aid cuts Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live 'My wife died giving birth after Trump cut funding to our clinic' 16 hours ago Share Save Yogita Limaye South Asia and Afghanistan correspondent Share Save Aakriti Thapar / BBC When Shahnaz went into labour, her husband Abdul called a taxi to take them to the only medical facility accessible to them. \"She was in a lot pain,\" he says. A 20-minute drive away, the clinic was in Shesh Pol village in Afghanistan's north-eastern Badakhshan province. It was where their two older children were born. Abdul sat next to Shahnaz comforting her as they drove over gravel tracks to reach help. \"But when we reached the clinic, we saw that it was closed. I didn't know it had shut down,\" he said, his face crumpling with agony. Warning: Readers may find some details in this article distressing. The clinic in Shesh Pol is one of more than 400 medical facilities that closed down in Afghanistan, one of the world's poorest countries, after the Trump administration cut nearly all US aid to the country earlier this year, in a drastic and abrupt move following the dismantling of the US Agency for International Development (USAID). A single-storey structure with four small rooms, white paint peeling off its walls, the Shesh Pol clinic has USAID posters tacked up everywhere with information and guidance for pregnant women and new mothers. Aakriti Thapar / BBC Shesh Pol maternity clinic is one of hundreds of medical facilities forced to close as a result of US aid cuts in Afghanistan It doesn't look like much but in Badakhshan's mountainous, unforgiving terrain, where a lack of access has been a major reason for historically high maternal mortality rates, the clinic was a critical lifeline, part of a wider programme implemented during the tenure of the US-backed government in the country, to reduce maternal and newborn deaths. It had a trained midwife who assisted around 25-30 deliveries every month. It had a stock of medicines and injections, and it also provided basic healthcare services. Other medical facilities are simply too far from Abdul's village, and it was not without risk for Shahnaz to travel on bumpy roads. Abdul also didn't have money to pay for a longer journey - renting the taxi cost 1,000 Afghani ($14.65; £12.70), roughly a quarter of his monthly income as a labourer. So they decided to return home. \"But the baby was coming and we had to stop by the side of the road,\" Abdul said. Shahnaz delivered their baby girl in the car. Shortly after, she died, bleeding profusely. A few hours later, before she could be named, their baby also died. Aakriti Thapar / BBC Abdul spoke to the BBC about the traumatic deaths of his wife and newborn baby, who are buried in Shesh Pol \"I wept and screamed. My wife and child could've been saved if the clinic was open,\" said Abdul. \"We had a hard life, but we were living it together. I was always happy when I was with her.\" He doesn't even have a photo of Shahnaz to hold on to. There's no certainty the mother and baby would've survived if they'd been treated at the clinic, but without it, they didn't stand a chance, underlining the undeniable impact of US aid cuts in Afghanistan. For decades, America has been the largest donor to Afghanistan, and in 2024, US funds made up a staggering 43% of all aid coming into the country. The Trump administration has justified withdrawing it, saying there were \"credible and longstanding concerns that funding was benefiting terrorist groups, including... the Taliban\", who govern the country. The US government further added that they had reports stating that at least $11m were \"being siphoned or enriching the Taliban\". The report that the US State Department referenced was made by the Special Inspector General for Afghanistan Reconstruction (SIGAR). It said that $10.9m of US taxpayer money had been paid to the Taliban-controlled government by partners of USAID in \"taxes, fees, duties, or utilities\". The Taliban government denies that aid money was going into their hands. \"This allegation is not true. The aid is given to the UN, and through them to NGOs in provinces. They identify who needs the aid, and they distribute it themselves. The government is not involved,\" said Suhail Shaheen, the head of the Taliban's political office in Doha. BBC visits closed down US-backed clinic in Afghanistan after aid cuts The Taliban government's policies, especially its restrictions on women, the harshest in the world, have meant that after four years in power, it is still not recognised by most of the world. It's also a key reason donors have been increasingly walking away from the country. The US insists no one has died because of aid cuts. Shahnaz and her baby's deaths are not recorded anywhere. Neither are countless others. The BBC has documented at least half a dozen first-hand, devastating accounts…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckgqdneev1no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "why-man-utd-s-problem-is-not-the-system-it-s-the-personnel",
    "title": "Why Man Utd's problem is not the system, it's the personnel",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Why Man Utd's system is not the problem, their personnel are - Danny Murphy analysis - BBC Sport BBC Homepage Skip to content Accessibility Help Your account Home News Sport Business Innovation Culture Travel Earth Audio Video Live More menu More menu Search BBC Home News Spor…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9a1a/live/c56784a0-91b1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Why Man Utd's system is not the problem, their personnel are - Danny Murphy analysis - BBC Sport BBC Homepage Skip to content Accessibility Help Your account Home News Sport Business Innovation Culture Travel Earth Audio Video Live More menu More menu Search BBC Home News Sport Business Innovation Culture Travel Earth Audio Video Live Close menu BBC Sport Menu Home Football Cricket Formula 1 Rugby U Tennis Golf Athletics Cycling More A-Z Sports American Football Athletics Basketball Boxing Cricket Cycling Darts Disability Sport Football Formula 1 Gaelic Games Golf Gymnastics Horse Racing Mixed Martial Arts Motorsport Netball Olympic Sports Rugby League Rugby Union Snooker Swimming Tennis Winter Sports Full Sports A-Z More from Sport England Scotland Wales Northern Ireland News Feeds Help & FAQs Manchester United Scores & Fixtures Table Why Man Utd's problem is not the system, it's the personnel Published 14 September 2025 1827 Comments I feel like I am repeating myself whenever I talk about Manchester United's problems but the same things keep on happening. They are making the same mistakes, and they are not even that difficult to prevent. I have watched every minute of United's four Premier League games this season and there are certainly areas of improvement, which seems a bizarre thing to say after they have just lost a derby 3-0. I've highlighted the issues with Ruben Amorim's 3-4-2-1 formation since he took charge at Old Trafford last season, and I am not a fan of that shape, but they have worked on it and you can tell. They look more compact as a team now, when they are attacking or defending. They get in quite a good shape and the distances between their lines are much smaller, which makes them harder to play through. Unfortunately for Amorim, the improvements they have made there have been overlooked because of the silly mistakes they are making in conceding goals which are costing them points. When I look at some of the goals they have conceded this season, including Phil Foden's opener for City at Etihad Stadium on Sunday, they are down to selection issues, and players being used in the wrong position, rather than the system itself. Manchester United's Derby Woes & Remembering Ricky Hatton To play this video you need to enable JavaScript in your browser. This video can not be played Media caption, Haaland scores twice as Man City cruise to win against Man Utd 'A simple run by Foden was all it took' In the first half against City, United did well. They won the ball back four or five times high up the pitch and, with a bit more finesse in those counter-attacks, they could have scored themselves. One of the problems with Amorim's 3-4-2-1 is the two holding midfielders can be outnumbered but that did not happen at Etihad Stadium because Bryan Mbeumo and Amad Diallo, who were playing either side of Benjamin Sesko, dropped in. The team narrowed up which helped Bruno Fernandes and Manuel Ugarte in midfield, because there were no big gaps. Most of the time the defence and the midfield were close to each other too, rather than the defence dropping off like they did last season because of a lack of pace or confidence. City did not completely play through them and tear them apart, and that's not how they scored their first goal either. What happened there is that you have got Fernandes, arguably one of the best number 10s in the world, playing in a deeper centre-midfield role as a number eight when his instincts are not defensive. A simple run off the back from Foden was all it took to lose him. Image source, BBC Sport Image caption, Bruno Fernandes was watching Jeremy Doku, not Phil Foden when the Belgian winger reached the byeline Yes, you could argue Luke Shaw might have done better when the ball was in the box but Foden is free by that point, because Fernandes switched off. As I highlighted on Match of the Day, he is ball-watching when the cross comes over. I don't think he is lazy, because he is back in position. He is just not used to spotting runners and seeing danger. Image source, EPA Image caption, Doku put over a cross and found the unmarked Foden who was bursting into the box That's the second time he has cost United a goal this season, because he also failed to track Emile Smith Rowe for Fulham's equaliser when they dropped points at Craven Cottage in August. The irony with Fernandes against City was that certain aspects of his play in the middle of the pitch were extremely good. It's not a totally stupid idea to play him there, because his passing from deep is tremendous to find the runners ahead of him, and he is technically excellent as well as being brave on the ball. The problem is what happens without it. A player of his intelligence should be able to learn to switch on a bit more in defensive situations too, but it's clearly not happening. You just can't play in that role if that's a regular occurrence for you, and it is down to the manager to recognise that and put players in there who do it better. More square pegs in round holes? To play this video you need to enable JavaScript in your browser. This video can not be played Media caption, Man Utd a team with round pegs in square holes - analysis Fernandes is not the only United player I look at and think he is a square peg in a round hole. Shaw has played in a back three before but he has spent the majority of his career as a dynamic left-back and it feels like he is being shoe-horned into a centre-back position under Amorim. Again you can argue he should have the quality to adapt, and for Jeremy Doku to beat him so easily for the first goal was poor defending…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/football/articles/cx2x70gqllro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "trade-war-and-faltering-economy-five-challenges-facing-canada-s-mark-c",
    "title": "Trade war and faltering economy - five challenges facing Canada's Mark Carney",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Five challenges facing Canada's Mark Carney Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Irel…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b744/live/b03b4e10-91ff-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Five challenges facing Canada's Mark Carney Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Five challenges facing Canada's Mark Carney 8 hours ago Share Save Jessica Murphy BBC News, Toronto Share Save Bloomberg via Getty Images Mark Carney became the first new Canadian prime minister in nine years when he was elected six months ago A trade war with its largest economic partner, a faltering economy - and a lot of promises to deliver on. These are only some of the high-stake tests facing Canadian Prime Minister Mark Carney as parliament returns for the autumn sitting on Monday. Here is a look at some of the political pressures on his Liberal government's horizon. Voters want action on lofty pledges Carney's Liberals made a series of lofty promises during the recent election campaign, from making Canada's economy the strongest in the G7 to \"turbo-charging\" major infrastructure projects and massively ramping up housing development. Now, voters are ready to see progress. Canadians \"will be looking for clear actions that make a difference, and that's where the rubber will really hit the road for Mark Carney\", said Sébastien Dallaire, an executive vice-president with polling firm Leger. There has been some movement on big issues. Last week, the prime minister unveiled the first series of \"nation-building\" projects that Ottawa will review for fast-track approvals - a key part of his wider economic agenda. They include a plan to double production of liquefied natural gas (LNG) at a British Columbia plant, the expansion of part of Montreal's port, and building a small modular nuclear reactor in Ontario. Carney has also announced $13bn (£6.9bn, $9.4bn) for a new federal housing agency to help build new homes, and vowed to diversify trade away from the US. In politics it's usually prudent to under-promise and over-deliver, said Marci Surkes, chief strategy officer at public affairs firm Compass Rose and a former policy director to Carney's predecessor, Justin Trudeau. \"Mr Carney has taken quite a different tack, where he has really set the bar very high in terms of expectations,\" she said. She added: \"There's already impatience from those who are waiting to see results.\" Economic woes surpass Trump fears Anxiety around an unpredictable US president helped propel Carney to power last April. Donald Trump has since imposed punishing tariffs on some sectors of the economy, like steel and autos, but has granted a majority of Canadian goods a broad tariff exemption under the current US-Mexico-Canada free trade deal. Mr Dallaire said Canadians know it won't be \"an easy ride\" for the next few years. \"The question has turned to: 'OK, what now?'\" Recent opinion polling suggests that voters are feeling less panicked by Trump but increasingly worried about the economy. Canada's unemployment rate rose to 7.1% last month, a level not seen since 2016, excluding the pandemic, and economic growth slowed sharply over the summer, contracting by 1.6%. A poll released by Abacus Data this month indicates that six in 10 respondents felt the Ottawa government was too focused on the US president at the expense of pressing concerns like housing, healthcare, and affordability. Still, for Carney, there's some silver lining. Many don't blame him directly for the economic shocks of Trump's policies - but they will be watching how the prime minister navigates what he has called a \"rupture\" in the global economy. \"A souring economy will become a drag on the popularity of the government, but it really depends to what extent it happens and to what extent Canadians see visible changes,\" said Mr Dallaire. What tariffs has Trump announced and why? An opposition leader back in the saddle Pierre Poilievre is making his return to the House of Commons. The Conservative leader lost his long-held seat in the April election to a Liberal challenger and was forced to spend his summer seeking a path back to parliament. In August, he won a by-election in Alberta, securing a new seat and a chance to be a foil for Carney in the House. \"The real fighting match is about to begin, and Mr Carney is going to have to swat away or figure out how to handle the punches that will be coming at him,\" said Ms Surkes. In an open letter to Carney last week, Poilievre set the stage, saying: \"So far, you have been judged only by the lofty things you have promised to do one day, not by what you have done.\" Poilievre has sharply focused his message on cost-of-living and crime issues and he plans to target the Liberals - who have been in power since 2015 - on their record, as well as on immigration. That includes pushing them on the number of temporary foreign workers allowed into the country, a programme that has seen a significant expansion in recent years. An 'austerity' warning An \"austerity and investment\" federal budget is expected later this autumn - a financial balancing act Carney has said is possible with \"discipline\". The prime minister has criticised government spending under Trudeau as \"unsustainable\"…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ckg2700vzrko?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "play-now",
    "title": "Play now",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Play: Cooler Than Me? - BBC Weather BBC Homepage Skip to content Accessibility Help Your account Home News Sport Business Innovation Culture Travel Earth Audio Video Live More menu More menu Search BBC Home News Sport Business Innovation Culture Travel Earth Audio Video Live C…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9457/live/a4b0d300-8366-11f0-ab3e-bd52082cd0ae.png",
    "source": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Play: Cooler Than Me? - BBC Weather BBC Homepage Skip to content Accessibility Help Your account Home News Sport Business Innovation Culture Travel Earth Audio Video Live More menu More menu Search BBC Home News Sport Business Innovation Culture Travel Earth Audio Video Live Close menu BBC Weather Menu Home Weather Warnings Flood Warnings Monthly Outlook Coast and Sea Help Play: Cooler Than Me? Published 12 August 2025 Updated 8 hours ago What information do we collect from this quiz? Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all? Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist. You can find the latest forecast on the BBC Weather website . Want to know how Cooler Than Me? works? Read the FAQ . Features Play: Cooler Than Me? Published 8 hours ago Strong winds sweeping across UK - but why isn't this Storm Amy? Published 3 hours ago Rising seas will threaten 1.5 million Australians by 2050 - report Published 7 hours ago Jay Wynne, former BBC weather presenter, dies aged 56 Published 2 days ago Five celestial events to look out for this autumn Published 5 hours ago Weather for the week ahead Video Weather for the week ahead Published 1 day ago More than two million people evacuated from deadly floods in Pakistan Published 3 days ago Why has the Atlantic hurricane season gone 'remarkably' quiet? Published 4 days ago Your pictures of the 'Blood Moon' total lunar eclipse Published 7 days ago Elsewhere on the BBC Zara McDermott explores the dark side of Thailand Why was this French film so controversial? Preview the new drama from the creator of Happy Valley Soldier-turned-writer Andy McNab chooses his desert island tracks Home News Sport Business Innovation Culture Travel Earth Audio Video Live Terms of Use About the BBC Privacy Policy Cookies Accessibility Help Parental Guidance Contact the BBC BBC emails for you Advertise with us Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "cardiff-man-still-in-prison-20-years-after-stealing-phone",
    "title": "Cardiff man still in prison 20 years after stealing phone",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Cardiff man still in prison 20 years after stealing mobile phone Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics Engla…",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/38a0/live/a7d4ce20-91f2-11f0-aa72-1754a564291f.jpg",
    "source": "https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Cardiff man still in prison 20 years after stealing mobile phone Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList To the Ends of The Earth Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Man still in prison 20 years after stealing phone 8 hours ago Share Save Anna Lewis and Dan Moffat BBC Wales Share Save Leroy Douglas Leroy Douglas has been in prison since 2005 after being given an indeterminate sentence The father of a Cardiff man who has spent 20 years in prison after stealing a mobile phone has said his son has served a \"life sentence\" behind bars. Leroy Douglas, 44, was handed a minimum term of two-and-a-half years in 2005 for robbery, but remains in custody as he is subject to an indeterminate sentence of Imprisonment for Public Protection (IPP). The controversial measure was scrapped in 2012 , but campaigners are calling for those currently serving an IPP to be resentenced and have filed a case against the UK before the United Nations. The Ministry of Justice said it released the highest annual number of IPP prisoners on record last year with additional support given to those in custody. Man still in jail 20 years after laptop robbery 'My brother will die in jail without law change' Prison crisis will 'force' indeterminate sentence change IPPs are a type of sentence which means inmates can be detained indefinitely if the parole board decides it is not safe to release them . They were designed to detain offenders who posed a \"significant\" risk of causing serious harm to the public, but faced criticism after being handed out for less serious crimes. Defendants must serve a minimum term before being considered for release by the parole board but this is not automatic. They are also subject to licence conditions which they must follow or risk being recalled to prison once they are released. Anthony Douglas, 63, said his son was a \"normal kid\" growing up who was \"easily led\" to make bad decisions. He said Leroy Douglas, who is now in HMP Stocken in Stretton, Rutland started to get into trouble along with friends and received convictions for crimes including for shoplifting as a teenager and young man. However, he said it \"all escalated\" when the dad-of-two was sentenced for stealing a mobile phone belonging to his cousin's boyfriend in 2005. Instead of a fixed term two and a half year custody sentence, he was handed an IPP, which his family said was a \"shock to everyone\". \"He got two-and-a-half years and the next thing I know is that he's still in there all these years later,\" Mr Douglas said. \"I expected him to do half of the two-and-a-half years and start fresh again.\" Family photo Leroy, pictured with his sister Natalie, was a typical child before he started getting into trouble Mr Douglas has not been able to make the journey to visit his son in person since he was sentenced, but speaks to him regularly on the phone. While in custody, Leroy Douglas had to be told of his daughter's death after she suffered a fatal brain haemorrhage aged 20, as well as losing his grandparents and other family members, something which his dad said had affected his mental health. According to Mr Douglas he has been moved to different facilities a number of times, which has resulted in him having to repeat training and courses needed for him to be considered for release. \"We are not the only ones suffering, the whole family is with him being in prison,\" he said. Mr Douglas admitted his son had struggled with poor behaviour while in custody, but said being in a prison environment from a young age had created the \"product that he is today\". \"His family is outside, so inside the only role models he's got are those who are already in prison,\" he said. \"He started to act out because he doesn't think it's fair that he's been kept in there that long, so that's had an impact on his behaviour.\" While Leroy Douglas has suffered with addiction in the past, his dad said he had tested negative for drugs while in prison. Natalie Douglas Natalie and Anthony say Leroy has had to deal with losing loved ones while in prison Andrew Taylor, criminal barrister at Apex Chambers, has represented about 10 clients who were given IPP sentences. He described the situation as \"draconian and unfair\". \"I've had clients who on the face of it without IPP sentences might have faced fixed term sentences of four or five years which gives them a definite release date,\" he said. \"But if you have an IPP it's effectively for life. Many subjected to them get recalled sometimes for the most minor sentences.\" Mr Taylor said there needed to be a \"large scale resentencing\" of people who were subject to IPPs. While he said not all those subject to them would otherwise have been released immediately, \"there was no longer a need to have people locked up like this\". \"These people become hopeless, they have no hope on getting…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c5yev505n5wo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "tory-mp-and-shadow-minister-danny-kruger-defects-to-reform",
    "title": "Tory MP and shadow minister Danny Kruger defects to Reform",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Conservative MP Danny Kruger has become the first sitting Conservative MP to defect to Reform UK.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2451/live/4ddef9c0-9221-11f0-84c8-99de564f0440.jpg",
    "source": "https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Tory MP and shadow minister Danny Kruger defects to Reform</h1>\n    <p>Conservative MP Danny Kruger has become the first sitting Conservative MP to defect to Reform UK.</p>\n    <p>Kruger has been an MP since 2019, and sat on Tory leader Kemi Badenoch's team as a shadow work and pensions minister.</p>\n    <p>\"The Conservatives are over,\" he told a press conference, sitting alongside Reform party leader Nigel Farage.</p>\n    <p>Kruger said he had been \"honoured\" to be asked to help Reform prepare for government, and said he hoped that Farage would be the next prime minister.</p>\n    <p>The East Wiltshire MP - who has said he would not be triggering a by-election - said the Conservatives were no longer the main party of opposition.</p>\n    <p>He said: \"There have been moments when I have been very proud to belong to the Tory party\", but added: \"The rule of our time in office was failure.</p>\n    <p>\"Bigger government, social decline, lower wages, higher taxes and less of what ordinary people actually wanted.\"</p>\n    <p>He added: \"This is my tragic conclusion, the Conservative Party is over, over as a national party, over as the principal opposition to the left.\"</p>\n    <p>Although he said he had \"great regard\" for Badenoch, he said the Tory party had a \"toxic brand\", adding: \"We have had a year of stasis and drift and the sham unity that comes from not doing anything bold or difficult or controversial.\"</p>\n    <p>Describing his move leaving a party he has been a member of for 20 years as \"personally painful\", he said his \"mission\" with Reform would be to \"not just to overthrow the current system, it is to restore the system we need\".</p>\n    <p>Responding to the news of the defection, Badenoch said: \"Danny has made his case very clear, that this is not about me.</p>\n    <p>\"I can't be distracted by that, and I'm not going to get blown off course by these sort of incidents.</p>\n    <p>\"I know this is the sort of thing that is going to happen while a party is changing. I'm making sure people understand what Conservative values are.\"</p>\n    <p>Kruger's defection is damaging for Badenoch, not only as a Tory thinker and veteran, but also as the most significant among several from the party moving to Reform.</p>\n    <p>Speaking after the press conference, Kruger told the BBC he had come to the conclusion the Conservative Party remains \"the same party that failed the people in the last government\" and doesn't have \"any chance\" of winning the next election.</p>\n    <p>A few weeks ago, Kruger said he agreed with Reform on many issues except public spending, <a href=\"https://hansard.parliament.uk/Commons/2025-07-15/debates/5A153C4B-4507-48BB-B340-F8C9CDC85C17/WelfareSpending?highlight=%22drunken%22#contribution-4FBEEF75-D201-473F-88C0-4AA6CE76E83C\">telling MPs in July</a>: \"There is a problem: they would spend money like drunken sailors.\"</p>\n    <p>Asked about his comment, Kruger said: \"I think we're all sober sailors now, I'm glad to say, because since I said that Reform have corrected their position on welfare spending.</p>\n    <p>\"I was very concerned that we need to really reduce overall benefit spending... Nigel made clear he also wants to bring down overall benefit spending but he does want to support families with children.\"</p>\n    <p>Kruger is the second sitting MP to join Reform UK. Lee Anderson, who was previously a Tory MP, sat as an independent before joining Reform in 2024.</p>\n    <p>Reform now have five MPs in the Commons, having seen two of their MPs elected in the 2024 general election, Rupert Lowe and James McMurdock, leave the party.</p>\n    <p>His previous jobs include serving as former Conservative Prime Minister David Cameron's speechwriter, penning the \"hug a hoodie\" speech, and as former political secretary to Boris Johnson when he was prime minister.</p>\n    <p>Kruger spoke in a <a href=\"https://www.bbc.co.uk/news/uk-england-bristol-62030114\">2022 Parliamentary debate</a> about the US's abortion ban and told MPs he disagreed that pregnant women had an \"absolute right to bodily autonomy\" and that he didn't understand why the UK was \"lecturing\" the US.</p>\n    <p>In 2023, <a href=\"https://www.bbc.co.uk/news/uk-politics-65612836\">Kruger was one of the speakers </a>at a National Conservatism Conference, an event organised by a right-wing think tank from the United States, and made comments about the role of conventional family values in society.</p>\n    <p>The evangelical Christian told delegates that marriages between men and women were \"the only possible basis for a safe and successful society\" and one that \"wider society should recognise and reward\".</p>\n    <p>Rishi Sunak, the Conservative prime minister at the time, distanced himself from the remarks.</p>\n    <p>Kruger is the son of TV chef Prue Leith and an Old Etonian, who studied at Edinburgh and Oxford Universities before becoming a director at the Centre for Policy Studies.</p>\n    <p>A Labour Party spokesperson said: \"Nigel Farage can recruit as many failed Tories as he likes – it won't change the fact that he has no plan for Britain.</p>\n    <p>\"Britain deserves better than Reform's Tory tribute act that would leave working people paying a very high price.\"</p>\n    <p>Liberal Democrat deputy leader Daisy Cooper labelled the Conservative Party \"a shell of its former self\" and said Badenoch had pushed lifelong Tories towards her party \"in their droves\".</p>\n    <p>\"Nigel Farage's party is shapeshifting into the Conservatives in front of our very eyes,\" she said.</p>\n    <p>\"It is getting to the point where the only difference between them is just a slightly lighter shade of blue.\"</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4c9f/live/d67d32f0-6b8f-11f0-af20-030418be2ca5.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ce802dmgnyro?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "starmer-facing-leadership-questions-after-mandelson-sacking",
    "title": "Starmer facing leadership questions after Mandelson sacking",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Sir Keir Starmer is facing mounting pressure from within the Labour party over his handling of the sacking of the US ambassador Peter Mandelson.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d52e/live/11602670-9223-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/ce32qepq12qo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Starmer facing leadership questions after Mandelson sacking</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b7d2/live/de6d3750-91d0-11f0-b391-6936825093bd.jpg.webp\" alt=\"Getty Images Sir Keir Starmer and the UK's former ambassador to the US Lord Mandelson in Washington, DC on 26 February 2025.\"/>\n    <p>Sir Keir Starmer is facing mounting pressure from within the Labour party over his handling of the sacking of the US ambassador Peter Mandelson.</p>\n    <p>Labour MPs are expressing public and private frustration with the prime minister's leadership, as he prepares to welcome US President Donald Trump on a state visit this week.</p>\n    <p>Lord Mandelson was sacked last week after a cache of emails reported by Bloomberg showed supportive messages he sent after convicted paedophile Jeffrey Epstein pleaded guilty to sex offences.</p>\n    <p>Labour backbencher Richard Burgon told Radio 4's Today programme Sir Keir would be \"gone\" if May's elections in Scotland, Wales and parts of England go badly for Labour.</p>\n    <p>The scandal, coming so soon after Angela Rayner's resignation as deputy prime minister, has encouraged some Labour MPs to become more vocal about their frustrations with the prime minister's judgement and the wider Downing Street operation.</p>\n    <p>Burgon is a longstanding left-wing critic of Starmer's leadership but his comments nevertheless underline the scale of discontent within Labour.</p>\n    <p>Burgon said: \"I think it's inevitable that if May's elections go as people predict and the opinion polls predict, then I think Starmer will be gone at that time.</p>\n    <p>\"In terms of where we are now, it feels like we're years and years into an unpopular government rather than a year into a government that's just got rid of the Conservatives.</p>\n    <p>\"We're losing votes to the left, we're going to be losing seats to the right.\"</p>\n    <p>His words echoed a weekend of briefing by Labour MPs in public and in private questioning Sir Keir's leadership.</p>\n    <p>Labour MP Helen Hayes told BBC Radio 4's The Westminster Hour on Sunday that if the sacking were to affect the party's chances in the May 2026 local elections, there would be questions about Sir Keir's leadership.</p>\n    <p>\"Questions about the nature of the leadership and whether things can continue as they are, but we're not at that point now,\" she said.</p>\n    <p>Hayes added that she felt \"devastated\" about Lord Mandelson, but said she believed he should not have been appointed in the first place.</p>\n    <p>With Trump's state visit this week, and the Labour conference at the end of the month, Downing Street will be hoping to reset the agenda.</p>\n    <p>This week also marks the <a href=\"https://www.bbc.co.uk/news/articles/cvgqe26jvnno\">first flight sending asylum seeker deportees to France</a> under the \"one-in-one-out\" deal signed in July.</p>\n    <p>Downing Street sources acknowledge that Sir Keir's upcoming Labour party conference speech must make an impact and say MPs would be \"left in no doubt what he stands for and what drives him\".</p>\n    <p>But this is the second week in a row the prime minister has begun by trying to draw a line under a scandal that led to a high profile exit, and move to a new chapter.</p>\n    <p>The mood in the parliamentary Labour party is bleak, and there are fears the past two weeks may have crystalised MPs' concerns.</p>\n    <p>Government minister Baroness Smith, who served as home secretary under Gordon Brown, told the BBC in her experience \"there will always be people in the Labour party worried about us going further and faster\".</p>\n    <p>\"It is difficult at the moment given people's insecurity and concern sometimes for mainstream politicians to cut through.\"</p>\n    <p>She also hit back at Burgon's prediction that Sir Keir will be replaced next year, telling BBC Breakfast the backbencher had never supported the prime minister.</p>\n    <p>She admitted that the sacking of Lord Mandelson as the ambassador to the US was \"not what we would have wanted to happen in the run up to this week\", but said the PM was doing a good job.</p>\n    <p>The BBC reported on Sunday <a href=\"https://www.bbc.co.uk/news/articles/cn82rdmzr20o\">Sir Keir explicitly asked Mandelson</a> about his links to the paedophile before deciding to appoint him as ambassador to the US.</p>\n    <p>Meanwhile, the Conservatives have demanded the prime minister release documents relating to Mandelson's appointment.</p>\n    <p>In the letter to the prime minister, Tory MP Alex Burghart questioned what and when Sir Keir knew of Mandelson's friendship with Epstein before defending the former ambassador during Prime Minister's Questions last Wednesday.</p>\n    <p>He said that the scandal had exposed the PM's \"appalling judgement\".</p>\n    <p>\"He ignored warnings about Peter Mandelson's relationship with Jeffrey Epstein, forced through his appointment, and is avoiding scrutiny about what he knew,\" Burghart wrote.</p>\n    <p>The Conservative MP's letter also demanded the release of what he called the \"Mandelson-Epstein Files\" - government correspondence and internal documents related to the pair - and for Sir Keir and his chief of staff Morgan McSweeney to give evidence to Parliament.</p>\n    <p>Downing Street have already stressed that the prime minister only knew the contents of the emails on Wednesday evening and acted swiftly, sacking Mandelson within hours.</p>\n    <p>Lib Dem leader Sir Ed Davey has warned Sir Keir's leadership is \"hanging by a thread\" and demanded the prime minister explain Mandelson's appointment in parliament.</p>\n    <p>Labour is facing a polling challenge from Reform UK, as leader Nigel Farage claimed Sir Keir's judgement had left him \"ever more distanced\" from Labour's roots.</p>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4c9f/live/d67d32f0-6b8f-11f0-af20-030418be2ca5.png.webp\" alt=\"Thin, red banner promoting the Politics Essential newsletter with text saying, “Top political analysis in your inbox”. There is also an image of the Houses of Parliament.\"/>\n    <p><a href=\"https://www.bbc.co.uk/newsletters/z7hc239\">Sign up for our Politics Essential newsletter</a> to keep up with the inner workings of Westminster and beyond.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/ce32qepq12qo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "how-adolescence-pulled-off-an-emmys-sweep",
    "title": "How Adolescence pulled off an Emmys sweep",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Many truly great works of art over the years have been shot in one take - from World War One epic 1917 to the Spice Girls' music video for Wannabe.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/99f1/live/b73f9a60-9216-11f0-b391-6936825093bd.jpg",
    "source": "https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>Many truly great works of art over the years have been shot in one take - from World War One epic 1917 to the Spice Girls' music video for Wannabe.</p>\n<p>But a lot of the most famous examples - including that 90s girlband masterpiece - weren't actually shot continuously in real life. They instead simply used some clever editing to made it look like they had been.</p>\n<p>One of the many notable things about Netflix's Adolescence, <a href=\"https://www.bbc.co.uk/news/articles/clyxn4wqkq0o\">which has just won several top prizes at the Emmy Awards,</a> was that all four of its hour-long episodes really did involve filming everything in one go, without interruption.</p>\n<p>It's a shooting technique which was widely praised for making the viewing experience more gripping and immersive when the series was released to huge acclaim in March.</p>\n<p>Audiences were instantly drawn in to the show's bracing depiction of a teenage boy who is accused of stabbing a female classmate. But the series was far more than another procedural crime drama.</p>\n<p>Its exploration of the impact of smartphones and social media on teenagers captured the zeitgeist, tapping into the fears of parents around the world.</p>\n<p>The drama's breakout star was Owen Cooper, a Warrington-born actor who was only 14 when the series was filmed.</p>\n<p>Cooper played the central character, Jamie Miller, a schoolboy who is abruptly woken up by the police storming his house in the show's first episode.</p>\n<p>They find him in his bedroom and place him under arrest. \"You're making a big mistake,\" insists the boy's dad, played by Stephen Graham, who also co-created the series with writer Jack Thorne.</p>\n<p>But as the episode unfolds, it's clear there is no mistake. Damning CCTV evidence ultimately proves Jamie's guilt, and Adolescence begins to examine its key questions: what led to this murder, and what motive could a teenager possibly have had.</p>\n<p>It was a storyline based on real events. \"I read an article about a young boy who'd stabbed a young girl to death, and it made me feel cold,\" <a href=\"https://youtu.be/Wcu3t4yOQbE?si=-lJLGBjecSfL-5RH&amp;t=104\">Graham told Radio X's Chris Moyles</a>.</p>\n<p>A similar but separate teen stabbing hit the headlines just a couple of months later. \"And these two incidents were at the opposite ends of the country,\" Graham noted.</p>\n<p>\"And I just thought, why is this happening? And not just because I'm a father, but I think any human being with a moral compass can look at that situation and think, what's going on with society today that we're in this era where these young boys are stabbing young girls to death?\"</p>\n<p>Graham knew the success of the show would hinge on the young actor chosen to play Jamie, and casting director Shaheen Baig struck gold with Cooper - who had first become interested in acting around the age of 10.</p>\n<p>In a joint interview with Baig, <a href=\"https://www.netflix.com/tudum/features/owen-cooper-shaheen-baig-adolescence\">Cooper explained:</a> \"I don't know where it came from, but I asked my mum and dad if I could start going to drama classes, and I think they were a bit shocked by it because I've always wanted to become a footballer.</p>\n<p>\"I still play football now, and then asking them if I wanted to start drama lessons, it was a bit out of the blue, really.\"</p>\n<p>Baig recalled: \"It was really [about] trying to find somebody with the emotional register to be able to play Jamie.</p>\n<p>\"Owen sent us an improv tape, and I remember first watching that, and thinking, \"OK. He looks great on camera, but also his improv was really smart.\" It felt very natural.\"</p>\n<p>Many of the headlines surrounding Cooper claimed he had never acted before. But that wasn't actually true.</p>\n<p>\"It has frustrated us a bit,\" said drama teacher Esther Morgan, who helped run the weekly acting classes Cooper had attended for two years in Didsbury, Manchester.</p>\n<p>The Adolescence team, <a href=\"https://www.bbc.co.uk/news/articles/cp91yz4p44vo\">she told BBC News in April,</a> had approached the Drama MOB school while casting the series, asking to see tapes of their \"strongest northern boys\".</p>\n<p>\"They kept coming back for Owen,\" she recalled. \"He just had something.\"</p>\n<p>It was true that Cooper didn't have any TV or film credits to his name, but not that he had never tried his hand at acting.</p>\n<p>In fact, Morgan suggested Cooper's comfort with one-take shooting was partly due to the drama school's focus on improvisation.</p>\n<p>When the show launched, Morgan said: \"It felt amazing, but I didn't realise it would be as good as it was, I didn't expect it to be talked about so much.\"</p>\n<p>For several weeks, the series dominated the news agenda, and eventually went on to become Netflix's second most watched English-language series ever (after the first season of Wednesday).</p>\n<p>\"We wanted to pose a question that got people talking on their sofas, in pubs, in schools, maybe even in parliament,\" <a href=\"https://www.theguardian.com/tv-and-radio/2025/mar/18/adolescence-writer-jack-thorne-incel-culture-netflix\">Thorne said.</a></p>\n<p>The government subsequently supported Netflix's proposal to make the drama available to schools. Prime Minister Sir Keir Starmer said there was a need to tackle the \"emerging and growing problem\" the show raised.</p>\n<p>Many critics shared the sentiment in their reviews. \"If you're a parent to a school-age boy... it will chill your blood\" <a href=\"https://www.telegraph.co.uk/tv/2025/03/19/adolescence-review-it-will-chill-the-blood-of-any-parent-of/\">said the Telegraph's Anita Singh</a>. It is a drama so quietly devastating that I won't forget it for a very long time.\"</p>\n<p>Clearly, Emmy voters didn't forget about it either. The show's impact was so undeniable that it was seen as the dead-cert for best limited series.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cd72d98gj58o?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "us-farmers-are-being-squeezed-and-it-s-testing-their-deep-loyalty-to-t",
    "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "On a scorchingly hot day in the American Midwest, Tim Maxwell is voicing his fears about the future of farming.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/089a/live/d8611090-920f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "source": "https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<p>\n      <strong>On a scorchingly hot day in the American Midwest, Tim Maxwell is voicing his fears about the future of farming.</strong>\n    </p>\n<p>The 65-year-old has worked the fields since he was a teenager. He now owns a grain and hog farm near Moscow, Iowa - but he's unsure about its prospects.</p>\n<p>\"I'm in a little bit of a worried place,\" says Mr Maxwell, who wears a baseball cap bearing the logo of a corn company.</p>\n<p>He is concerned that American farmers aren't able to sell their crops to international markets in the way they could in previous years, in part because of the fallout from President Trump's tariffs.</p>\n<p>\"Our yields, crops and weather are pretty good - but our [interest from] markets right now is on a low,\" he says. \"It's going to put stress on some farmers.\"</p>\n<p>His fears are not unique. US agricultural groups warn that American farmers are facing widespread difficulty this year, mostly due to economic tensions with China. Since April, the two countries have been locked in a trade war, causing a sharp fall in the number of Chinese orders for American crops.</p>\n<p>American farmers are wounded as a result, economists say. The number of small business bankruptcies filed by farmers has reached a five-year high, according to data compiled by Bloomberg in July.</p>\n<p>With all this economic pain, rural areas could well have turned against Trump. But that doesn't seem to be happening.</p>\n<p>Rural Americans were one of the president's most loyal voting blocs in last year's election, when he won the group by 40 percentage points over Kamala Harris, beating his own margins in 2020 and 2016, according to Pew Research analysis.</p>\n<p>Polling experts say that in the countryside, he is still broadly popular.</p>\n<p>Mr Maxwell says he is sticking with Trump, despite his own financial worries. \"Our president told us it was going to take time to get all these tariffs in place,\" he says.</p>\n<p>\"I am going to be patient. I believe in our president.\"</p>\n<p>So why do so many farmers and other rural Americans broadly continue to back Trump even while feeling an economic squeeze that is driven in part by tariffs - the president's signature policy?</p>\n<h2>Farmers on a 'trade and financial precipice'</h2>\n<p>If you want a window into rural America, the Iowa State Fair is a good start. The agricultural show attracts more than one million visitors over 10 days.</p>\n<p>There is candy floss; deep-fried hot dogs on a stick for $7 (£5) - known as \"corn dogs\"; an antique tractor show; a competition for the biggest boar.</p>\n<p>But when the BBC visited last month, there was another topic of conversation: tariffs.</p>\n<p>\"A lot of people say he's just using tariffs as a bargaining chip, as a bluff,\" says Gil Gullickson, who owns a farm in South Dakota and edits an agriculture magazine.</p>\n<p>\"But I can say: history proves that tariffs don't end well.\"</p>\n<p>In April, what he termed \"liberation day\", Trump imposed sweeping tariffs on most of the world, including a 145% tariff on China.</p>\n<p>In response, China put a retaliatory 125% tariff on American goods - a blow to farmers in the American Midwest, sometimes known as the \"corn belt\", many of whom sell crops to China.</p>\n<p>Last year Chinese companies bought $12.7bn (£9.4bn) worth of soybeans from America, mostly to feed their livestock.</p>\n<p>September is harvest season, and the American Soybean Association (ASA) has warned that soybean orders from China are way below where they should be at this point in the year.</p>\n<p>Tariffs have fluctuated dramatically since they were introduced - and the uncertainty is proving tough for farmers, says Christopher Wolf, a professor of agricultural economics at Cornell University.</p>\n<p>\"China is just so big that when they buy things, it matters - and when they don't, it matters.\"</p>\n<p>The cost of fertiliser has rocketed, too - partly because of trade disputes with Canada, which has raised the cost of potash, a salt imported from Canada by American farmers and used in fertiliser.</p>\n<p>Jon Tester, a former Democrat Senator of Montana, who is a third-generation farmer, told a US news station earlier this month: \"With all these tariffs the president's put on, it's interrupted our supply chain… it's increased the cost of new equipment… and because of the trade and tariffs, a lot of customers have said to heck with the United States…</p>\n<p>\"The people who are new to agriculture, those young farmers who haven't saved money for times like this, they're going to be in trouble and a lot of those folks are going to go broke.</p>\n<p>\"And if this continues, a lot of folks like me are going to go broke too.\"</p>\n<p>American farmers already suffer from high levels of stress. They are more than three times more likely than average to die by suicide, according to a paper by a charity, the National Rural Health Association, which analysed a period before Trump's presidency.</p>\n<p>In a letter to the White House, Caleb Ragland, president of the ASA, warned of a tipping point: \"US soybean farmers are standing at a trade and financial precipice.\"</p>\n<h2>Trump: 'Our farmers are going to have a field day'</h2>\n<p>Supporters of President Trump say that his tariffs will help American farmers in the long run, by forcing countries like China to come to the negotiating table and agree new deals with the US over agriculture.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/cjedvwed1xgo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "ricky-hatton-s-family-pay-tribute-saying-his-heart-was-as-big-as-his-s",
    "title": "Ricky Hatton's family pay tribute, saying his heart was as big as his smile",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "Ricky Hatton won world titles at light-welterweight and welterweight",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c543/live/9bd96d00-91f8-11f0-8a32-a34fe17ac401.jpg",
    "source": "https://www.bbc.com/sport/boxing/articles/cvg9q28l49no?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Hatton's 'heart as big as his smile' says family</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/c543/live/9bd96d00-91f8-11f0-8a32-a34fe17ac401.jpg\" alt=\"Ricky Hatton smiles\"/>\n    <p>Ricky Hatton won world titles at light-welterweight and welterweight</p>\n    <ul>\n      <li>Published</li>\n    </ul>\n    <p>\n      <strong>Ricky Hatton's family has paid tribute to the former world champion, who was found dead at the age of 46 at his home in Manchester on Sunday.</strong>\n    </p>\n    <p>\"He had a heart as big as his smile, and his kindness, humour and loyalty touched everyone who was lucky enough to know him,\" the Hatton family said.</p>\n    <p>\"As a family, our loss is immeasurable, and words cannot truly capture the pain we feel. Yet in the midst of our grief, we have been deeply moved by the overwhelming outpouring of love and support.</p>\n    <p>\"Richard's memory will forever remain in our hearts, in the hearts of his fans, and in the sport he loved so dearly.\"</p>\n    <p>A Greater Manchester Police spokesperson said \"there are not currently believed to be any suspicious circumstances\" surrounding Hatton's death.</p>\n    <p>Hatton, who won 45 of his 48 professional bouts during his 15-year career, was world champion at light-welterweight and welterweight, and last fought professionally in 2012.</p>\n    <p>\"Richard was so much more than a world champion. To us he was simply 'Richard', our son. A loving father, grandfather, and brother, and a true friend to many,\" the Hatton family added.</p>\n    <p>\"He inspired generations with his fighting spirit, his humility, and his love for the sport. But beyond the titles, the nights to remember, and the roar of the crowd, he remained the same down-to-earth Richard who never forgot where he came from.</p>\n    <p>\"It has been a source of great comfort to see just how many lives Richard touched, and how widely he was admired and respected.</p>\n    <p>\"At this time, we kindly ask for privacy as we come to terms with life without him. In the days and weeks ahead, we will take strength from one another and from the knowledge that Richard's legacy - both in boxing and as a man - will continue to live on.\"</p>\n    <ul>\n      <li>\n        <ul>\n          <li>Published19 hours ago</li>\n        </ul>\n      </li>\n      <li>\n        <ul>\n          <li>Published20 hours ago</li>\n        </ul>\n      </li>\n      <li>\n        <ul>\n          <li>Published19 hours ago</li>\n        </ul>\n      </li>\n    </ul>\n    <h2>Manchester to honour 'much loved' boxer properly - Burnham</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/ace/standard/819/cpsprodpb/df3d/live/50e36780-921e-11f0-8fd6-f3e5d0b160a2.jpg\" alt=\"Ricky Hatton tries to avoid a punch from Floyd Mayweather\"/>\n    <p>Ricky Hatton (left) lost for the first time when he was beaten by Floyd Mayweather (right) in Las Vegas in 2007</p>\n    <p>Nicknamed 'the Hitman', his all-action style saw Hatton became one of Britain's most popular fighters, with a loyal following.</p>\n    <p>Those fans travelled in huge numbers to watch Hatton fight, with more than 30,000 heading to Las Vegas for his title bout with Floyd Mayweather in 2007.</p>\n    <p>Greater Manchester mayor Andy Burnham praised Hatton, who was a hugely popular figure in his home city.</p>\n    <p>\"Ricky was much loved by so many in Greater Manchester. He was the kind of person who would always turn up for people, supporting so many causes,\" Burnham posted on X.</p>\n    <p>\"He made us smile and made us proud. We will find a way of honouring him properly. Rest in peace, Champ.\"</p>\n    <p>Manchester City - the club Hatton proudly supported - paid tribute with a minute's appreciation before Sunday's meeting with Manchester United at Etihad Stadium.</p>\n    <p>A <a href=\"https://www.bbc.com/news/articles/c2370j9x58jo\">10-bell salute to Hatton</a> was also made at the World Boxing Championships at the M&amp;S Bank Arena in Liverpool.</p>\n    <p>Former world champion Barry McGuigan, who became a trainer and promoter after retiring in 1989, told BBC Radio 5 Live that he used to go on training runs with Hatton.</p>\n    <p>\"He [Hatton] had a huge following, he had a magnetic and engaging personality outside the ring too,\" McGuigan added.</p>\n    <p>\"He liked to enjoy himself but he would train himself into phenomenal condition.\"</p>\n    <p>\n      <strong>Were you one of the fans who travelled to watch Hatton fight in Las Vegas? Get in touch using the tool below and tell us about your experience.</strong>\n    </p>\n    <h2>Get in touch</h2>\n    <p>Ricky Hatton - did you watch him in Las Vegas?</p>\n    <h2>Related topics</h2>\n    <ul>\n      <li>\n        <ul>\n          <li>Published1 day ago</li>\n        </ul>\n        <graphic alt=\"Canelo Alvarez faces off with Terence Crawford\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/648/cpsprodpb/0a33/live/ab52e420-6c5d-11f0-af20-030418be2ca5.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0a33/live/ab52e420-6c5d-11f0-af20-030418be2ca5.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/0a33/live/ab52e420-6c5d-11f0-af20-030418be2ca5.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/0a33/live/ab52e420-6c5d-11f0-af20-030418be2ca5.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/0a33/live/ab52e420-6c5d-11f0-af20-030418be2ca5.jpg 624w\" width=\"648\" height=\"364.99999999999994\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n      <li>\n        <ul>\n          <li>Published28 April 2024</li>\n        </ul>\n        <graphic alt=\"Split image of Claressa Shields, Paddy Pimblett and Chris Eubank Jr\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/1509/live/239312e0-5b05-11ef-8f0f-0577398c3339.png 976w\" width=\"1600\" height=\"900.125156445557\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n    <h2>More boxing from the BBC</h2>\n    <ul>\n      <li>\n        <ul>\n          <li>Published16 August</li>\n        </ul>\n        <graphic alt=\"BBC Sport microphone and phone\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/815/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b2c7/live/922d6170-544c-11ef-aebc-6de4d31bf5cd.jpg 800w\" width=\"815\" height=\"459\" class=\"ssrcss-11yxrdo-Image edrdn950\"/>\n      </li>\n    </ul>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/sport/boxing/articles/cvg9q28l49no?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "struggling-with-brain-fog-here-s-how-to-fix-it",
    "title": "Struggling with brain fog? Here's how to fix it",
    "category": "News",
    "subcategory": "Top Stories",
    "date": "2025-09-15",
    "excerpt": "When life gets busy and stress levels rise, it's not uncommon to find yourself walking into a room and forgetting why you went there, losing your train of thought mid-sentence or struggling to stay focused on simple tasks.",
    "cover": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7248/live/573bb830-8fcb-11f0-84c8-99de564f0440.png",
    "source": "https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Struggling with brain fog? Here's how to fix it</h1>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7248/live/573bb830-8fcb-11f0-84c8-99de564f0440.png.webp\" alt=\"BBC Woman with hands on her head looking stressed\"/>\n    <p>When life gets busy and stress levels rise, it's not uncommon to find yourself walking into a room and forgetting why you went there, losing your train of thought mid-sentence or struggling to stay focused on simple tasks.</p>\n    <p>Especially after the weekend, it can be hard to get back into work or study mode.</p>\n    <p>This mental cloudiness is often called brain fog and while it isn't a medical condition in itself, it refers to a collection of cognitive symptoms such as difficulty concentrating, forgetfulness, and mental slowness.</p>\n    <p>Common causes of it can include menopause or perimenopause, but it can also strike when you've got too much on your mind.</p>\n    <p>Medical doctor and Morning Live expert, Dr. Tharaka has these four tips and a special acronym to help cut through the haze.</p>\n    <h2>1. Be kind to yourself</h2>\n    <p>Brain fog can happen to anyone and it's not a personal failing or a sign that you're not coping.</p>\n    <p>Often, it's simply your brain's way of saying it's tired, stressed or overstretched.</p>\n    <p>Remind yourself that brain fog is usually temporary and it's okay to slow down, delegate tasks or ask for help when you need it.</p>\n    <p>If you are concerned then you should contact your GP.</p>\n    <h2>2. Create routines</h2>\n    <p>Reduce decision fatigue by having a set rhythm to your days - a predictable structure can take pressure off your working memory.</p>\n    <p>Knowing what's coming next stops your brain from constantly asking, \"What am I doing today?\"</p>\n    <p>It's worth creating a morning and evening routine and even something as simple as laying out clothes or prepping breakfast ahead of time frees your mind from constant decision-making.</p>\n    <h2>3. Take breaks</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7672/live/5fead5c0-8f1b-11f0-8ce3-5fb6152ae494.jpg.webp\" alt=\"Getty Images Person is organizing their work and personal agenda in a notebook at home, using sticky notes and colorful markers to plan their week, surrounded by envelopes, a smartphone, and a notepad \"/>\n    <p>It's easy to fill your diary with back-to-back commitments - meetings, social events, errands and daily tasks - without leaving any breathing room.</p>\n    <p>But constantly jumping from one thing to the next can leave your brain no time to reset, making brain fog more likely.</p>\n    <p>Try deliberately scheduling short breaks between activities, even just 5–10 minutes to stretch, get a drink, step outside or sit quietly.</p>\n    <p>Think of these firebreaks like mental buffers: they give your mind a chance to process what you've just done, let go of lingering stress and prepare for what's next.</p>\n    <h2>4. Use calendars and reminders</h2>\n    <p>Trying to hold every appointment, task and reminder in your head can quickly lead to mental clutter and forgetfulness.</p>\n    <p>Let tech do the remembering for you - use calendars and reminders to free up mental space.</p>\n    <p>Schedule recurring tasks so they happen automatically - for example, block out lunch in your diary each day or set weekly reminders for bills and chores.</p>\n    <p>This means you're not constantly thinking, \"What do I need to remember next?\"</p>\n    <h2>Swans</h2>\n    <graphic src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/76e5/live/f7a2f920-8f1a-11f0-9cf6-cbf3e73ce2b9.jpg.webp\" alt=\"Getty Images A woman in a white top drinks water in a kitchen surrounded by fresh vegetables and a laptop\"/>\n    <p>Alongside these practical daily strategies, Dr T also recommends using his Swans acronym to support brain health and sharpen focus.</p>\n    <p>Each letter stands for a key habit that can help clear the mental mist and keep your mind performing at its best:</p>\n    <ul>\n      <li><strong>Sleep:</strong>Sleep is non-negotiable - it gives your brain time to rest and consolidate memories. Aim for between seven and nine hours each night.</li>\n    </ul>\n    <ul>\n      <li><strong>Water:</strong>Our bodies are about 60% water and even mild dehydration can make you feel unfocused so keep water nearby and sip it regularly</li>\n    </ul>\n    <ul>\n      <li><strong>Activity</strong>: Moving your body boosts blood flow and oxygen to the brain, which helps you think more clearly. Try going on short walks, a light jog or regularly stretching</li>\n    </ul>\n    <ul>\n      <li><strong>Nutrition:</strong>Nourish your brain with whole foods rather than processed ones. Choline is a nutrient vital for brain health so eating food that is rich in it like eggs, fish and nuts can support concentration and focus.</li>\n    </ul>\n    <ul>\n      <li><strong>Stress:</strong>Chronic stress floods the body with cortisol - a hormone that helps regulate your body's response to stress - and that can cloud your thinking. Find ways to lower stress through breathing exercises, mindfulness and hobbies.</li>\n    </ul>\n    <p>Use the <a href=\"https://www.newcastle-hospitals.nhs.uk/services/great-north-childrens-hospital/childrens-health-psychology/resources/managing-brain-fog/\">NHS website</a> to find out more about brain fog and how to manage it.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.bbc.com/news/articles/c87ydw7xdxvo?at_medium=RSS&at_campaign=rss\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {}
]