[
  {
    "slug": "introducing-panagram-our-brand-new-telegraph-puzzles-game",
    "title": "Introducing Panagram, our brand-new Telegraph Puzzles game",
    "category": "Lifestyle",
    "subcategory": "",
    "category_slug": "lifestyle",
    "date": "2023-04-25",
    "excerpt": "The Word Perfect way to start your day",
    "cover": "https://www.telegraph.co.uk/content/dam/lifestyle/Article-Image_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.png",
    "source": "https://www.telegraph.co.uk/lifestyle/2023/04/25/introducing-panagram-our-brand-new-telegraph-puzzles-game/",
    "source_domain": "telegraph.co.uk",
    "source_name": "Telegraph",
    "author": "The Telegraph",
    "rights": "Unknown",
    "body": "\n  \n    <graphic src=\"https://www.telegraph.co.uk/content/dam/lifestyle/Article-Image_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.png?imwidth=640\" alt=\"Rise through the levels IN Panagram, starting as a humble Word Finder and rising to Word Perfect\"/>\n    <h1>Introducing Panagram, our brand-new Telegraph Puzzles game</h1>\n    <p>The Word Perfect way to start your day</p>\n    <graphic src=\"https://www.telegraph.co.uk/content/dam/lifestyle/Article-Image_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.png?imwidth=640\" alt=\"Rise through the levels IN Panagram, starting as a humble Word Finder and rising to Word Perfect\"/>\n    <p>Following the launch of our new Puzzles app, we’re delighted to introduce Panagram, an addictive addition to our brilliant daily brain-teasers.</p>\n    <p>Your objective is simple. Use the nine letters supplied to form as many four-letter words as possible. All of the words must include one central letter.</p>\n    <p>To add to the fun, Panagram is a ranked game. You'll rise through the levels as you find more words, starting as a humble Word Finder and rising to Word Perfect, if you find all the available words.</p>\n    <p>The words you find will be displayed in alphabetical order. You can turn on helpful gaps, which will show as spaces for words you’re yet to discover. When you've found as many as you can, simply end your game at your current score and rank.</p>\n    <graphic src=\"https://www.telegraph.co.uk/content/dam/lifestyle/2023/04/24/TELEMMGLPICT000333230473_1_trans_NvBQzQNjv4BqP642x9a4zXQRkyaVdo3I2b9YkyBchC6tdwQYuHKA77w.jpeg?imwidth=350\" alt=\"panagram telegraph puzzles\"/>\n    <p>Panagram is easy to begin with – and it’s suitable for all ages and abilities. But finding all the words, including the nine-letter Panagram, will test even the most voluminous vocabularies.</p>\n    <p>You’ll find a new Panagram every day on our Puzzles website and app, at midnight (UK time). It’s the (word) perfect way to get your mental gears turning.</p>\n    <p>If you’re wondering where the name Panagram comes from, it's a combination of “pangram”, a piece of text containing every letter of the alphabet, and “anagram”. If you can find the nine-letter Panagram in each day's puzzle, you’re well on the way to being a word-finding genius.</p>\n    <p>\n      <i>Play a brand new Panagram every day on the </i>\n      <i>Telegraph Puzzles website</i>\n      <i> and our new </i>\n      <i>App</i>\n      <i>. Sign up to get full access to our prestigious line-up of puzzles and games, including crosswords, sudoku, codewords, and our one-of-a-kind logic challenge, PlusWord. You can also build daily streaks and earn fun achievements to show off your puzzling prowess.</i>\n    </p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.telegraph.co.uk/lifestyle/2023/04/25/introducing-panagram-our-brand-new-telegraph-puzzles-game/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "what-happened-to-pan-yan-military-pickle-and-other-excellent-readers-q",
    "title": "‘What happened to Pan Yan military pickle?’ and other excellent readers’ questions",
    "category": "Lifestyle",
    "subcategory": "",
    "category_slug": "lifestyle",
    "date": "2023-04-25",
    "excerpt": "Are left-handers more likely to become actors? Does routine help you live longer? Our journalists answer your burning questions",
    "cover": "https://www.telegraph.co.uk/content/dam/lifestyle/2023/04/18/TELEMMGLPICT000330392164_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg",
    "source": "https://www.telegraph.co.uk/lifestyle/2023/04/25/what-happened-pan-yan-military-pickle/",
    "source_domain": "telegraph.co.uk",
    "source_name": "Telegraph",
    "author": "Telegraph Readers",
    "rights": "Unknown",
    "body": "<p>Are left-handers more likely to become actors? Does routine help you live longer? Our journalists answer your burning questions</p>\n<p>Whether you’re after a travel, culture or food recommendation, have a science or tech question or are pondering a philosophical or moral dilemma, there’s a Telegraph journalist who can help.</p>\n<p>We address a question each Friday in the Conversations newsletter, where you’ll also find like-minded readers sharing light-hearted, entertaining and human interest stories.</p>\n<p><a href=\"https://secure.telegraph.co.uk/customer/secure/newsletter/conversations/\">Sign up to receive Conversations in your inbox every Friday</a>.</p>\n<h2>\n      <strong>Chris Reid asks:</strong>\n    </h2>\n<p>“What happened to Pan Yan military pickle?”</p>\n<h2>Amy Bryant, Food Editor, replies:</h2>\n<p>“You’re in a fine pickle!” read the advertisement, picturing a guilty-looking puppy dripping from snout to tail with the dark, viscous condiment. Produced for almost a century from 1907, Pan Yan pickle was once the spread of choice for sandwiches, pork pies and to stir through salads.</p>\n<p>It was created by the Maconochie brothers, specialists in canned herrings before they expanded into pickles, potted meats and soups, and long-life military rations. Pan Yan – containing chopped vegetables and apple in a spiced, sweet-sour sauce – was a bestseller through to the 1950s, but after Maconochie Bros was sold (and resold), and as Branston’s popularity took hold, the final jar of Pan Yan rolled off the production line in 2002.</p>\n<h2>\n      <strong>Emmeline Lucas asks:</strong>\n    </h2>\n<p>“I’m in the middle of watching <a href=\"https://www.telegraph.co.uk/mad-men/\">Mad Men</a>, and I've been very struck by what a large proportion of the actors are left handed. Are left handers more likely to become actors, I wonder?”</p>\n<h2>Sarah Knapton, Science Editor, replies:</h2>\n<p>Studies have linked left-handedness to creativity, which may be down to brain differences, or increased adaptivity from having to adjust to a right-handed world.</p>\n<p>Around 10 per cent of people are left-handed, and although there is no list of left-handed actors, there is little indication the industry has more southpaws.</p>\n<p>Of the key Mad Men actors, only January Jones is left-handed, with Jon Hamm, Elizabeth Moss, John Slattery, Christina Hendricks and Vincent Kartheiser all right-handers.</p>\n<p>Actors often appear left-handed on screen because they are facing the viewer, so a glass, cigarette etc in the right hand will appear to be in the left.</p>\n<h2>\n      <strong>Julian Gall asks:</strong>\n    </h2>\n<p>“The papers and TV always used to refer to Queen Elizabeth as ‘the Queen’. However, the custom with our new king is to call him King Charles. Is this something in the Telegraph’s style guide? Can we expect to see references to just ‘the King’ soon?”</p>\n<h2>Alex Wallace, Senior Production Journalist, replies:</h2>\n<p>The Telegraph should always refer to royalty by their proper titles. However, confusion tends to reign when a holder becomes synonymous with his or her title. Many people still struggle to imagine anyone other than Elizabeth II when asked to picture the Queen, for example.<br/>Therefore, during periods of transition, it is useful to signpost whom we are referring to by using a first name (e.g. Queen Camilla or King Charles). We also bear in mind that some readers search online for ‘King Charles’, so we include the name to make articles easier to find.<br/>However, in print, Telegraph style is to refer to the current monarch as the King and his wife as the Queen. Former monarchs are referred to by forename and ordinal (e.g. Elizabeth II).</p>\n<h2>\n      <strong>Nicola Reid asks:</strong>\n    </h2>\n<p>“Some <a href=\"https://www.telegraph.co.uk/health-fitness/body/nine-things-do-right-now-healthy-life-age-100/\">people who live to a great age</a> say they stick to a strict daily routine. They get up, exercise and eat regularly at the same time each day. How critical is routine to longevity?”</p>\n<h2>Laura Donnelly, Health Editor, replies:</h2>\n<p>The secret of longevity? A mix of luck, genetics, environment and lifestyle.</p>\n<p>All the habits that keep people healthy – exercise, a balanced diet, not being overweight, <a href=\"https://www.telegraph.co.uk/news/2023/03/15/secret-restful-nights-sleep/\">sufficient sleep</a>, not smoking and limiting alcohol – also promote longevity. That said, some say cutting out all vices may just make life feel longer!</p>\n<p>Social interaction, and human connections have also been linked to a healthier and longer life.</p>\n<p>There isn’t much research showing that adopting a strict routine is critical to longevity. However, most people find it easier to adopt a healthy lifestyle if they get into regular habits, while studies on sleep suggest that consistent patterns are more beneficial. For that reason, a strict routine may well offer a boost to longevity – but that depends on what those daily habits are.</p>\n<h2>\n      <strong>Andrew Graham asks:</strong>\n    </h2>\n<p>“Why do clocks go back two months before winter solstice but forward three months after? It feels like a huge imbalance.”</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.telegraph.co.uk/lifestyle/2023/04/25/what-happened-pan-yan-military-pickle/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "what-is-an-acrostic-and-why-did-arnold-schwarzenegger-use-one",
    "title": "What is an acrostic and why did Arnold Schwarzenegger use one?",
    "category": "Lifestyle",
    "subcategory": "",
    "category_slug": "lifestyle",
    "date": "2023-04-21",
    "excerpt": "These hidden – and often cheeky – messages date back to the Greeks",
    "cover": "https://www.telegraph.co.uk/content/dam/lifestyle/2023/04/20/TELEMMGLPICT000332760819_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwauvwQN9t1fP0ffle5vRErs.jpeg",
    "source": "https://www.telegraph.co.uk/lifestyle/2023/04/21/hidden-messages-and-how-to-find-them/",
    "source_domain": "telegraph.co.uk",
    "source_name": "Telegraph",
    "author": "Chris Lancaster",
    "rights": "Unknown",
    "body": "\n  \n    <graphic src=\"https://www.telegraph.co.uk/content/dam/lifestyle/2023/04/20/TELEMMGLPICT000332760819_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwauvwQN9t1fP0ffle5vRErs.jpeg?imwidth=640\" alt=\"arnold Schwarzenegger \"/>\n    <h1>What is an acrostic and why did Arnold Schwarzenegger use one?</h1>\n    <p>These hidden – and often cheeky – messages date back to the Greeks</p>\n    <graphic src=\"https://www.telegraph.co.uk/content/dam/lifestyle/2023/04/20/TELEMMGLPICT000332760819_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwauvwQN9t1fP0ffle5vRErs.jpeg?imwidth=640\" alt=\"arnold Schwarzenegger \"/>\n    <p>A football matchday programme might seem an odd starting point for a piece about puzzles, but may come as no surprise to anyone who read this great story from last week about a <a href=\"http://t3.emails.telegraph.co.uk/r/?id=hca807e3d-feb3-417b-b06a-b6507823a4e5,bb7d1e,307c8d&amp;e=V1QubWNfaWQ9ZV9ETTEzNTc5NyZXVC50c3JjPWVtYWlsJmV0eXBlPUVkaV9QdXpfU3Vic19OZXcmdXRtc291cmNlPWVtYWlsJnV0bV9tZWRpdW09RWRpX1B1el9TdWJzX05ldzIwMjMwNDE3JnV0bV9jYW1wYWlnbj1ETTEzNTc5Nw&amp;s=RwKObQDJvR-fSARtbzFuX2aZ0E7Fj7SAn9TDfSciHxY\">hidden message inserted into a piece by Luton Town Football Club director, Stephen Browne</a>. In case you missed it, Browne took the opportunity in his \"From the Boardroom\" segment to insert an acrostic, in which the first letter of each sentence made up a poorly concealed jibe at local rivals Watford: \"Watford are s**t.\" Pithy stuff, indeed.</p>\n    <p>Concealed messages such as this have long been a feature of puzzles. Acrostics have a very long history, dating back to the prophecies of Sybil, which were written on leaves in such a way that the first letters spelled a word. This ties in with the etymology of the word, which comes from the Greek akros, meaning \"at the end\", and stichos, meaning \"line\".</p>\n    <p>Religious writings over the years have proved a rich source of acrostics, with several psalms featuring them. Perhaps the most famous one of all is found in Greek, where the phrase which translates to the English \"Jesus Christ, God's son, saviour\" has initial letters spelling ICHTHYS, meaning \"fish\". In more recent years, authors including Poe, Nabokov and Lewis Carroll have used them to good effect.</p>\n    <p>Of course, Stephen Browne is by no means the first person to use an acrostic to convey a message that may otherwise not get published. In 2009, Arnold Schwarzenegger, then governor of California, sent a note in which the first letters of seven lines spelled an instruction starting with the letter F and ending with \"you\". Television presenter James May was fired from Autocar magazine for something similar.</p>\n    <p>Sneaking acrostics into puzzles, especially crosswords, is something that also has a long history. Sometimes this is done for thematic effect, such as in <a href=\"http://t3.emails.telegraph.co.uk/r/?id=hca807e3d-feb3-417b-b06a-b6507823a4e5,bb7d1e,307c8e&amp;e=V1QubWNfaWQ9ZV9ETTEzNTc5NyZXVC50c3JjPWVtYWlsJmV0eXBlPUVkaV9QdXpfU3Vic19OZXcmdXRtc291cmNlPWVtYWlsJnV0bV9tZWRpdW09RWRpX1B1el9TdWJzX05ldzIwMjMwNDE3JnV0bV9jYW1wYWlnbj1ETTEzNTc5Nw&amp;s=ETuS6aW2oYApXkf2fRxTV9rQVrwCAWmD7vSYL2MeUqk\">January's Toughie Crossword 3,000</a>, in which the first letters of clues spelled \"Three-thousandth Toughie Crossword\". On other occasions a compiler may do it just for their own amusement, or for personal reasons. Here's where I must own up to having, almost 20 years ago, inserted into a cryptic crossword an acrostic containing a birthday message to my wife. Not that she noticed, but that's another story.</p>\n    <p>The fear of anybody editing puzzles is that a compiler may attempt to place an acrostic or other message in one of their creations that isn't seen during the editorial process and then causes controversy. Scanning clues and grids for this sort of thing is something that we do as standard, alongside all of the other checks we make on our puzzles.</p>\n    <p>If you think it's impossible to avoid noticing a hidden feature like this in a piece of text, then we'll leave you with a simple question:</p>\n    <p>Can you spot the acrostic in this article? Leave a comment below if you think you’ve spotted it.</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.telegraph.co.uk/lifestyle/2023/04/21/hidden-messages-and-how-to-find-them/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]