[
  {
    "slug": "why-aren-t-there-as-many-flies-these-days-and-other-excellent-readers-",
    "title": "‘Why aren’t there as many flies these days?’ and other excellent readers’ questions",
    "category": "Lifestyle",
    "subcategory": "",
    "category_slug": "lifestyle",
    "date": "2023-05-27",
    "excerpt": "Why is there a shortage of glass bottles? Is there anything more annoying than whistling? Our journalists answer your burning questions",
    "cover": "https://www.telegraph.co.uk/content/dam/lifestyle/2023/05/26/TELEMMGLPICT000002635914_16850949834910_trans_NvBQzQNjv4Bq_MBhvjUqhIfRd2_dxg_gJ8PGWbtrQPyb7frkldAHrbw.jpeg",
    "source": "https://www.telegraph.co.uk/lifestyle/2023/05/27/why-fewer-flies-these-days-readers-questions/",
    "source_domain": "telegraph.co.uk",
    "source_name": "Telegraph",
    "author": "Telegraph Readers",
    "rights": "Unknown",
    "body": "<p>Why is there a shortage of glass bottles? Is there anything more annoying than whistling? Our journalists answer your burning questions</p>\n<p>Whether you’re after a travel, culture or food recommendation, have a science or tech question or are pondering a philosophical or moral dilemma, there’s a Telegraph journalist who can help.</p>\n<p>We address a question each Friday in the <a href=\"https://secure.telegraph.co.uk/customer/secure/newsletter/conversations/\">Conversations newsletter</a>, where you’ll also find like-minded readers sharing light-hearted stories and entertaining anecdotes.</p>\n<h2>\n      <strong>Rod Ritchie asks:</strong>\n    </h2>\n<p>“There aren’t a fraction of the flies we had when I was a kid. If you went on holiday by car your windscreen and number plate were covered so badly you had to wash them. What’s the reason for this?”</p>\n<h2>\n      <strong>Sarah Knapton, Science Editor, replies:</strong>\n    </h2>\n<p>Entomologists call this “the windscreen phenomenon”, and it has been noticed across Britain and Europe.</p>\n<p>In 2019 and 2021, Kent Wildlife Trust and Buglife asked motorists to record the number of insects squashed on their number plate and compared it to 2004 – finding a 60 per cent decline.</p>\n<p>Experts blame intensive agriculture and the use of pesticides over the past 50 years, although Laurentian University scientists in Canada suggested that the upsurge in traffic could also be responsible for killing hundreds of billions of insects each year.</p>\n<p>Others argue that cars are now more aerodynamic, resulting in fewer insects being hit.</p>\n<p>If you have a question for a Telegraph journalist, please submit it using the form – or post it in the comments below – and <a href=\"https://secure.telegraph.co.uk/customer/secure/newsletter/conversations/\">sign up to receive Conversations in your inbox every Friday</a>.</p>\n<h2>\n      <strong>Tobias Tankard asks:</strong>\n    </h2>\n<p>“Is there anything more irritating than someone on a bus or train whistling away to the irritation of anyone within earshot?”</p>\n<h2>\n      <strong>Ed Cumming, Senior Features Writer, replies:</strong>\n    </h2>\n<p>Yes. Many behaviours on public transport are more irritating than whistling. Bad music being played on phones too loudly. Good music being played on phones too quietly – bring back the honest ghetto blaster! Headphones that leak tinny noise. Calls being conducted on loudspeaker. Backpacks being worn on busy tubes or buses, so the wearer cannot feel that they are crushing you against the door. Smelly food, drunks, football fans.</p>\n<p>Many of these share the same selfishness as whistling. Whistling breaks the social contract implicit in public transport, which is that it is a shared space. The whistler puts their own desire to whistle ahead of their neighbours’ desire not to be bothered. It’s a metaphor for society. We are all heading in the same direction and we have all paid for the experience communally, so pipe down and read a book.</p>\n<h2>\n      <strong>Jonathan Muller asks:</strong>\n    </h2>\n<p>“Why is there a <a href=\"https://www.telegraph.co.uk/food-and-drink/wine/victoria-moore-is-time-up-for-glass-wine-bottles/\">shortage of glass bottles</a> when there does not appear to be a shortage of wine bottles to recycle?”</p>\n<h2>\n      <strong>Amber Dalton, Content Editor, Telegraph Wine Cellar, replies:</strong>\n    </h2>\n<p>The current shortage of glass bottles stems from rising energy and material costs, largely as a result of the war in Ukraine, which has caused prices to sky-rocket and some suppliers to reduce or halt production.<br/>You’re right that <a href=\"https://wine.telegraph.co.uk/\">Brits consume a lot of wine</a> – the equivalent of 108 bottles per head each year. Although 71 per cent of our empties are collected for recycling, only 60 per cent of the processed glass is used for containers (compared with 98 per cent in Germany) making the UK a net importer of glass packaging.<br/>What’s more, the recycled content of manufactured glass containers in the UK stands at just 36 per cent so material is lost at each stage of the production process.</p>\n<h2>\n      <strong>Gigi Baron asks:</strong>\n    </h2>\n<p>“I cannot stand <a href=\"https://www.telegraph.co.uk/news/2023/05/13/older-drivers-forced-off-road-ultra-powerful-headlights/\">the dazzle of headlights</a>. I’m nowhere near over 60 and don’t have cataracts. When LEDs blaze at me, I want to put my lights on full beam. What fool thought brighter lights on cars was a good thing?”</p>\n<h2>\n      <strong>Jack Simpson, Transport Correspondent, replies:</strong>\n    </h2>\n<p>You are not alone Gigi. While the glare of LED headlights appears to hit older people, and particularly those with eye issues, the worst, it is not just an elderly driver problem.</p>\n<p>In <a href=\"http://t3.emails.telegraph.co.uk/r/?id=haeba0ecf-1a45-48b2-8646-1425413e38b1,be3284,350300\">a recent survey by the RAC</a> it was found that nine in 10 drivers of all ages believed that most car headlights were too bright, with 88 per cent saying they regularly get dazzled. Surprisingly, the survey also found that this was most acutely felt by younger drivers, with three in 10 drivers aged 17-34 thinking they are too bright, compared to just 19 per cent of over 65s.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.telegraph.co.uk/lifestyle/2023/05/27/why-fewer-flies-these-days-readers-questions/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]