[
  {
    "slug": "my-daughter-was-diagnosed-with-dementia-at-37-it-tore-our-family-apart",
    "title": "My daughter was diagnosed with dementia at 37 – it tore our family apart",
    "category": "Lifestyle",
    "subcategory": "",
    "category_slug": "lifestyle",
    "date": "2023-10-04",
    "excerpt": "Christine Reddall shares the harrowing story of her daughter’s diagnosis with a merciless form of dementia",
    "cover": "https://www.telegraph.co.uk/content/dam/lifestyle/2023/09/25/TELEMMGLPICT000350761588_16956559609890_trans_NvBQzQNjv4BqGlkUUahCSoq7geY0oMHQaEWy_sGK6oioMu5BzggyGUY.jpeg",
    "source": "https://www.telegraph.co.uk/lifestyle/2023/09/26/something-wrong-daughter-diagnosed-frontotemporal-dementia/",
    "source_domain": "telegraph.co.uk",
    "source_name": "Telegraph",
    "author": "Tara Thorpe",
    "rights": "Unknown",
    "body": "<p>Christine Reddall shares the harrowing story of her daughter’s diagnosis with a merciless form of dementia</p>\n<p>Caroline Preston <a href=\"https://www.telegraph.co.uk/health-fitness/mind/alzheimers-dementia-husband-symptoms-didnt-know-about/\">recently shared in a Telegraph article</a> the crushing impact that her husband, Mark’s, dementia had on her and her family’s lives and how she plans to raise awareness. </p>\n<p>Following Caroline’s moving story, Telegraph reader <strong>Christine Reddall</strong>, 72, who lives in Leicestershire, has shared the harrowing story of her own daughter, Anna, who was diagnosed with Behavioural Variant Frontotemporal Dementia (BvFTD), a merciless form of dementia, at just 37 years old. </p>\n<p>In light of World Frontotemporal Dementia Awareness Week, Christine speaks of Anna’s diagnosis, her devastating deterioration, the all-consuming effects on the family and the challenges she faced:</p>\n<blockquote>\n      <p>“Anna started showing behaviour changes when she was 36. At the time, she was working as a research cancer nurse. Anna was a very experienced, dedicated and compassionate nurse destined to go far.</p>\n      <p>She started behaving out of character — becoming disorganised, rude, loud and lacking compassion. At home, she was screaming, banging her head on the wall and constantly eating food high in carbohydrates. Unable to control her behaviour, she became unable to work.</p>\n      <p>Her husband was beside himself with worry, her two young sons were scared — and none of us knew what was going on.</p>\n      <p>Anna was very reluctant to go to the GP. Once there, she denied anything was wrong. She didn’t look ill, and at the doctors, she seemed able to control her behaviour. The GP diagnosed stress and depression and prescribed antidepressants and time off work. Anna would not accept this and tried to go back to work. She kept saying there was nothing wrong, yet her behaviour was getting worse.</p>\n      <p>Approximately six months after noticing these behaviour changes, Anna was admitted to a psychiatric unit. She was assessed and sent for a brain scan.</p>\n      <h3>Brains did not shrink in 36 year olds</h3>\n      <p>A brain scan revealed ‘global shrinkage’ of her brain. The doctors told us that it wasn’t that unusual and was probably caused by meningitis which she had suffered several years before. However, as a nurse, I knew that there was something very wrong. Brains did not shrink in 36 year olds.</p>\n      <p>That year, 2012, Anna bounced between psychiatry and neurology with neither speciality coming up with any revolutionary answers — all other tests came back normal.</p>\n      <p>There was a wonderful breakthrough half way through this year when a new doctor came up with a probable diagnosis of ‘PANDAS’ (Pediatric Autoimmune Neuropsychiatric Disorders Associated with Streptococcal Infections), which is a disease that this doctor felt could happen in young adults. Treatment for this proved inconclusive and we were plunged back into despair.</p>\n      <p>In my work as a Macmillan nurse, I had come across a patient with Pick’s disease (the previous term used for FTD). Putting all the pieces together, I realised that this was what Anna had. I told this to her consultant who looked at me and said “she is far too young to have that.”</p>\n    </blockquote>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.telegraph.co.uk/lifestyle/2023/09/26/something-wrong-daughter-diagnosed-frontotemporal-dementia/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]