[
  {
    "slug": "set-jetting-10-film-and-tv-locations-worth-travelling-for",
    "title": "Set-jetting: 10 film and TV locations worth travelling for",
    "category": "Travel",
    "subcategory": "11Trip Ideas",
    "category_slug": "travel/11trip-ideas",
    "date": "2025-08-28",
    "excerpt": "Set-jetting isn’t just a clever play on words. It’s a very real phenomenon.",
    "cover": "https://www.intrepidtravel.com/adventures/wp-content/uploads/2025/08/Intrepid-Travel-Italy-Matera-traveller-045A9781.jpg",
    "source": "https://www.intrepidtravel.com/adventures/set-jetting-film-and-tv-travel-locations/",
    "source_domain": "intrepidtravel.com",
    "source_name": "Intrepidtravel",
    "author": "Niamh Murphy",
    "rights": "Unknown",
    "body": "<p><strong>Set-jetting isn’t just a clever play on words. It’s a very real phenomenon.</strong> </p>\n<p>And while travelling through Thailand earlier this year, I saw it in action. Season three of <i>The White Lotus</i>, set in Ko Samui, was airing at the time, so it naturally came up during a pub crawl conversation. ‘I booked this trip as soon as I saw the trailer,’ a new friend shared. ‘I just knew if I were watching it at home, I’d want to be there.’  </p>\n<p>That’s set-jetting in a nutshell: seeing a beautiful location on screen and wanting to experience it in real life. If you’re ready to step into real-life sets, here are some top set-jetting spots (movie metaphors and the occasional bad pun included) and some very Intrepid ways to get there.</p>\n<h2><strong>Move through Matera with more grace than Bond</strong> </h2>\n<p>It’s not often a high-stakes car chase inspires envy, but that’s what a James Bond movie can do. Between the stunts and the suits, <i>No Time To Die </i>spotlights Matera, a UNESCO-listed city in southern <a href=\"https://www.intrepidtravel.com/italy\">Italy</a>, as a must-visit destination. </p>\n<p>On <a href=\"https://www.intrepidtravel.com/italy/premium-puglia-160144\">Premium Puglia</a>, things move at a slower pace. Sip wine, stroll through the famous Sassi cave dwellings with a local guide and learn how this ancient city (dating back to the Palaeolithic period – long before Bond) became so iconic. </p>\n<p><strong>Read more: </strong><strong>Northern vs southern Italy</strong></p>\n<h2><strong>(Sand)walk in Timothee Chalamet’s footsteps in Jordan  </strong> </h2>\n<p>Shot for IMAX, <i>Dune: Part One </i>and<i> Dune: Part Two </i>make the most of their epic landscapes – and much of what fans see as Arrakis was filmed in Wadi Rum, a protected desert wilderness in <a href=\"https://www.intrepidtravel.com/jordan\">Jordan</a>. </p>\n<p>On <a href=\"https://www.intrepidtravel.com/jordan/explore-jordan-159940\">Explore Jordan</a>, you’ll meet the sheikh of a local Bedouin tribe and learn what life is really like in the desert. Dine on traditional zarb, sleep in a simple Bedouin camp and head out on a half-day jeep safari the next morning. The terrain’s vast, the views are unreal and, thankfully, there are no giant sandworms. </p>\n<h2><strong>Cross Canada like Joel and Ellie</strong> </h2>\n<p>Though set in the United States, much of <i>The Last of Us</i> was filmed in <a href=\"https://www.intrepidtravel.com/canada\">Canada</a>. The post-apocalyptic backdrop of deserted cities and open roads? That’s Alberta. </p>\n<p>On screen, Joel and Ellie trek across America – from Boston to Wyoming – dodging infected humans and wrestling with moral dilemmas. You don’t need to follow in their literal footsteps, but if a cross-country journey’s on your list, <a href=\"https://www.intrepidtravel.com/canada/canadian-rockies-northern-lights-144879\">Canadian Rockies &amp; Northern Lights</a> gives you the drama (minus the zombies) – all with the safety of a small group and an experienced leader. </p>\n<h2><strong>Transform into someone new in Peru </strong> </h2>\n<p>When a franchise hits its seventh film, it needs to step things up to keep momentum. And <i>Transformers: Rise of the Beasts </i>did precisely that by choosing <a href=\"https://www.intrepidtravel.com/peru\">Peru</a> as the next place for the Autobots to roam. While the movie received mixed reviews, there’s no denying that Machu Picchu makes the most captivating backdrop.  </p>\n<p>The film shows off Peru’s ancient landscapes, but there’s plenty it doesn’t capture too. On <a href=\"https://www.intrepidtravel.com/peru/classic-peru-160084\">Classic Peru</a>, go beyond the screen with an experience you won’t find in any franchise. Stop for lunch with the Huilloc community in the Sacred Valley and join in a welcome dance.  </p>\n<p><strong>Read more: </strong><strong>The joy of seeing Machu Picchu with the descendants of its builders</strong></p>\n<h2><strong>Make Poland not</strong><strong><i> </i></strong><strong>A Real Pain</strong> </h2>\n<p><i/></p>\n<p><i>A Real Pain</i>, starring Jesse Eisenberg and Kieran Culkin, depicts everything a group tour <i>shouldn’t</i> be. Set on a heritage trip to <a href=\"https://www.intrepidtravel.com/poland\">Poland</a>, the cousins argue in front of strangers, miss train stops and make things awkward for everyone.  </p>\n<p>For a smoother ride, try <a href=\"https://www.intrepidtravel.com/czech-republic/best-central-europe-159984\">Best of Central Europe</a>. Like the cousins, you’ll visit a former concentration camp on a guided tour led by a local expert – a sobering and important part of the trip. But after that, things lighten up. You’ll continue through the Tatra Mountains and Budapest, with plenty of train connections caught and no dinners ruined by passive-aggressive bickering or gross burps (fingers crossed). </p>\n<h2><strong>Snack like Carmy in Chicago</strong> </h2>\n<p>Forget Smell-O-Vision (it’s a thing, look it up) – watching <i>The Bear </i>makes you wish someone had invented a way to reach into a TV screen and grab the food. While Carmy’s restaurant is fictional, it was inspired by spots that do exist around Chicago.  </p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.intrepidtravel.com/adventures/set-jetting-film-and-tv-travel-locations/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "after-long-covid-i-thought-i-d-never-travel-again-luckily-my-legs-prov",
    "title": "After long Covid, I thought I’d never travel again. Luckily, my legs proved me wrong",
    "category": "Travel",
    "subcategory": "11Trip Ideas",
    "category_slug": "travel/11trip-ideas",
    "date": "2025-08-28",
    "excerpt": "Intrepid traveller Carla isn’t one to shy away from a challenge. But after years of dealing with the fatigue and weakness that comes with long Covid, she didn’t need another achievement ticked off the list. She just wanted to feel like herself again.",
    "cover": "https://www.intrepidtravel.com/adventures/wp-content/uploads/2025/08/Samarkand.jpg",
    "source": "https://www.intrepidtravel.com/adventures/travel-after-long-covid/",
    "source_domain": "intrepidtravel.com",
    "source_name": "Intrepidtravel",
    "author": "Carla Powell",
    "rights": "Unknown",
    "body": "<p><strong>Intrepid traveller Carla isn’t one to shy away from a challenge. But after years of dealing with the fatigue and weakness that comes with long Covid, she didn’t need another achievement ticked off the list. She just wanted to feel like herself again.</strong> </p>\n<p>It was such a small thing.</p>\n<p>I was sitting on the Old City wall in Khiva, <a href=\"https://www.intrepidtravel.com/uzbekistan\">Uzbekistan</a>, watching the sunset. The heat of the day was dissipating, and I was watching some of the local kids aim a soccer ball at an imaginary goal post. I was a few days into Intrepid’s <a href=\"https://www.intrepidtravel.com/uzbekistan/central-asia-five-stans-express-160772\">Central Asia: Five Stans Express</a> trip, taking a quiet moment to myself to stop, breathe and drink up my surroundings. </p>\n<p>I scanned the horizon from my perch, having just climbed a short but steep set of stairs up onto the wall. For the average person, it was a feat of ‘nothingness’. But for me, it was a small triumph, a quiet win and a relief. ‘Look at you, legs… look what you just did.’</p>\n<h2><strong>The long road back from long Covid</strong></h2>\n<p>People aren’t worrying about Covid-19 too much these days, but for some of us, it’s ever-present. I developed long Covid in 2022, after contracting the virus for the second time. Besides the foggy memory and myriad other annoyances, I lost complete feeling in my toes and developed a debilitating weakness in my legs. These symptoms started about three weeks after I had recovered from the acute infection. At first, I thought I just needed more rest, or to eat better, but nothing helped in the slightest. I simply grew weaker and weaker and weaker.</p>\n<p>My legs had always been the strongest part of me. They hiked me over mountains in Romania, up to the monastery in Petra and over Dead Woman’s Pass on the Inca Trail. But, for a year and a half, those same legs couldn’t get me around a supermarket. Sometimes I was unable to stand up from a chair, other times they collapsed without warning and I would fall to the ground.</p>\n<p>The journey through long Covid isn’t for the faint of heart. Healing isn’t linear. ‘Crashes’ (the sudden and severe drop in physical or mental energy experienced by many sufferers) can happen at the most inopportune times and would leave me bedridden. I quietly wallowed in despair; there’s an abject loneliness that comes from being unable to participate in community. Before long Covid, I went for daily walks on the beach or through my local park, volunteered on multiple boards and attended concerts and festivals. But all of this had slipped away.</p>\n<p>One of my biggest fears was that I would never travel again. If I couldn’t get up the stairs in my own house, how was I going to be able to get around an airport, let alone a foreign country?</p>\n<p><strong>Read more: </strong><strong>The road to Machu Picchu starts at 385 lbs</strong></p>\n<h2><strong>A turning point</strong> </h2>\n<p>In 2024, things finally started to improve. I could take small walks. By small, I mean from the parking lot to the beach and back. And then to the water’s edge and back. Maybe 100 paces. It wasn’t hiking in the Andes, but it was something.</p>\n<p>Then, one day, I was scrolling on Facebook when the Five Stans trip popped up in my feed. I scrolled past it initially, then backed up. You know, I didn’t even want to click on it. I didn’t want to get my hopes up and dream of travel, just to deny myself the privilege. But I clicked.</p>\n<p><a href=\"https://www.intrepidtravel.com/turkmenistan\">Turkmenistan</a>! Are you kidding me? SOLD!  </p>\n<p>For decades before the word Covid even existed, the Stans had been a bucket list trip for me. I’d been poring over books about the Silk Road for years, reading about this ancient trade route that was steeped in human history. My soul had been harassing me to go to Central Asia. To be there, walking in the footsteps of Genghis Khan, imagining the 1000-camel caravans pulling into Samarkand, would be a true Carla-esque adventure.</p>\n<p>So, did I have the legs to do it? Honestly, in many ways, it was a huge gamble.</p>\n<p><strong>Read more: </strong><strong>78 reasons to book the damn trip</strong></p>\n<h2><strong>From fear to freedom</strong> </h2>\n<p>On my first night in Turkmenistan, I remember lying in bed and thinking, ‘just 25 more sleeps until I can go home.’</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.intrepidtravel.com/adventures/travel-after-long-covid/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "crying-over-baklava-an-afternoon-in-a-stranger-s-cave-home-in-turkey",
    "title": "Crying over baklava: An afternoon in a stranger’s cave home in Turkey",
    "category": "Travel",
    "subcategory": "11Trip Ideas",
    "category_slug": "travel/11trip-ideas",
    "date": "2025-08-21",
    "excerpt": "On a small group adventure in Turkey, Meghan and her fellow travellers experience a welcome – and some award-winning baklava – that moves them all to tears.",
    "cover": "https://www.intrepidtravel.com/adventures/wp-content/uploads/2025/08/Intrepid-Travel-Turkey-Cappadocia-Homestay-lunch-with-Nuray-045A5786.jpg",
    "source": "https://www.intrepidtravel.com/adventures/baklava-cave-home-turkey/",
    "source_domain": "intrepidtravel.com",
    "source_name": "Intrepidtravel",
    "author": "Meghan Morrison",
    "rights": "Unknown",
    "body": "<p><strong>On a small group adventure in Turkey, Meghan and her fellow travellers experience a welcome – and some award-winning baklava – that moves them all to tears.</strong></p>\n<p>We all giggled when JD started crying. Again. We couldn’t help it.</p>\n<p>‘Oh, no,’ he laughed as soon as the tears started to pool, and I laughed as all of us started tearing up with him.</p>\n<p>It had become a thing on this trip – these unexpected moments of emotion bubbling up out of nowhere. But they weren’t really out of nowhere. JD’s tears came when something real truly hit – a story shared, a connection made.</p>\n<p>Like the day before when we visited a family-run pottery shop and learned about the 4000-year-old craft. Overwhelmed by the tradition having survived for generations, he connected with the craftsmen through his emotions. But in this moment it wasn’t just him. Rhem’s eyes glassed over, mine stung and our leader, Elif, wiped her cheek.</p>\n<p>Nuray, our host, smiled as we reached for our napkins. ‘It’s the onions,’ she teased, motioning to her kitchen.</p>\n<p>JD, Rhem, Elif and I were five days into our <a href=\"https://www.intrepidtravel.com/turkey\">small group trip in Turkey</a>, which included a visit to Nuray’s home for a home-cooked meal. I spent the last eight years dreaming of one day staying in a cave hotel in <a href=\"https://www.intrepidtravel.com/turkey/cappadocia\">Cappadocia</a>, and here I was sitting in someone’s cave home? Of course I was feeling emotional. </p>\n<h2>Turkey trips that might move you to tears</h2>\n<p>Sitting on Nuray’s worn sofa, my toes curling on a well-trodden carpet, I took a deep breath. Family photos lined the wall and the smell of slow-simmered tomato and garlic still lingered in the air. Rhem’s shoulders slowly lowered from her ears. It felt like our trip had been moving at full speed, but in this moment, time seemed to slow down.</p>\n<p>Feeling comfortable can make you feel vulnerable. There’s something special about being comfortable enough to allow your walls to fall and your emotions to show. And now here we were, five people who had been strangers just moments before, crying over baklava.</p>\n<p><strong>Read more:  Travelling through grief: How I found healing on a group trip to Morocco</strong></p>\n<h2><strong>Before the baklava </strong></h2>\n<p>An hour earlier, our van weaved through Cappadocia’s honeycombed rock formations and tourist-packed streets full of souvenir shops before making a sharp turn up a quiet street. We hopped out at the bottom of the hill and started our ascent as cicadas buzzed, dust collected on our sandals, sweat pooled down my back and I regretted wearing a light-coloured shirt.</p>\n<p>Elif pushed open the creaking gate that brought us to our host’s home where we would be sharing lunch together. We walked through the stone courtyard to a home made out of volcanic tuff – a light rock built into the landscape. Surrounded by plants and standing in front of the doorway covered by a white curtain blowing in the wind, Nuray stood on the threshold. Her smile was already reaching her eyes before a word was spoken, and we all found ourselves instantly smiling, too.</p>\n<p>She greeted us like we were longtime friends coming over for lunch with a warm, soft hug that reminded me of my mom as her hand rubbed my back in greeting. Having spent the last three weeks away from home, I leaned into that feeling .</p>\n<p>We weren’t the first guests she’s welcomed into her home, but she made us feel like we were. Her excitement was palpable and made us feel special as she ushered us inside, her smile never fading.</p>\n<p>‘Intrepid comes into my home and I am very, very happy,’ she beamed. Nuray credits her beautifully spoken English to having welcomed Intrepid travellers into her home for the last 12 years. In an effort to tackle gender disparity in Turkey, Intrepid engages local, self-employed women to host activities, and now Nuray gets to share a piece of her home, her family and her culture with people from around the world.</p>\n<h2><strong>A mother on the road </strong></h2>\n<p>Elif had had an extra pep in her step that morning, energised for us to finally meet Nuray after having told us so much about her.</p>\n<p>‘It’s very special, this visit,’ she kept sharing.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.intrepidtravel.com/adventures/baklava-cave-home-turkey/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "meet-the-women-turning-periods-into-pathways-in-nepal-and-beyond",
    "title": "Meet the women turning periods into pathways in Nepal and beyond",
    "category": "Travel",
    "subcategory": "11Trip Ideas",
    "category_slug": "travel/11trip-ideas",
    "date": "2025-08-13",
    "excerpt": "On a Women’s Expedition, Cliona learns about the realities of menstruation in some parts of Nepal – and meets the women working to change the narrative.",
    "cover": "https://www.intrepidtravel.com/adventures/wp-content/uploads/2025/08/Intrepid-Travel-nepal_kathmandu_mountains-woman-view.jpg",
    "source": "https://www.intrepidtravel.com/adventures/turning-periods-into-pathways-in-nepal/",
    "source_domain": "intrepidtravel.com",
    "source_name": "Intrepidtravel",
    "author": "Cliona Elliott",
    "rights": "Unknown",
    "body": "<p><strong>On a Women’s Expedition, Cliona learns about the realities of menstruation in some parts of Nepal – and meets the women working to change the narrative.</strong> </p>\n<p>I bury my face in a pile of still-warm T-shirts and leggings as I sort through my freshly washed laundry. Nothing beats the sweet, soapy scent of clean clothes after a week of trekking.</p>\n<p>As I shake out the last of the bag, a pair of period undies falls on the floor. I pick them up and hold them out in front of me. They look familiar. My size. But they’re not mine. So I send a quick message to the group chat:</p>\n<p>‘Morning! Is anyone missing a pair of black period undies? I picked them up in the launderette in Pokhara.’</p>\n<p>It’s no big deal. Just a mix-up. But a few days later, I’d see that stray pair of underwear in a whole new light.</p>\n<p>I’m on Intrepid’s <a href=\"https://www.intrepidtravel.com/nepal/nepal-womens-expedition-160342\">Women’s Expedition in Nepal</a> – a trip designed to let travellers experience the country through the eyes of local women. So far, we’ve listened to morning prayers at <a href=\"https://www.intrepidtravel.com/adventures/kapans-buddhist-nunnery/\">Kapan Ani Gompa</a> – a Buddhist nunnery where women have a rare opportunity to receive a traditional monastic education; we’ve learned how to make momos with a lovely lady named Dolma who was born and raised in a Tibetan refugee camp; and we’ve danced to Shakira’s <i>Waka Waka</i> with our <a href=\"https://www.intrepidtravel.com/adventures/female-porters-nepal/\">all-female trekking crew</a> under a full moon in the Annapurna foothills. </p>\n<p>My period just so happened to coincide with the trek. Typical, I know. Given the choice (<i>if only</i>), I would’ve picked another week. But I had painkillers at the ready, a hefty stock of Snickers and a group of brilliant women by my side. It was a slight inconvenience, but it wasn’t going to stop me. </p>\n<p>But when we return to <a href=\"https://www.intrepidtravel.com/nepal/kathmandu\">Kathmandu</a> and visit an NGO called Days for Girls, I learn that getting your period goes far beyond inconvenience for some Nepali women. </p>\n<h2>Banished for bleeding</h2>\n<p>We pull up outside a building on the busy street of Bafal Marg. There’s a sign reading ‘turning periods into pathways’ above the door. Motorbikes zip past in an endless stream, and while I linger for a gap in the traffic, our leader, Keshu, strides out with an open palm, bringing the bikes to a halt. I shuffle behind her like a duckling.</p>\n<p>Waiting to greet us is Maya Khaitu, the country director of <a href=\"https://www.daysforgirls.org/nepal/\">Days for Girls Nepal</a>. The organisation is a part of a global non-profit working to eliminate stigma and limitations around periods. Through community education and sustainable period products, the NGO is improving the health and livelihoods of girls and women in Nepal, Kenya and Guatemala, among other countries. </p>\n<p>‘Watch your heads,’ Maya warns as we climb a narrow metal staircase to a small classroom where we’ll learn more. Two team members hand out small bouquets of powder-pink amaryllis flowers to each woman in our group as we settle into our seats. Although the windows are shut, there’s no escaping Kathmandu’s soundtrack of honking horns and yapping dogs.</p>\n<p>‘As you know,’ Maya says, ‘menstrual health is stigmatised.’ I see a wave of nodding heads in the corner of my eye. ‘But in far western and midwestern Nepal, women and girls are banished to cattle sheds or makeshift huts during their period.’</p>\n<p>‘And just two months ago,’ she continues, ‘a woman was attacked by a tiger while she was sleeping in one of these sheds.’</p>\n<p>The street noise dissolves like sugar in a cup of masala chiya, and a collective gasp sweeps through the room.</p>\n<blockquote><p>This practice of isolating women on their period is part of chhaupadi, a centuries-old tradition where menstruation is seen as impure.</p></blockquote>\n<p>The tiger fled after villagers raised the alarm, Maya told us. The woman survived with minor facial injuries, but some aren’t so lucky. More recently, a woman tragically died from a <a href=\"https://kathmandupost.com/sudurpaschim-province/2025/07/13/woman-dies-of-snakebite-in-menstrual-shed-in-kanchanpur\">snake bite in a menstrual shed</a> in Kanchanpur. </p>\n<p>This practice of isolating women on their period is part of chhaupadi, a centuries-old tradition where menstruation is seen as impure. During their bleed, women aren’t allowed to stay in the home or do everyday tasks like cooking and cleaning – or even touch others – out of fear they’ll bring death, illness, crop failure or some other bad luck to the family.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.intrepidtravel.com/adventures/turning-periods-into-pathways-in-nepal/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]