[
  {
    "slug": "on-a-cliffside-in-oman-para-athlete-zainab-al-eqabi-finds-her-freedom",
    "title": "On a Cliffside in Oman, Para-Athlete Zainab Al-Eqabi Finds Her Freedom",
    "category": "Travel",
    "subcategory": "3General",
    "category_slug": "travel/3general",
    "date": "2025-09-20",
    "excerpt": "I was halfway up a cliff in northern Oman when I realized I hadn’t thought about my prosthesis in more than an hour—which, if you’ve ever worn one, you’ll know is no small thing. The socket was slick with sweat against my thigh. The ridge of my liner had started to roll slight…",
    "cover": "https://media.cntraveler.com/photos/68c86d238f69296880f58711/master/pass/image00002.jpg",
    "source": "https://www.cntraveler.com/story/on-a-cliffside-in-oman-para-athlete-zainab-al-eqabi-finds-her-freedom",
    "source_domain": "cntraveler.com",
    "source_name": "Cntraveler",
    "author": "Scott Campbell",
    "rights": "Unknown",
    "body": "<p>I was halfway up a cliff in northern <a href=\"https://www.cntraveler.com/story/the-colorful-and-complex-world-of-omani-cuisine\">Oman</a> when I realized I hadn’t thought about my prosthesis in more than an hour—which, if you’ve ever worn one, you’ll know is no small thing. The socket was slick with sweat against my thigh. The ridge of my liner had started to roll slightly, but not enough to make me stop. I’d already hiked for five hours that day and was now hauling myself—and my leg—up the blunt edge of a rock face.</p>\n<p>A steel cable snaked along the cliff, bolted in intervals above a sliver of a ledge. Below, a drop that would turn your stomach inside out if you dared to look down. I didn’t. I wasn’t scared. Or rather, I was, but not of falling. I was scared that after such an intense day, my reserves were starting to slip, that the engine was sputtering just as the terrain got harder. But the adrenaline didn’t care. It surged forward, dragging me with it, past the point where reason said stop.</p>\n<p><a href=\"https://www.cntraveler.com/story/golden-rules-of-solo-travel\">Solo travel</a> comes with a strange kind of liberty. People project onto it: courage, loneliness, madness. It’s none of those things. When I travel alone, I’m not someone’s daughter or patient or quiet cause for concern. I’m not “the woman with one leg”. I’m just Zainab.</p>\n<p>This wasn’t my first <a href=\"https://www.cntraveler.com/gallery/our-editors-favorite-places-to-travel-solo\">solo trip</a>. I’d wandered the alleyways of <a href=\"https://www.cntraveler.com/story/seeking-silence-in-wadi-rum\">Jordan</a>, roamed <a href=\"https://www.cntraveler.com/story/in-charismatic-istanbul-the-past-still-shapes-the-present\">Istanbul</a>, gotten lost on purpose in countless cities. I’d learned how to pack light, how to listen to my body, how to push it past the borders of comfort. Yet Oman was different. There was something elemental about it all: the land stripped to its bones, the quiet confidence of the men I’d found online to hike with, the challenge I’d set for myself. Not to prove anything. Just to see what I could do.</p>\n<p>But I didn’t always know I could do this. There was a time when I didn’t even know I had a choice—not about travel, or mountains, but about how to exist. I was seven. We were in the garden of our house in <a href=\"https://www.cntravellerme.com/story/the-best-of-baghdads-streetside-cafes\">Baghdad</a>. It was hot, still. I was fiddling with the handlebars of my bike, which were damaged and needed to be fixed, and my dad came out to help. My youngest sister was on the swing nearby. We found a piece of scrap metal in the garage—something heavy, solid. He thought it might help. It looked like a screw. It wasn’t.</p>\n<p>The blast was thunderous and eerily quiet all at once. I remember the air being sucked from the world, the heat bending around my face, the sensation of being thrown. Blood, screaming, neighbours running toward us.</p>\n<p>My father lost his hand, and my baby sister was seriously injured in the explosion. Later, after several hospitalizations, I lost my leg.</p>\n<p>Some memories loop like broken film: my mother telling me not to move as my father approached my hospital bed, because he didn’t yet know my leg had been amputated. The way he touched my face, frantic and gentle, trying to confirm the rest of me was intact. And the feeling, at seven years old, that I had to be strong for him.</p>\n<p>Nothing made sense, but I knew what had happened was bigger than me.</p>\n<p>For a long time, I didn’t recognize the girl in the mirror. I was a collage of stitches and plaster casts, tape measures and socket moulds. At home, my mother cupped my face with both hands and said: “You are strong. You were made unbreakable.” I didn’t believe her. But I wanted to. And maybe that’s what led me here, to the side of <a href=\"https://www.cntravellerme.com/story/hiking-in-uae-and-oman\">a cliff in Oman</a>, fingers clawed around a steel lifeline, pulling myself inch by inch up the rock. We’d started at sunrise, the path zigzagging across loose shale and burnt orange limestone. I was the only woman in the group – just me and a few Omani adventurers I’d found on Instagram. They were cheerful at first, helping me check my harness, asking about my prosthesis. But once the hike began, the talking stopped. The terrain demanded it. The rock was brittle, flaking underfoot, always a little unsure. We scrambled over boulders, edged along loose ridges with open air on one side.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.cntraveler.com/story/on-a-cliffside-in-oman-para-athlete-zainab-al-eqabi-finds-her-freedom\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "how-to-see-salem-massachusetts-at-its-spookiest",
    "title": "How to See Salem, Massachusetts, at Its Spookiest",
    "category": "Travel",
    "subcategory": "3General",
    "category_slug": "travel/3general",
    "date": "2025-09-20",
    "excerpt": "All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.",
    "cover": "https://media.cntraveler.com/photos/68cdace3ec77c3a787f5cd75/master/pass/091925-Salem-ESP-GettyImages-973601706webres-final.jpg",
    "source": "https://www.cntraveler.com/story/where-to-eat-stay-play-in-salem-massachusetts-during-halloween",
    "source_domain": "cntraveler.com",
    "source_name": "Cntraveler",
    "author": "Paris Wilson",
    "rights": "Unknown",
    "body": "<p>All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.</p>\n<p><a href=\"https://www.cntraveler.com/story/best-east-coast-beach-towns-to-visit-in-the-fall\">Fall</a> is when <a href=\"https://www.cntraveler.com/story/women-who-travel-podcast-salem-then-and-now\">Salem, Massachusetts</a>, truly comes alive, drawing thousands to its cobbled streets, historic homes, and mysterious allure. However, with the <a href=\"https://www.cntraveler.com/story/the-most-visited-cities-in-the-world-from-paris-to-kuala-lumpur\">massive surge of visitors</a> (over a million annually) comes heavy foot and car traffic, crowded streets, and the bustling energy of <a href=\"https://www.cntraveler.com/story/halloween-movie-filming-locations-you-can-visit\">Halloween</a> revelry. While the city is a dream destination for those seeking spooky thrills, it’s also essential to approach Salem’s October festivities with mindfulness and respect. To fully enjoy the experience, be considerate of local resources—use public transportation when possible, dispose of trash properly, and be conscious of peak times to avoid overcrowding. By spreading out your visit and planning your activities thoughtfully, you can help preserve the spirit of Salem while minimizing your environmental impact.</p>\n<p>Beyond the throngs of tourists dressed as witches and the <a href=\"https://www.cntraveler.com/gallery/the-most-haunted-places-in-america\">traditional “haunted” attractions</a>, there’s a quieter, more ethical way to experience this town. With a growing focus on sustainability, ethical tourism, and local artisanship, Salem offers a chance to embrace the spirit of Halloween in a way that doesn’t rely on tired tropes or contribute to overwhelming crowds.</p>\n<p>Here’s a thoughtfully curated guide for those looking to explore Salem this Halloween season, from mindful dining to <a href=\"https://www.cntraveler.com/gallery/sustainable-hotels-setting-a-new-standard-for-the-industry\">conscious accommodations</a> and activities that respect the town’s rich history. Whether you're strolling through its haunted streets or immersing yourself in the history of the witch trials, Salem offers an unforgettable journey into the past, complete with plenty of eerie thrills.</p>\n<h2>Where to eat</h2>\n<p>An essential stop for seafood lovers, <a href=\"https://www.turners-seafood.com/salem-ma\">Turner’s Seafood</a> at the historic Lyceum Hall blends the best of New England’s <a href=\"https://www.cntraveler.com/story/on-the-puget-sound-the-women-whose-lives-and-work-revolve-around-salmon\">fishing heritage</a> with an elegant dining experience. The restaurant is housed in a 19th-century building that once served as a community center, and its interior is a stunning mix of vintage and contemporary, with dark wood paneling, nautical decor, and a large seafood bar at the center of the room. As one of Salem’s premier seafood destinations, Turner’s serves only the freshest catch, sourced from local waters. The menu is a celebration of the region’s coastal bounty: think <a href=\"https://www.cntraveler.com/story/i-spent-my-vacation-living-out-my-grandfathers-love-for-lobstering\">lobster</a> bisque, <a href=\"https://www.cntraveler.com/story/how-americas-oyster-farms-are-drawing-more-travelers-than-ever\">fresh oysters</a> on the half shell, and the signature <a href=\"https://www.cntraveler.com/story/lobster-rolls-and-ancient-beaches-on-canadas-acadian-coast\">lobster roll</a> with a decadent, buttery finish. The grilled swordfish and pan-seared scallops are equally popular among regulars, each prepared to perfection. The extensive wine list and well-curated cocktail menu—featuring classics like the Salem Sailor’s Punch—ensure that your meal is complemented by the perfect drink.</p>\n<p>For a casual yet memorable dining experience, <a href=\"https://lobstershantysalem.com/\">The Lobster Shanty</a> offers a down-to-earth, no-fuss seafood haven right in the heart of downtown Salem. This beloved local gem is housed in a charming building that feels like a classic seafood shack, complete with mismatched wooden tables, a cozy bar, and a warm, friendly vibe that makes you feel like a local from the moment you walk in. The restaurant’s menu is a delicious ode to all things lobster, from the classic lobster roll to the rich lobster mac and cheese. Alongside the seafood, the menu also offers a variety of <a href=\"https://www.cntraveler.com/story/for-the-portuguese-community-southern-massachusetts-is-a-hub-of-festas-food-and-family\">New England comfort foods</a>, like clam chowder and fried clam bellies. The atmosphere is bustling, and the patrons (both locals and visitors) chat enthusiastically as they sip on local craft beers and freshly made cocktails.</p>\n<p>For a step outside of New England’s seafood scene, <a href=\"https://www.gulugulucafe.com/\">Gulu-Gulu Cafe</a> is a whimsical and artistic gem. It’s a must-visit for those looking for a cozy, European-style café with a quirky twist. Located on Essex Street, the café draws in a diverse crowd of artists, locals, and tourists seeking a comfortable yet vibrant spot to relax. The walls are adorned with ever-changing local art, and the eclectic furniture adds to the bohemian charm of the place. Whether you're popping in for a casual lunch or grabbing a coffee to fuel your Salem adventures, the menu features a mix of creative sandwiches, hearty salads, and locally sourced baked goods. Their Creepy Crawly cocktail—an Instagram-worthy concoction made with black vodka, ginger beer, and a dusting of edible glitter—is a Halloween favorite, as is the house-made pumpkin soup served in the fall.</p>\n<h2>Where to stay</h2>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.cntraveler.com/story/where-to-eat-stay-play-in-salem-massachusetts-during-halloween\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "this-is-the-happiest-state-in-the-us-according-to-a-new-study",
    "title": "This Is the Happiest State in the US, According to a New Study",
    "category": "Travel",
    "subcategory": "3General",
    "category_slug": "travel/3general",
    "date": "2025-09-20",
    "excerpt": "Happiness may come from within, but there’s no denying that external factors play a major part in one’s emotional contentment. Work fulfillment, hobbies, and social support are always important pieces of the puzzle—but, if you’re an American, your literal state could be the th…",
    "cover": "https://media.cntraveler.com/photos/68cdb32f319bf211cd1227a5/master/pass/091925-Happiest-States-Hawaii-Lede-GettyImages-1371880849.jpg",
    "source": "https://www.cntraveler.com/story/happiest-states-in-the-us-according-to-new-study-1",
    "source_domain": "cntraveler.com",
    "source_name": "Cntraveler",
    "author": "Caitlin Morton",
    "rights": "Unknown",
    "body": "\n  \n    <p>Happiness may come from within, but there’s no denying that external factors play a major part in one’s emotional contentment. Work fulfillment, hobbies, and social support are always important pieces of the puzzle—but, if you’re an American, <a href=\"https://www.cntraveler.com/galleries/2016-03-04/the-best-places-to-live-in-the-us-1\">your literal state</a> could be the thing that tips the scales.</p>\n    <p>According to the researchers at WalletHub, a “key way to boost your happiness is living in the right place.” The personal finance website just released its <a href=\"https://wallethub.com/edu/happiest-states/6959\">Happiest States in America</a> report for 2025, a comprehensive ranking based on three key categories: 1) emotional and physical well-being, 2) work environment, and 3) community and environment. Within each dimension are dozens of sub-factors, including share of adult depression, life expectancy, commute time, weather, safety, and economic security. Each metric was weighted, and the numbers were added up to determine the final scores—a score of 100 represents maximum happiness.</p>\n    <p>This year’s survey finds <a href=\"https://www.cntraveler.com/gallery/best-beaches-in-hawaii\">Hawaii</a> to be the happiest state, with a total score of 65.50, and ranking second in the emotional and physical well-being column—unsurprising, given that around 72% of adults report having an active daily lifestyle. <a href=\"https://www.cntraveler.com/galleries/2016-07-01/the-best-beaches-in-nj\">New Jersey</a> is ranked first for emotional and physical well-being (it notably has the lowest share of adult depression in the country), and fourth on the overall list. <a href=\"https://www.cntraveler.com/story/utah-national-parks\">Utah</a> sits at number 6, but earned the top spot in both work environment and community.</p>\n    <p>West Virginia, meanwhile, places last on the list with a score of 32.04 and twice the share of adult depression as New Jersey. Along with the Mountain State, the top five unhappiest states in descending order are Louisiana, Arkansas, Alabama, and Alaska. Coming in at 25, <a href=\"https://www.cntraveler.com/tag/south-carolina\">South Carolina</a> is the true neutral.</p>\n    <p>Below, the complete ranking of the top 10 happiest states in the US:</p>\n    <ul>\n      <li>Hawaii</li>\n      <li>Maryland</li>\n      <li>Nebraska</li>\n      <li>New Jersey</li>\n      <li>Connecticut</li>\n      <li>Utah</li>\n      <li>California</li>\n      <li>New Hampshire</li>\n      <li>Massachusetts</li>\n      <li>Idaho</li>\n    </ul>\n    <p>\n      <i>This article has been updated with new information since its original publish date.</i>\n    </p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.cntraveler.com/story/happiest-states-in-the-us-according-to-new-study-1\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-last-solar-eclipse-of-2025-will-be-visible-from-this-island-nation",
    "title": "The Last Solar Eclipse of 2025 Will Be Visible From This Island Nation",
    "category": "Travel",
    "subcategory": "3General",
    "category_slug": "travel/3general",
    "date": "2025-09-19",
    "excerpt": "It's dawn, the birds are chirping, and the mist is dissipating—revealing a sun that looks strangely like a crescent moon. That's the scene folks in New Zealand will wake up to on the morning of September 22, 2025, when a partial solar eclipse coincides with sunrise. Up to 86% …",
    "cover": "https://media.cntraveler.com/photos/68cda1b8f94aeed80f260cc2/master/pass/091925-Partial-Solar-Eclipse-GettyImages-1329592400.jpg",
    "source": "https://www.cntraveler.com/story/partial-solar-eclipse-september-2025",
    "source_domain": "cntraveler.com",
    "source_name": "Cntraveler",
    "author": "Stefanie Waldek",
    "rights": "Unknown",
    "body": "\n  \n    <p>It's dawn, the birds are chirping, and the mist is dissipating—revealing a sun that looks strangely like a crescent moon. That's the scene folks in <a href=\"https://www.cntraveler.com/story/air-new-zealand-business-class-review\">New Zealand</a> will wake up to on the morning of September 22, 2025, when a partial solar eclipse coincides with sunrise. Up to 86% of the solar disk will be obscured depending on the viewing location, creating that unique crescent sunrise. This event is the final solar eclipse of the year—the next one will occur on Feb. 17, 2026. Below, everything to know about the partial solar eclipse of <a href=\"https://www.cntraveler.com/story/september-2025-horoscope\">September 2025.</a></p>\n    <h2>What is a partial solar eclipse?</h2>\n    <p>A solar eclipse happens when the moon passes directly between Earth and the sun, casting a shadow onto our planet. During a <a href=\"https://www.cntraveler.com/story/solar-eclipse-cruises-2026-complete-guide\">total solar eclipse</a>, the moon completely covers the sun and darkens the skies in the path of totality. But during a partial eclipse, the moon only blocks part of the solar surface. As such, the sun will appear as if a bite has been taken out of it.</p>\n    <p>While partial solar eclipses don’t produce the <a href=\"https://www.cntraveler.com/story/total-solar-eclipse-buffalo-new-york-photo-essay\">eerie daytime darkness that total eclipses</a> are famous for, they can still be quite exciting to see—particularly when they coincide with sunrise or sunset, as is the case this month. The key is to don the appropriate eye protection so you can clearly see that crescent shape.</p>\n    <h2>When and where can I see the eclipse?</h2>\n    <p>Unfortunately, this eclipse will only be visible from a few populated areas. Maximum coverage will occur largely over the <a href=\"https://www.cntraveler.com/story/best-places-to-go-in-australia-new-zealand-and-the-south-pacific-2025\">Southern Ocean between New Zealand and Antarctica,</a> as well as part of <a href=\"https://www.cntraveler.com/story/an-arctic-dogsledder-takes-on-challenging-new-terrain-antarctica\">East Antarctica</a>. Substantial coverage will be visible across <a href=\"https://www.cntraveler.com/story/in-lake-takapo-new-zealand-reconnecting-with-darkness-the-maori-way\">New Zealand</a>, some <a href=\"https://www.cntraveler.com/gallery/australia-south-pacific-top-resorts\">South Pacific</a> nations, and more of Antarctica, while eastern <a href=\"https://www.cntraveler.com/destinations/australia\">Australia</a> and <a href=\"https://www.cntraveler.com/story/reconnecting-with-my-best-friend-in-tasmania\">Tasmania</a> will catch only the tiniest bit of the show.</p>\n    <p>New Zealand is undoubtedly the standout destination for this eclipse (unless you happen to be <a href=\"https://www.cntraveler.com/story/meet-the-chief-scientist-at-viking\">working in Antarctica</a>). Across the country, viewers will see the sun rise already partially eclipsed, with as much as 72% of the disk covered at maximum on the <a href=\"https://www.cntraveler.com/story/kiwirail-new-zealands-south-island\">South Island</a> and up to 66% on the North Island.</p>\n    <p>As for timing, the eclipse begins at 17:29 UTC and ends at 21:53 UTC on September 21, with the maximum coverage lasting from 19:41 to 19:43 UTC. If you're within the path of the eclipse—you can check on sites like <a href=\"https://www.timeanddate.com/eclipse/solar/2025-september-21\">Time and Date</a> to see what's visible from your location—be sure to convert UTC to your local time. For the majority of destinations where the eclipse will be visible, this translates to the early morning of September 22.</p>\n    <h2>How can I watch the partial solar eclipse safely?</h2>\n    <p>Unlike <a href=\"https://www.cntraveler.com/story/where-to-see-blood-moon-total-lunar-eclipse-september-2025\">lunar eclipses</a>, which you can view with the naked eye, solar eclipses require protective eyewear or specialized filters for binoculars and telescopes. Never look directly at the sun without certified solar eclipse glasses—ordinary sunglasses won't work. If you look directly at the sun without protection, you can permanently damage your vision. Alternatively, you use indirect viewing methods to see solar eclipses, such as a pinhole projector.</p>\n    <p>Since this eclipse occurs early in the morning, you'll want to have clear eastward views—coastal areas are ideal, since you'll watch the sun come up over the water. But you can also position yourself near open fields or on hilltops. And if you don't happen to be in the path of the partial solar eclipse, you can still enjoy the views via livestreams; <a href=\"https://www.timeanddate.com/eclipse/solar/2025-september-21\">Time and Date</a> will host one, for example.</p>\n    <h2>When is the next solar eclipse?</h2>\n    <p>The next solar eclipse will be an annular eclipse on Feb. 17, 2026. Annular eclipses are also known as \"ring of fire\" eclipses, as the moon is positioned in such a way that the sun's corona surrounds it like a bright ring. The annular eclipse will be visible in Antarctica, while a partial solar eclipse will be visible across <a href=\"https://www.cntraveler.com/story/at-a-wellness-retreat-in-south-africa-learning-the-art-of-doing-less\">Southern Africa</a> and the southern tip of <a href=\"https://www.cntraveler.com/story/best-places-to-go-in-central-and-south-america-2025\">South America</a>.</p>\n    <p>Following that eclipse will be a blockbuster show: a total solar eclipse on Aug. 12, 2026. Visible across <a href=\"https://www.cntraveler.com/story/greenland-new-airport\">Greenland</a>, <a href=\"https://www.cntraveler.com/gallery/best-hotels-in-iceland\">Iceland</a>, and <a href=\"https://www.cntraveler.com/gallery/best-hotels-in-spain\">Spain</a>, it’s set to be one of the longest total solar eclipses of the 21st century, with more than six minutes of totality in some locations.</p>\n  \n\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.cntraveler.com/story/partial-solar-eclipse-september-2025\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "23-places-to-visit-in-the-netherlands-beyond-amsterdam",
    "title": "23 Places to Visit in the Netherlands Beyond Amsterdam",
    "category": "Travel",
    "subcategory": "3General",
    "category_slug": "travel/3general",
    "date": "2025-09-19",
    "excerpt": "All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.",
    "cover": "https://media.cntraveler.com/photos/68cd85e471b51689b2902ff7/master/pass/091925-Best-Places-Netherlands-Rotterdam-GettyImages-984347524.jpg",
    "source": "https://www.cntraveler.com/gallery/places-to-visit-in-the-netherlands-that-arent-amsterdam",
    "source_domain": "cntraveler.com",
    "source_name": "Cntraveler",
    "author": "Chris Schalkx",
    "rights": "Unknown",
    "body": "<p>All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.</p>\n<p>The Netherlands (or Holland, if you prefer) might just be twice the size of <a href=\"https://www.cntraveler.com/story/best-airbnbs-in-new-jersey\">New Jersey</a>, but somehow stacks up more variety per square mile than most US states. There are polder farmlands drained by dykes, rolling hills in its far south, and more than 250 miles of wind-whipped dunes hemming its coast.</p>\n<p>Few of its 20 million annual visitors see beyond <a href=\"https://www.cntraveler.com/gallery/the-best-hotels-in-amsterdam\">Amsterdam</a>'s canal belt, though. They shuffle through the <a href=\"https://www.cntraveler.com/activities/amsterdam/rijksmuseum\">Rijksmuseum</a>, snap some pictures on a bridge, then roll their suitcases back to Schiphol or the Centraal Station, off to the next European capital. But they're missing out: Even within cycling range from Amsterdam, you'll find old-timey fishing villages and cheese markets where time has seemingly stood still. There are polder scenes, windmills and all, that seem to have been plucked straight out of a Vermeer painting, and come spring, technicolor fields carpeted in tulips.</p>\n<p>A solid train network makes pushing farther out just as painless. It takes just four hours to cross the entire country from north to south. That puts cities like Groningen and Haarlem, with crowd-less canal belts and histories as rich as Amsterdam's, within day-trip distance, but also helps you discover some of the country's wilder side: deer roaming in the pine forests of Hoge Veluwe, endless hiking trails through the De Biesbosch's tidal wetlands, or the Wadden Sea islands, where seals laze the day away on the beach. Below are 23 of Holland's highlights, one in almost every corner of the country (with hotel tips to boot) to add to your next Netherlands itinerary.</p>\n<p>\n      <i>This gallery has been updated with new information since its original publish date. Additional reporting by Katherine LaGrave and Caitlin Morton.</i>\n    </p>\n<ul>\n      <li>TPopova/Getty<h2>Zaandam</h2><p>Wrapped in the Dutch countryside within easy day-trip distance from Amsterdam, Zaandam once stood at the heart of the Dutch milling industry. Remnants of these glory days can be found at Zaanse Schans, a short drive north from downtown, where a stroll through its jumble of windmills and clapboard houses feels like stepping into a real-life version of an Old Masters painting. Downtown, the ubiquitous Zaan-style architecture has gotten a mind-bendingly modern makeover at the landmark Inntel Hotel (an Escher-esque mash-up of traditional Zaanse houses), and the Zaandam City Hall, which reinterprets the shapes of Zaanse houses into minimalist masterpieces.</p><strong>How to get there</strong>: Direct trains from Amsterdam bring you to Zaandam in 15 minutes.<strong>Where to stay</strong>: Right in Zaandam’s heart, the<a href=\"https://cna.st/affiliate-link/2KCmFSX1hptUdQRPBAwatmE6U3F8ghyKEiqemAgLienhVMBAAgVrv5JVWxFAjKiZoq2MAXkCcPiEBzScCyr1a238T52TaoUGm7WKbrHMJ13bdXdthMD459LVyU3pU41FYVhiUdZZvMNZbwhGymK5cHzT3j2BdWJzPXZG3Xas3VpuYEnZn2ogexDe8MrEMZDBChAeevHCyUudqb31EhQ5nhdxF3t2wTcguToMNJrzAmWnpHh2TYffH9BZNHvqZQB6y3xUC5RqbwLb1MmYh4dtKZaKae2tSqkWufgvLrXgyx21o2c9WyAZZGR5Ay49U27xDZ6BDWGdcFLVwAoZ2gv1aDAb8XA2V9cuhvtCT84NZGjsWPG7svyngJ9eXJA58n7DJ827qig5XXCWDEm9NpPw5bpXUxpgBXdviUWZDBtpZLN3yXHQax1iAP5gYQ4\">Inntel Hotel</a>, is hard to miss: its building is an eye-popping Jenga-stack of traditional Zaanse gabled houses. The suites, many with slanted ceilings and walls bedecked in black-and-white historic photographs, further hammer down the local touch.</li>\n      <li>Daniel Bosma/Getty<h2>Groningen</h2><p>For Dutch standards, the two-hour train ride to this northern city is a nearly impossible schlep, but the picturesque journey through rolling farmlands is well worth it. Criss-crossed with canals and dotted with monumental churches, Renaissance-era gardens, and warehouses dating back to the 16th century, Groningen is packed with history. But as one of the country’s main university towns, the city has a surprisingly forward-thinking nightlife scene too. Most of the action happens around</p><a href=\"https://www.visitgroningen.nl/nl/plekken/stad/grote-markt\">de Grote Markt</a>(Big Market) square, which hosts a lively fish and food market by day, and turns into a party hub after dark.<strong>How to get there</strong>: Trains from Amsterdam with a transfer in Utrecht or Almere bring you to Groningen in about two hours.<strong>Where to stay</strong>: A solid mainstay smack in the center of town, the<a href=\"https://cna.st/affiliate-link/4usQ6Put9VSSN73oXEtnLgEmM5uMbicURDLS8FyonjYV9wLxoALwjp3FGvYo1vG1iGiY8ES5NQSbwc5PudQLvY3SmGM8AkjyReeBDym8FhgfeMdp35QhKcFaXE5wdN6iW2aeiht5nPxErBkJZFLZnkCpQ9GmXCf4jgTHpDg2wZwubzAjijzzNoRV4NBdnEsB968LC8ndaeUjXxwqrjDAw712TXTGFM7x5juge2tn1agkzSgN6ehFAw8XyfnZJhMTPBDhg7oqUrsDtTPBhbUHWGJjvf2HuJ7KQ8drGvHpULiZvhTFeXAbGrt2hRXRc4vdVr2iUj6nC29GwHquFQ6FfAM746heF7igXzVnL4GXbCX9TxyWiiu9LSGMK8pUC2sMv9bp3RVq7uSsPgxQXbyrhqToSvP4x2abK31yXXwLHiEU5G5Us3gsZTSU\">Market Hotel</a>delivers smart rooms, a sprawling wellness center (welcome after a day around town) and a gorgeously atmospheric bistro-cafe at a perfectly reasonable price point.</li>\n    </ul>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.cntraveler.com/gallery/places-to-visit-in-the-netherlands-that-arent-amsterdam\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  },
  {
    "slug": "surf-s-up-in-taghazout-how-this-moroccan-surf-town-stays-true-to-its-r",
    "title": "Surf’s up in Taghazout: How this Moroccan surf town stays true to its roots",
    "category": "Travel",
    "subcategory": "11Trip Ideas",
    "category_slug": "travel/11trip-ideas",
    "date": "2025-09-01",
    "excerpt": "Morocco’s coolest surf town is no longer a secret – but as its popularity booms, the local community is rolling with the tides.",
    "cover": "https://www.intrepidtravel.com/adventures/wp-content/uploads/2025/08/Morocco-Taghazout-the-surf-instructor-and-the-writer-taking-a-picture-together-with-shaka-sign-with-thier-hands.jpg",
    "source": "https://www.intrepidtravel.com/adventures/surfing-in-taghazout-morocco/",
    "source_domain": "intrepidtravel.com",
    "source_name": "Intrepidtravel",
    "author": "India Gustin",
    "rights": "Unknown",
    "body": "<p><strong>Morocco’s coolest surf town is no longer a secret – but as its popularity booms, the local community is rolling with the tides. </strong> </p>\n<p>For a second, it feels like I’m losing my balance. But my body reacts before I can think, and my feet readjust, sharpening my stance. I squat lower and my arms steady out – to my surprise, I’m actually gliding along the wave as the whitewash roars behind me. This must be that surfer’s high everyone talks about, I think to myself, beaming. When a local surfer stretches out his arm for a high five, I miss, crashing back into the sea with a laugh that bubbles up from nowhere.</p>\n<p>I’m halfway through a lesson with Dar Surf, a surf camp based in Taghazout, <a href=\"https://www.intrepidtravel.com/morocco\">Morocco</a>. Of course, the waves decide the spot – and it’s rarely on your hostel doorstep. So today we’re a short drive south at Anza Beach, one of countless surf-friendly beaches along Morocco’s Atlantic Coast.  </p>\n<p>Bobbing back to the surface, I catch a glimpse of my instructor, Mohammed Akhermaz – AKA Momo. He throws me a thumbs-up from the lineup, the spot where surfers wait for the next oncoming wave. Like many travellers these days, I had come to Taghazout for the waves and low-key hangouts. But I hadn’t expected to find such a deep sense of community and belonging.</p>\n<p><strong>Read more: </strong><strong>An Intrepid trip inspired me to uproot my life and move to Morocco</strong></p>\n<h2><strong>The rise of Taghazout</strong>  </h2>\n<p>Momo grew up in Rabat, Morocco’s capital city about six hours up the coast, and picked up his first surfboard when he was 17 years old. It was a relatively late start in the world of surfing, but one of his best decisions nonetheless. His passion for catching waves led him to become an instructor and he made the move south to Tamraght – Taghazout’s up-and-coming neighbour – five years ago.</p>\n<p>‘Surfing isn’t just a sport,’ he says. ‘It’s a connection between you and the ocean.’</p>\n<p>It’s this feeling of connection that first drew international surfers to Morocco in the early ’60s and ’70s. Once they’d experienced the country’s underrated waves, word soon spread – and it wasn’t long before foreigners were favouring the consistent surf and jaw-dropping scenery in and around Taghazout.</p>\n<p>Surfers from Europe and the United States would stay for months at a time, camping out on the beaches in vans and tents. Slowly, they introduced the sport to the local community. When it was time to move on, they would often leave behind their boards and wetsuits, giving more locals the chance to fall in love with catching waves.</p>\n<p>Once a tiny fishing village, Taghazout became the epicentre of Moroccan surf culture in just a couple of decades. And the rise of homegrown talent like Olympian Ramzi Boukhiam and big-wave surfer Othmane Choufani has further embedded surfing into the region’s identity.</p>\n<p>Today, business is booming; Taghazout’s visitor numbers have jumped 25 per cent in three years and with a multimillion-dollar resort development project well underway, the region is expected to see those numbers continue to grow. While some locals have valid worries about gentrification and rapid change, many see this growth as a positive step.</p>\n<p>‘I don’t remember a time without tourists,’ Momo says. ‘But [the area] has gotten more famous over the last five years. And that’s good for the locals. It gives us a better life.’</p>\n<p>If there’s one way travellers can support Taghazout as it adapts, he adds, it’s to ‘learn about Morocco before you come,’ he says. ‘The number one rule is to respect the culture and the country first.’</p>\n<p><strong>Read more: </strong><strong>How I found healing on a group trip to Morocco</strong></p>\n<h2><strong>Waves and warm welcomes</strong>  </h2>\n<p>Despite this quick growth, community bonds still run deep in Taghazout. Perhaps that’s because surf culture and Amazigh hospitality echo the same values of generosity, connection and mutual respect. It’s that kind of welcome that keeps people wanting to come back – although I’ve met a few who have simply never left.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.intrepidtravel.com/adventures/surfing-in-taghazout-morocco/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]