[
  {
    "slug": "bob-marley-and-madame-web-are-the-best-hopes-for-february-box-office",
    "title": "Bob Marley and ‘Madame Web’ Are the Best Hopes for February Box Office",
    "category": "Entertainment",
    "subcategory": "General",
    "category_slug": "entertainment/general",
    "date": "2024-02-01",
    "excerpt": "By providing your information, you agree to our Terms of Use and our Privacy Policy . We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
    "cover": "https://www.indiewire.com/wp-content/uploads/2023/1600/Screen-Shot-2023-07-06-at-9.39.27-AM.png?w=1600",
    "source": "https://www.indiewire.com/news/box-office/february-box-office-preview-bob-marley-biopic-marvel-madame-web-1234949721/",
    "source_domain": "indiewire.com",
    "source_name": "Indiewire",
    "author": "Tom Brueggemann",
    "rights": "Unknown",
    "body": "<p>By providing your information, you agree to our <a href=\"https://pmc.com/terms-of-use\">Terms of Use</a> and our <a href=\"https://pmc.com/privacy-policy\">Privacy Policy</a>.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google <a href=\"https://policies.google.com/privacy\">Privacy Policy</a> and <a href=\"https://policies.google.com/terms\">Terms of Service</a> apply.</p>\n<p>At least we have the added day of Leap Year, and the limited IMAX “Dune: Part 2” screenings on February 25 to add some gross. Even so, this is going to be a tough month at the <a href=\"https://www.indiewire.com/t/box-office/\">box office</a>. All told, 2024 could be down 20 percent from last year. We knew going into 2024 that the year would be challenged to meet the $9 billion of 2023 — <a href=\"https://gower.st/articles/forecast-2024-gower-street-announces-31-5-billion-early-global-box-office-estimate/\">predictions assessed the domestic target at about $8 billion,</a> about 11 percent down — but it may be a fight to achieve that much. </p>\n<p>Only five new wide studio releases will debut this month. February 2 has <a href=\"https://www.indiewire.com/criticism/movies/argylle-review-matthew-vaughn-1234949880/\">“Argylle” (Universal)</a>, February 9 “Lisa Frankenstein” (Focus), February 14 “<a href=\"https://www.indiewire.com/t/madame-web/\">Madame Web</a>” (Sony) and “<a href=\"https://www.indiewire.com/t/bob-marley-one-love/\">Bob Marley: One Love</a>” (Paramount), and February 23 “Ordinary Angels” (Lionsgate).\n\n</p>\n<p>January was <a href=\"https://www.indiewire.com/news/box-office/the-beekeeper-mean-girls-weak-box-office-weekend-1234949047/\">a bad month</a>, about 14 percent lower than last year with a little over $500 million. February could be less than $400 million, but with all of these new titles hailing from non-franchise and original spaces, the performance range could be considerable.\n\n</p>\n<p>This January didn’t benefit from holdovers the way it did in 2023, when more than two-thirds of its gross came from Christmas 2022 releases (thank you, “Avatar: The Way of Water,” with $233 million). By comparison, top 2023 holiday release “Wonka” grossed barely a quarter as much. Similarly, February will lack the padding of an “Ant-Man and the Wasp: Quantumania”-sized opener. In its eight days of February 2023 release, it grossed $223 million. That’s not much less than what <i>all</i> new wide releases might do by February 29.</p>\n<p>The month has one expensive release with “<a href=\"https://www.indiewire.com/t/argylle/\">Argylle</a>” (one source pinned the CGI-heavy spy thriller at $200 million) and a lower-cost but still not inexpensive “Madame Web” ($80 million or more). Horror comedy “Lisa Frankenstein” is budgeted under $15 million, while faith-based medical story “Ordinary Angels” (originally was set to open opposite “Taylor Swift: The Eras Tour”) is reported as slightly higher.</p>\n<p>Reviews for “Argylle” give it a weak 40 Metascore, with most suggesting the hybrid spy/comedy doesn’t come off as well as Matthew Vaughn’s earlier “Kingsman” efforts. Made for AppleTV, it gets a studio’s theatrical release ahead of its streaming date. Initial opening hopes were more than $20 million; now the under seems as likely.</p>\n<p>With Valentine’s Day (always a big moviegoing incentive) fallling on a Wednesday, and Presidents’ Day the following Monday, Sony and Paramount both decided to exploit the six-day period with midweek openings. Neither “Madame Web” nor “One Love” has screened widely for the press, although both have premiered (in London and Jamaica, respectively).</p>\n<p><a href=\"https://www.indiewire.com/news/general-news/dakota-johnson-madame-web-superhero-acting-psychotic-1234945991/\">Spider-Man” spin-off</a> <a href=\"https://www.indiewire.com/news/general-news/dakota-johnson-madame-web-superhero-acting-psychotic-1234945991/\">“Madame Web” </a>has a top-drawer cast, including Johnson, Emma Roberts, and Sydney Sweeney, and breakout potential. So does “One Love,” from “King Richard” director Reinaldo Marcus Green; the music biopic has seen iconic figures like Elvis Presley, Freddie Mercury, and Elton John spawn major hits in recent years. The current guess is that “One Love” opens better, with “Madame Web” having the potential to top “Mean Girls” (currently $61 million) as year’s biggest-grossing 2024 <a href=\"https://www.indiewire.com/t/film/\">film</a> to date.</p>\n<p>“Lisa Frankenstein,” opening February 9 (against the Super Bowl), and “Ordinary Angels” on February 23 are projected to gross under $50 million, with most guesses closer to $20 million-$30 million in total gross. Again, as original and unseen titles, uncertainty exists.</p>\n<p>With no holdovers likely to exceed $5 million for any weekend ahead (four of the five wide January releases are already on PVOD, with only “Mean Girls” still theater-exclusive), the new films will have to perform to hit $375 million for the month to meet even the month’s modest projections.That is bad news for theaters.</p>\n<p>The good news is March, which brings “Dune: Part Two,” followed by “Kung Fu Panda 4” (Universal), “Ghostbusters: Frozen Empire” (Sony), and “Godzilla x Kong: The New Empire” (WB). Assuming audiences have recovered from their disdain of franchise titles, all should top $100 million domestic. If they don’t, the box office will spend the rest of the year digging its way out of a deep hole.</p>\n<p><em>…</em></p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.indiewire.com/news/box-office/february-box-office-preview-bob-marley-biopic-marvel-madame-web-1234949721/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Read the full article</a>\n</p>"
  }
]